{"src/commands":["Ripristina","Non è stato possibile aggiornare o installare VS Live Share a causa di un download danneggiato.","Non è stato possibile aggiornare o installare VS Live Share a causa di un download danneggiato.","Si è verificato un problema con l'installazione di Live Share?","$(messagePrefix) Assicurarsi che la connessione di rete sia disponibile, quindi fare clic su `Ripristina` per riavviare VS Code e provare a eseguire il ripristino.","Riprova","Non è possibile completare il ripristino poiché i file sono in uso. Terminare tutti i processi dell’agente Visual Studio Live Share (${processName}) e fare clic su “Riprova”.","L'organizzatore ha terminato la sessione di collaborazione corrente. Cartelle ed editor aperti ora verranno chiusi.","La sessione di collaborazione è scaduta. Accedere e riprovare.","Si è stati rimossi dalla sessione di collaborazione.","L'utente è stato bloccato dalla sessione di collaborazione.","Si è stati disconnessi dalla sessione di collaborazione a causa di un problema di connettività o perché l'organizzatore è passato alla modalità offline.","La sessione di collaborazione è stata terminata a causa di un errore interno.","La sessione di collaborazione è scaduta. Accedere e riprovare.","La sessione di collaborazione è stata terminata perché la connessione di rete non è più disponibile. Verificare lo stato della rete.","La funzionalità di inoltro cloud di Azure è passata alla modalità offline per questa sessione. È possibile che i nuovi partecipanti non riescano ad accedere tramite inoltro. Provare a ripetere la condivisione.","La funzionalità di inoltro cloud di Azure è passata alla modalità offline per questa sessione. È possibile che i nuovi partecipanti non riescano ad accedere tramite inoltro. Provare a ripetere la condivisione.","La sessione di collaborazione è stata terminata a causa di un errore interno."],"src/extension":[],"src/localizeCallback":["Che cosa si vuole fare con altri collaboratori?","Invita gli altri (copia collegamento)","Copia il collegamento all'invito per inviarlo ad altri partecipanti.","Richiama attenzione partecipanti","Richiedere ad altri partecipanti di seguire l'utente.","Condividi terminale in sola lettura","Condividi terminale","Consente di avviare un nuovo terminale/prompt dei comandi per tutti i partecipanti.","Condividi server","Esponi una porta TCP locale a tutti i partecipanti.","Mostra server condivisi","Mostra i server TCP locali condivisi con partecipanti alla collaborazione.","Interrompi condivisione server","Consente di arrestare la condivisione di una porta TCP locale per tutti i partecipanti.","Arresta sessione di collaborazione","Arrestare la sessione di collaborazione, arrestare la condivisione di tutto il contenuto e rimuovere tutti gli accessi ai partecipanti.","Accedi con il tuo account GitHub o Microsoft per ottenere accesso in lettura/scrittura.","Accedi a una sessione di debug condivisa","Consente di collegare il debugger a una sessione di debug che l'host ha condiviso con i partecipanti.","Accedi al terminale condiviso","Consente di aprire il terminale che l'host ha condiviso con i partecipanti.","Accedi al server condiviso","Copia una porta TCP condivisa denominata per l'uso","Abbandona la sessione di collaborazione","Interrompi la partecipazione a questa sessione di collaborazione.","Selezionare una delle seguenti opzioni:","Avvia la sessione di collaborazione","Consente di avviare una sessione di collaborazione per condividere il contenuto e invitare i partecipanti.","Avvia sessione di collaborazione di sola lettura","Consente di avviare una sessione di collaborazione in sola lettura per condividere il contenuto e invitare i partecipanti.","Partecipa alla sessione di collaborazione","Partecipa a una sessione di collaborazione per accedere al contenuto condiviso.","Copia di nuovo","Copia collegamento","Imposta come lettura/scrittura","Imposta come di sola lettura","Avvia condivisione","Guida","OK","Accedi","Continua come anonimo","Altre informazioni","Non visualizzare più questo messaggio","Questo collegamento di invito è scaduto. Condividilo nuovamente per generare un nuovo collegamento.","Non è stato possibile connettersi al server. Verificare di essere connessi a Internet.","Con il servizio $(shortName) è richiesta una versione dell'installazione più recente rispetto a quella installata.","Con l'estensione installata è richiesta una versione più recente del servizio $(shortName).","L'estensione $(shortName) installata è troppo vecchia per la connessione a questa sessione di collaborazione.","La versione dell'estensione $(shortName) usata dall'organizzatore della sessione di collaborazione è meno recente di quella usata dall'utente.","L'agente di $(shortName) è più recente dell'estensione","L'agente di $(shortName) è meno recente dell'estensione","Non è possibile condividere in modalità \"Direct\" perché non ci sono indirizzi IP adatti. Passare alla modalità \"Auto\" o \"Relay\" e riprovare.","Non è stato possibile trovare un indirizzo della connessione compatibile. Passare alla modalità \"Auto\" e riprovare.","Non è possibile connettersi all'organizzatore. Verificare di essere online e che l'organizzatore sia online.","Non è possibile connettersi all'organizzatore in modalità \"Relay\". Verificare di essere online e che l'organizzatore sia online. In tal caso, passare alla modalità \"Auto\" o \"Direct\" e riprovare.","Non è possibile connettersi all'organizzatore in modalità \"Direct\". Verificare di essere online e che l'organizzatore sia online. In tal caso, passare alla modalità \"Auto\" o \"Relay\" e riprovare.","Non è possibile accedere all'organizzatore a causa di un errore di protocollo. Verificare di essere online, che l'organizzatore sia online e che si stia usando l'ultima versione di $(shortName).","Non è possibile accedere all'organizzatore a causa di un errore di autenticazione. Verificare che l'organizzatore sia online, quindi disconnettersi, eseguire di nuovo l'accesso e riprovare.","Non è possibile accedere all'organizzatore a causa di un errore di autenticazione. Verificare che l'organizzatore sia online, quindi disconnettersi, eseguire di nuovo l'accesso e riprovare.","Errore di autenticazione imprevisto. Provare a eseguire di nuovo l'accesso.","Lo scambio di token non è riuscito. Codice: ${code}","L'organizzatore non consente connessioni dirette. Passare alla modalità \"Auto\" o \"Relay\" e riprovare.","Non è possibile connettersi perché l'organizzatore non consente connessioni le connessioni inoltrate. Passare alla modalità \"Auto\" o \"Direct\" e riprovare.","Non è stato possibile accedere alla sessione di collaborazione perché è già stato raggiunto il numero massimo di 5 partecipanti. Per aumentare il limite di partecipanti, chiedere all'organizzatore di cambiare l'impostazione Aumento limite partecipanti, ricaricare e quindi avviare una nuova sessione di collaborazione.","L'organizzatore ha rifiutato l'accesso alla sessione di collaborazione.","Si è verificato un timeout mentre si attendeva la risposta dell'organizzatore alla richiesta.","La richiesta di accesso alla sessione di collaborazione è stata annullata.","La sessione di collaborazione non è stata trovata.","L'organizzatore ha impedito l'accesso alla sessione di collaborazione. Se si tratta di un errore, chiedere all'organizzatore di riavviare la sessione.","Non è stato possibile connettersi al server. È stato ricevuto un codice di stato di operazione non riuscita.","Live Share non è riuscito ad accedere al portachiavi di accesso. Questo problema può verificarsi se di recente è stata cambiata la password o se il portachiavi di accesso è danneggiato. Vedere Altre informazioni per sapere come risolvere il problema.","La connessione di rete dell'organizzatore è insufficiente oppure l'organizzatore non è più connesso all'inoltro cloud di Live Share. Chiedere all'organizzatore di controllare la connessione di rete, riavviare la sessione di collaborazione e riprovare.","Non è possibile connettersi all'inoltro cloud di Live Share. Controllare le impostazioni di proxy, firewall e rete, quindi riprovare.","L'organizzatore non consente di avviare il debugger. Se necessario, chiedere di abilitarlo.","Non è stato possibile connettersi al server. La connessione HTTPS non è riuscita. Verificare che non ci siano certificati autofirmati o criteri personalizzati di convalida dei certificati che bloccano Live Share.","Non è stato possibile creare una sessione pianificata","Non è stato possibile eliminare una sessione pianificata","Non è stato possibile rinominare la sessione pianificata","Non è stato possibile copiare il collegamento alla sessione pianificata","Non è stato possibile accedere alle sessioni pianificate","Sembra che sia presente una directory contenente file con lo stesso nome, ad eccezione dell'uso di maiuscole/minuscole. Questo comportamento non è supportato e potrebbe causare errori.","VS Code viene eseguito all'esterno della cartella Applications, di conseguenza non è possibile installare il supporto per la partecipazione alle sessioni tramite Browser Link. È comunque possibile partecipare alle sessioni in modo manuale.","Non è stato possibile installare il supporto per la partecipazione alle sessioni tramite Browser Link. È comunque possibile partecipare alle sessioni in modo manuale.","Apertura della sessione remota...","Accesso alla sessione remota...","In attesa dell'approvazione dell'organizzatore...","Connessione persa. Riconnessione all'host...","Creazione della una sessione pianificata...","Eliminazione della sessione pianificata...","Percorso non trovato: lazyLoad(() => nlsloc($(path)","Percorso già esistente: lazyLoad(() => nlsloc($(path)","Accesso negato: lazyLoad(() => nlsloc($(path)","Il file è troppo grande.","Il file non è disponibile.","ha richiesto l'accesso alla sessione di collaborazione.","Accetta","Accetta di sola lettura","Accetta di lettura/scrittura","Rifiuta","Accetta sempre anonimi","ha eseguito l'accesso alla sessione di collaborazione."," è stato disconnesso.","ha abbandonato la sessione di collaborazione.","$(userId) ha richiamato l'attenzione.","$(userId) ha richiesto di essere seguito.","Il collegamento alla sessione è stato copiato.","Le informazioni sulla modifica congiunta sono state copiate negli Appunti.","Per supportare la partecipazione a una sessione tramite Browser Link, è necessario disporre dell'autorizzazione per eseguire un programma di installazione nel sistema. Il sistema operativo potrebbe richiedere la password dell'amministratore (sudo) in un terminale. Installare ora?","Il comando di installazione del launcher di Browser Link è stato copiato negli Appunti.","È possibile eseguire il comando \"Live Share: Configura launcher\" per completare l'integrazione in un secondo momento.","Il launcher di Browser Link è stato installato.","Copia invece","Installa","Collegamento all'invito copiato negli Appunti. Invialo a chiunque ti fidi","Sessione condivisa Fai clic su \"Copia collegamento\" per ottenere un collegamento di invito","oppure fai clic su \"Altre informazioni\" per informazioni sulla condivisione sicura.","Un collegamento alla sessione riutilizzabile viene copiato negli Appunti. Salva il collegamento in un percorso sicuro. Scopri di più su come usare la sessione facendo clic su \"Altre informazioni\".","È stato creato un collegamento alla sessione riutilizzabile. Fare clic su \"Copia collegamento\" per ottenere il collegamento. Salvare il collegamento in un percorso sicuro. Per altre informazioni su come usare la sessione, fare clic su \"Altre informazioni\".","Esegui l'accesso a VS Live Share per partecipare a una sessione di collaborazione.","Devi eseguire l'accesso prima di poter partecipare alla sessione di collaborazione.","$(options.title)","Impossibile modificare il terminale in modalità di sola lettura (anonima). Accedere per continuare.","Seleziona una sessione pianificata","Scadenza: ","Crea sessione pianificata...","Crea una sessione pianificata","Specificare il nome della sessione pianificata","Il nome non può essere vuoto. Immettere un nome alfanumerico per la sessione","Il nome non è valido. Immettere un nome alfanumerico per la sessione"," (Di sola lettura)"," (Anonimo e di sola lettura)"," (Anonimo e di lettura/scrittura)"," (Anonimo)","In una sessione di Live Share","Digitare per cercare contatti","Selezionare il provider di presenza da usare","Invitato","Invitato","Invitato","Avvia la sessione di collaborazione..."," (Di sola lettura)"," (Anonimo e di sola lettura)"," (Anonimo e di lettura/scrittura)","Utente in sola lettura","Continua come","Continua senza eseguire l'accesso come partecipante in sola lettura","Selezionare l'account per l'accesso","Accedere con l'account ${key}","Non è possibile creare il thread di commento","Non è possibile eliminare il thread di commento","Non è possibile rispondere","Non è possibile modificare il commento","Non è possibile salvare il commento","Non è possibile annullare la modifica del commento","Non è possibile eliminare il commento","eliminare prima gli altri commenti sul thread","Commenti sessione di Live Share","Partecipanti:","Chat di Live Share: $(unreads) nuovi","Chat","Chat della sessione","Chat di Live Share","Seleziona un canale di chat","($(unread) nuovo)","$(username) sta digitando...","_ha avviato la sessione di Live Share_","_ha terminato la sessione di Live Share_","_ha partecipato alla sessione di Live Share_","_ha abbandonato la sessione di Live Share_","L'organizzatore di questa sessione di collaborazione è attualmente disconnesso dalla chat oppure usa una versione di _Live Share_ che non supporta questa funzionalità. [Altre informazioni](https://aka.ms/vsls-chat)","La persona che si sta provando a contattare non è attualmente disponibile o usa una versione di _Live Share_ che non supporta questa funzionalità. [Altre informazioni](https://aka.ms/vsls-chat)","Utente sconosciuto","Chatta con questo contatto","Apri il canale di chat della sessione","Il servizio chat è attualmente disconnesso. Riprovare tra poco.","Aggiornare l'estensione complementare `Chat di Live Share`. La versione installata non è più compatibile. [Altre informazioni](https://aka.ms/vsls-chat)","Selezionare una delle seguenti opzioni:","$(x) Disconnettiti","Disconnettiti dalla chiamata vocale.","$(mute) Disattiva l’audio","$(unmute) Riattiva il tuo audio","Disattiva l'audio in modo da essere ascoltati dagli altri.","Consente di riattivare il microfono per consentire ad altri utenti di sentirti.","$(organization) Visualizza i partecipanti","Consente di visualizzare l'elenco dei partecipanti a Live Share che sono attualmente impegnati nella chiamata.","$(unmute) Configura gli altoparlanti","Consente di selezionare gli altoparlanti da utilizzare per la chiamata vocale.","$(megaphone) Configura il microfono","Seleziona il microfono da utilizzare per la chiamata vocale.","Partecipanti: (0)","Partecipazione alla chiamata vocale...","Avvia chiamata vocale...","Collegamento con la chiamata vocale...","Avvio della chiamata vocale...","Chiusura della chiamata vocale...","Chiamata vocale","Partecipanti alla chiamata vocale ($(participantCount))","Utente sconosciuto","$(displayName) (tu)","Partecipa","Connessione dell'audio...","Disconnessione dell'audio...","Partecipanti alla chiamata vocale","Seleziona il microfono da usare","Seleziona l’altoparlante da usare","È stata avviata una chiamata vocale per questa sessione di collaborazione.","Il set di risultati contiene solo un subset di tutte le corrispondenze. Eseguire una ricerca più specifica per ridurre il numero di risultati.","[Novità]","L'organizzatore ha condiviso un server $(sessionName). Visualizzarlo nel browser?","Sì","No","Non è possibile aprire il server $(sessionName) nel browser. L'organizzatore ha annullato la condivisione","Area di lavoro di Live Share","L'organizzatore ha il notebook aperto con","Usa la stessa visualizzazione per aprire","La modifica congiunta non è supportata per i notebook aperti con visualizzazioni non condivise.","Kernel per l'esecuzione delle celle nel computer dell'organizzatore","L'organizzatore ha concesso l'accesso per eseguire le celle del notebook","L'organizzatore ha rifiutato la richiesta di eseguire le celle del notebook","Non è possibile eseguire le celle del notebook in una sessione di sola lettura","L'organizzatore non ha concesso l'autorizzazione per eseguire le celle del notebook","Richiedi l'accesso","Consenti per questa sessione","Consenti sempre","Rifiuta","Un partecipante richiede l'autorizzazione per eseguire le celle del notebook","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["L'area di lavoro è stata condivisa, ma una o più cartelle non sono cartelle locali e non è stato possibile includerle nell'area di lavoro condivisa.","Non è possibile connettersi a Inoltro di Azure. È possibile collaborare solo con i partecipanti nella stessa rete. Verificare che il firewall di rete, il DNS o il proxy non blocchi l'accesso a Inoltro di Microsoft Azure e riprovare."],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share è ora disponibile a livello generale. Grazie per averci consentito di raggiungere questo risultato. In qualità di partecipante al programma Insider, si continuerà a ricevere per primi le nuove funzionalità.","Altre info","Passa alle funzionalità stabili"],"src/_new_/util/WorkspaceFirewallUtil":["Non è possibile condividere. Visual Studio Live Share è attualmente in modalità di connessione \"Direct\" e il firewall ha bloccato le connessioni protette in ingresso necessarie per avviare una sessione di collaborazione. \r\n\r\nPer condividere, è necessario modificare le regole del firewall per consentire a vsls-agent.exe di accettare connessioni in ingresso o passare alla modalità di connessione \"Auto\" o \"Relay\".","Il firewall impedisce a vsls-agent.exe di accettare connessioni dirette su porte richieste da Visual Studio Live Share per migliorare le prestazioni per i collaboratori nella stessa rete.\r\n \r\nLive Share passerà ora alla modalità di connessione \"Relay\" per tutte le sessioni future e instraderà il traffico tramite un inoltro cloud. In alternativa, premere \"Annulla\" per arrestare la condivisione.","Visual Studio Live Share è attualmente in modalità di connessione \"Direct\" e, per funzionare, deve accettare connessioni protette in ingresso durante la condivisione.\r\n\r\nIl firewall chiederà ora di concedere a vsls-agent.exe l'accesso alle porte richieste. Se si rifiuta di concedere l'accesso, non sarà possibile condividere.","Visual Studio Live Share è attualmente in modalità di connessione \"Auto\", che consente di migliorare le prestazioni per i collaboratori nella stessa rete accettando connessioni protette in ingresso durante la condivisione.\r\n\r\nIl firewall chiederà ora di concedere a vsls-agent.exe l'accesso alle porte richieste. Se si rifiuta di concedere questo accesso, tutte le connessioni verranno instradate tramite un inoltro cloud."],"src/abstractions/node/agent":[]}