{"src/commands":["Reparar","Falha em uma atualização ou instalação do VS Live Share devido a um download corrompido.","Falha em uma atualização ou instalação do VS Live Share devido a um download corrompido.","Problemas com a instalação do Live Share?","$(messagePrefix) Verifique se há conectividade de rede e clique em `Reparar` para reiniciar o VS Code e tentar a recuperação.","Repetir","Não é possível concluir o reparo, pois os arquivos estão em uso. Encerre todos os processos do Agente do Visual Studio Live Share (${processName}) e clique em 'Repetir'","O host encerrou a sessão de colaboração atual. As pastas e os editores abertos serão fechados agora.","A sessão de colaboração expirou. Entre e tente novamente.","Você foi removido da sessão de colaboração.","Você foi removido da sessão de colaboração.","Você foi desconectado da sessão de colaboração devido a um problema de conectividade ou devido ao host ter ficado offline.","A sessão de colaboração foi encerrada devido a um erro interno.","A sessão de colaboração expirou. Entre e tente novamente.","A sessão de colaboração foi encerrada porque uma rede ficou offline. Verifique o status da rede.","A Retransmissão por meio da Nuvem do Azure ficou offline nesta sessão. Os novos participantes não poderão ingressar com êxito por meio da retransmissão. Considere compartilhar novamente.","A Retransmissão por meio da Nuvem do Azure ficou offline nesta sessão. Os novos participantes não poderão ingressar com êxito por meio da retransmissão. Considere compartilhar novamente.","A sessão de colaboração foi encerrada devido a um erro interno."],"src/extension":[],"src/localizeCallback":["O que você deseja fazer com outros colaboradores?","Convidar outras pessoas (Copiar link)","Copie o link do convite para enviá-lo a outros participantes.","Focar a atenção dos participantes","Solicite que outros participantes o sigam.","Compartilhar Terminal Somente leitura","Compartilhar Terminal","Inicie um novo terminal/ prompt de comando para uso por todos os participantes.","Compartilhar Servidor","Exponha uma porta TCP local para todos os participantes.","Mostrar Servidores Compartilhados","Mostrar servidores TCP locais compartilhados com participantes de colaboração.","Interromper o compartilhamento do Servidor","Pare de compartilhar uma porta TCP local para todos os participantes.","Parar a Sessão de Colaboração","Pare a sessão de colaboração, pare de compartilhar todo o conteúdo e remova o acesso de todos os participantes.","Entre com sua conta Microsoft ou GitHub para obter acesso de leitura/gravação.","Anexar a uma sessão de depuração compartilhada","Anexe o seu depurador a uma sessão de depuração que o host compartilhou com os participantes.","Acessar o Terminal Compartilhado","Abra o terminal que o host compartilhou com os participantes.","Acessar servidor compartilhado","Copiar uma porta TCP nomeada e compartilhada para uso","Deixar a sessão de colaboração","Interromper a participação nesta sessão de colaboração.","O que você deseja fazer?","Iniciar a Sessão de Colaboração","Inicie uma sessão de colaboração para compartilhar conteúdo e convidar participantes.","Iniciar sessão de colaboração somente leitura","Inicie uma sessão de colaboração somente leitura para compartilhar conteúdo e convidar participantes.","Ingressar na Sessão de Colaboração","Ingresse em uma sessão de colaboração para acessar o conteúdo compartilhado.","Copiar novamente","Copiar link","Fazer leitura/gravação","Tornar somente leitura","Iniciar Compartilhamento","Ajuda","OK","Entrar","Continuar como anônimo","Mais informações","Não mostrar isso novamente","Este link de convite expirou. Compartilhe novamente para gerar um novo link.","Não foi possível conectar ao servidor. Verifique se você está conectado à Internet.","O serviço $(shortName) requer uma versão mais recente da extensão do que você instalou.","A extensão que você instalou requer uma versão mais recente do serviço $(shortName).","A extensão $(shortName) que você instalou é muito antiga para se conectar a essa sessão de colaboração.","O host de sessão de colaboração está em uma versão mais antiga da extensão $(shortName) do que aquela em que você está.","O agente $(shortName) é mais recente que a extensão","O agente $(shortName) é mais velho que a extensão","Não é possível compartilhar no modo \"Direto\", pois não existem endereços IP apropriados. Alterne para o modo \"Auto\" ou \"Retransmissão\" e tente novamente.","Não foi possível encontrar um endereço de conexão compatível. Mude para o modo \"Auto\" e tente novamente.","Não foi possível conectar ao host. Verifique se você e o host estão online.","Não foi possível conectar ao host no modo \"Relay\". Verifique se você e o host estão online. Caso estejam, mude para o modo \"Auto\" ou \"Direct\" e tente novamente.","Não foi possível conectar ao host no modo \"Direct\". Verifique se você e o host estão online. Caso estejam, mude para o modo \"Auto\" ou \"Relay\" e tente novamente.","Não é possível ingressar no host devido a um erro de protocolo. Verifique se você e o host estão online e estão usando a versão mais recente do $(shortName).","Não foi possível ingressar no host devido a um erro de autenticação. Verifique se o host está online e, em seguida, saia e entre e tente novamente.","Não foi possível ingressar no host devido a um erro de autenticação. Verifique se o host está online e, em seguida, saia e entre e tente novamente.","Erro de autenticação inesperado. Tente entrar novamente.","Falha na troca de token com o código: ${code}","O host não permite conexões diretas. Mude para o modo \"Auto\" ou \"Relay\" e tente novamente.","Não foi possível conectar porque o host não permite conexões retransmitidas. Mude para o modo \"Auto\" ou \"Direct\" e tente novamente.","Não foi possível ingressar na sessão de colaboração, pois ela já atingiu o máximo de cinco participantes. Para aumentar o limite de participantes, peça para o host alterar a configuração Limite de Convidados Aumentado, recarregue e inicie uma nova sessão de colaboração.","O host rejeitou seu pedido de juntar-se à sessão de colaboração.","O tempo limite foi atingido durante a espera para o host responder à sua solicitação.","A solicitação para ingressar na sessão de colaboração foi cancelada.","Sessão de colaboração não encontrada.","O host impediu a sua participação na colaboração. Se isso foi acidental, peça ao host para reiniciar a sessão.","Não foi possível conectar ao servidor. Recebido o código de status de não sucesso.","O Live Share não foi capaz de acessar o conjunto de chaves de login. Isso pode acontecer se você recentemente mudou sua senha ou se o seu conjunto de chaves de login foi corrompido. Veja mais informações para obter detalhes sobre como corrigir isso.","As condições de rede do host são ruins ou ele não está conectado à retransmissão por meio da nuvem do Live Share. Solicite que eles verifiquem as condições de rede, reiniciem a sessão de colaboração e tentem novamente.","Não foi possível conectar à retransmissão por meio da nuvem do Live Share. Verifique suas configurações de proxy, firewall e rede e tente novamente.","O host não permite que o depurador seja iniciado. Se necessário, solicite que ele seja habilitado.","Não foi possível conectar ao servidor. Falha na conexão HTTPS, verifique se não há certificados autoassinados ou políticas de validação de certificado personalizadas bloqueando o Live Share.","Falha ao criar uma Sessão Planejada","Falha ao excluir uma Sessão Planejada","Falha ao renomear a Sessão Planejada","Falha ao copiar o link da Sessão Planejada","Falha ao ingressar nas Sessões Planejadas","Parece que você tem um diretório com arquivos que têm o mesmo nome, com diferença apenas no uso de maiúsculas e minúsculas. Não há suporte para isso no momento. Isso pode causar erros.","Você está executando o VS Code fora da pasta Aplicativos, portanto, não podemos instalar o suporte para ingressar em sessões usando um link do navegador. Você ainda pode ingressar nas sessões manualmente.","Falha ao instalar o suporte para ingressar em sessões usando um link do navegador. Você ainda pode ingressar nas sessões manualmente.","Abrindo uma sessão remota...","Ingressando na sessão remota...","Aguardando aprovação do host...","Conexão perdida. Reconectando ao host...","Criando a sessão planejada...","Excluindo a sessão planejada...","Caminho não encontrado: lazyLoad(() => nlsloc($(path)","O caminho já existe: lazyLoad(() => nlsloc($(path)","Acesso negado: lazyLoad(() => nlsloc($(path)","O arquivo é muito grande.","O arquivo não está disponível.","pediu para participar da sessão de colaboração.","Aceitar","Aceitar somente leitura","Aceitar leitura/gravação","Rejeitar","Sempre aceitar anônimo","ingressou na sessão de colaboração.","foi desconectado."," deixou a sessão de colaboração.","$(userId) pediu sua atenção.","$(userId) solicitou que você o siga.","Link da sessão copiado.","Informações de coedição copiadas para a área de transferência.","Para oferecer suporte ao ingresso em uma sessão usando um link do navegador, precisamos de permissão para executar um instalador em seu sistema. Seu sistema operacional pode solicitar sua senha de administrador (sudo) em um terminal. Instalar agora?","Comando de instalação do iniciador de link do navegador copiado para a área de transferência.","Você pode executar o comando \"Live Share: Configuração do Inicializador\" para concluir a integração posteriormente.","Iniciador de link do navegador instalado com êxito.","Copiar em vez disso","Instalar","Link de convite copiado para a área de transferência! Envie para qualquer pessoa de sua confiança","Sessão compartilhada! Clique em \"Copiar link\" para obter um link de convite ","ou clique em \"Mais informações\" para saber mais sobre o compartilhamento seguro.","Um link de sessão reutilizável é copiado para a área de transferência. Salve o link em um local seguro. Saiba mais sobre como usar sua Sessão clicando em \"Mais informações\".","Um link de Sessão Reutilizável é criado! Clique em \"Copiar link\" para obter o link. Salve o link em um local seguro. Saiba mais sobre como usar sua Sessão clicando em \"Mais informações\".","Faça login no VS Live Share para participar de uma sessão de colaboração.","Você precisa entrar antes de entrar na sessão de colaboração.","$(options.title)","Não é possível editar o terminal no modo somente leitura (anônimo). Entre para continuar.","Selecionar uma sessão planejada","Expiração: ","Criar uma sessão planejada...","Criar uma sessão planejada","Especificar o nome da sessão planejada","O nome não pode ficar vazio. Insira um nome alfanumérico para a sessão","O nome é inválido. Insira um nome alfanumérico para a sessão"," (Somente leitura)"," (Anônimo e Somente leitura)"," (Anônimo e Leitura/gravação)"," (Anônimo)","Em uma sessão do Live Share","Tipo no qual procurar contatos","Selecione o provedor de presença a ser usado","Convidado","Convidado","Convidado","Iniciar a sessão de colaboração..."," (Somente leitura)"," (Anônimo e Somente leitura)"," (Anônimo e Leitura/gravação)","Usuário Somente Leitura","Continuar como","Continuar sem entrar como um convidado Somente leitura","Selecione a conta para entrada","Entrar usando a conta ${key}","Não é possível criar o thread de comentário","Não é possível excluir o thread de comentário","Não é possível responder","Não é possível editar o comentário","Não é possível salvar o comentário","Não é possível cancelar a edição do comentário","Não é possível excluir o comentário","excluir outros comentários no thread primeiro","Comentários da Sessão do Live Share","Participantes:","Chat do Live Share: $(unreads) novos","Chat","Chat de sessão","Chat do Live Share","Selecionar um canal de chat","($(unread) novo)","$(username) está digitando...","_iniciou a sessão do Live Share_","_encerrou a sessão do Live Share_","_ingressou na sessão do Live Share_","_saiu da sessão do Live Share_","No momento, o host desta sessão de colaboração está desconectado do chat ou está usando uma versão do _Live Share_ sem suporte para esse recurso. [Saiba mais](https://aka.ms/vsls-chat)","A pessoa com quem você está tentando entrar em contato não está disponível no momento ou está usando uma versão do _Live Share_ sem suporte para esse recurso. [Saiba mais](https://aka.ms/vsls-chat)","Usuário desconhecido","Conversar com este contato","Abrir o canal de chat de sessão","O serviço de chat está desconectado no momento. Tente novamente em breve.","Atualize a extensão complementar `Chat do Live Share`. A versão instalada não é mais compatível. [Saiba mais](https://aka.ms/vsls-chat)","O que você deseja fazer?","$(x) Desconectar","Desconecte-se da chamada de áudio.","$(mudo) Silenciar Você Mesmo","$(ativar o som) Reativar Seu Som","Mude-se para que os outros não possam ouvi-lo.","Ative o som do seu microfone para que outras pessoas possam ouvi-lo.","$(organização) Exibir participantes","Exiba a lista de participantes do Live Share que estão atualmente na chamada.","$(ativar o som) Configurar Alto-falantes","Selecione quais alto-falantes usar para a chamada de áudio.","$(megafone) Configurar Microfone","Selecione qual microfone usar para a chamada de áudio.","Participantes (0)","Entrar na chamada de áudio...","Iniciar chamada de áudio...","Ingressando na chamada de áudio...","Iniciando a chamada de áudio...","Finalizando a chamada de áudio...","Chamada de Áudio","Participantes da chamada de áudio ($ (participantCount))","Usuário desconhecido","$(displayName) (você)","Ingressar","Conectando áudio...","Desconectando o áudio...","Participantes de Chamada de Áudio","Selecionar o microfone para usar","Selecionar o alto-falante para usar","Uma chamada de áudio foi iniciada para esta sessão de colaboração.","O conjunto de resultados contém apenas um subconjunto de todas as correspondências. Seja mais específico na sua pesquisa para restringir os resultados.","[Novo]","O host compartilhou um servidor $(sessionName) com você. Deseja exibi-lo no navegador?","Sim","Não","Não é possível abrir o servidor $(sessionName) no navegador. O host descompartilhou o servidor","Workspace do Live Share","O host tem o notebook aberto com","Usar a mesma exibição para abrir","A coedição não é compatível com notebooks abertos com exibições não compartilhadas.","Kernel para executar células no computador do host","O host concedeu a você acesso para executar células do notebook","O host rejeitou sua solicitação para executar células do notebook","Não é possível executar células do notebook em uma sessão somente leitura","O host não concedeu permissão para executar células do notebook","Solicitar acesso","Permitir para esta sessão","Permitir sempre","Rejeitar","Um convidado está solicitando permissão para executar células do notebook","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Seu workspace era compartilhado, mas uma ou mais pastas não eram pastas locais e não puderam ser incluídas no workspace compartilhado.","Não é possível conectar à Retransmissão do Azure, você só pode colaborar com participantes na mesma rede. Verifique se o firewall, o DNS ou o proxy da rede não está bloqueando o acesso à Retransmissão do Microsoft Azure e tente novamente."],"src/_new_/decorators/gaNotificationCommandDecorator":["O Live Share agora está em GA, e gostaríamos de agradecer você por nos ajudar a chegar lá. Como membro, você continuará recebendo novos recursos primeiro.","Mais informações","Alternar para recursos estáveis"],"src/_new_/util/WorkspaceFirewallUtil":["Não é possível compartilhar. O Visual Studio Live Share está atualmente no modo de conexão \"Direta\" e seu firewall bloqueou as conexões seguras recebidas necessárias para iniciar uma sessão de colaboração.\r\n\r\nPara compartilhar, você precisará modificar suas regras de firewall para permitir que o vsls-agent.exe aceite conexões de entrada ou mude para o modo de conexão \"Auto\" ou \"Relay\".","O firewall está bloqueando a aceitação de conexões diretas por vsls-agent.exe nas portas que o Visual Studio Live Share requer para melhorar o desempenho de colaboradores na mesma rede.\r\n\r\nO Live Share agora vai mudar para o modo de conexão \"Retransmissão\" para todas as sessões futuras e rotear o tráfego através de uma retransmissão por meio da nuvem. Pressione 'Cancelar' para interromper o compartilhamento em vez disso","O Visual Studio Live Share está atualmente no modo de conexão \"Direta\" e precisa aceitar conexões de entrada protegidas ao compartilhar para funcionar.\r\n\r\nO seu firewall agora solicitará que você dê acesso ao vsls-agent.exe às portas necessárias. Se você negar o acesso, você não será capaz de compartilhar.","O Visual Studio Live Share está atualmente no modo de conexão \"Auto\", que melhora o desempenho de colaboradores na mesma rede aceitando conexões seguras ao compartilhar.\r\n\r\nSeu firewall agora solicitará que você forneça a vsls-agent.exe o acesso às portas necessárias. Negar este acesso fará com que, em vez disso, todas as conexões sejam roteadas através de uma retransmissão de nuvem."],"src/abstractions/node/agent":[]}