{"src/commands":["修复","由于下载已损坏，VS Live Share 的更新或安装失败。","由于下载已损坏，VS Live Share 的更新或安装失败。","Live Share 安装有问题?","$(messagePrefix) 确保具有网络连接，然后单击“修复”以重启 VS Code 并尝试恢复。","Retry","Unable to finish repair as files are in use. Please end all Visual Studio Live Share Agent (${processName}) processes and click `Retry`","主持人已结束当前协作会话。打开的文件夹和编辑器将立即关闭。","协作会话已过期。请登录，然后重试。","已从协作会话中将你删除。","You have been blocked from the collaboration session.","由于连接问题或主机脱机，你已与协作会话断开连接。","由于内部错误，协作会话已结束。","协作会话已过期。请登录，然后重试。","由于网络脱机，协作会话已结束。请检查网络状态。","此会话的 Azure 云中继脱机，新的来宾可能无法通过中继成功加入。请考虑重新共享。","此会话的 Azure 云中继脱机，新的来宾可能无法通过中继成功加入。请考虑重新共享。","由于内部错误，协作会话已结束。"],"src/extension":[],"src/localizeCallback":["What would you like to do with other collaborators?","Invite Others (Copy Link)","Copy the invitation link so you can send it to other participants.","Focus Participants","Request other participants to follow you.","Share Read-only Terminal","Share Terminal","Start a new terminal / command prompt for use by all participants.","Share Server","Expose a local TCP port to all participants.","Show Shared Servers","Show local TCP servers shared with collaboration participants.","Stop Sharing Server","Stop sharing a local TCP port for all participants.","Stop Collaboration Session","Stop collaboration session, stop sharing all content, and remove all participant access.","Sign in with your GitHub or Microsoft account to gain read/write access.","Attach to a Shared Debugging Session","Attach your debugger to a debug session that the host has shared with participants.","Access Shared Terminal","Open terminal that the host has shared with participants.","Access Shared Server","Copy a named, shared TCP port for use","Leave Collaboration Session","Stop participating in this collaboration session.","What would you like to do?","Start Collaboration Session","Start a collaboration session to share content and invite participants.","Start Read-only Collaboration Session","Start a read-only collaboration session to share content and invite participants.","Join Collaboration Session","Join a collaboration session to access shared content.","Copy again","Copy link","Make read/write","Make read-only","Start Sharing","Help","OK","Sign in","Continue as anonymous","More info","Don't show again","This invite link has expired. Share again to generate a new link.","无法连接到服务器。检查是否已连接到 Internet。","$(shortName) 服务需要一个比你安装的扩展更新的版本。","你安装的扩展需要较新版本的 $(shortName) 服务。","你安装的 $(shortName) 扩展太旧，无法连接到此协作会话。","The collaboration session host is on an older version of the $(shortName) extension than you are.","The $(shortName) agent is newer than the extension","The $(shortName) agent is older than the extension","Unable to share in \"Direct\" mode as there are no suitable IP addresses. Switch to \"Auto\" or \"Relay\" mode and retry.","Could not find a compatible connection address. Switch to \"Auto\" mode and retry.","Unable to connect to the host. Verify both you and the host are online.","Unable to connect to the host in \"Relay\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Direct\" mode and retry.","Unable to connect to the host in \"Direct\" mode. Verify you and the host are online. If so, switch to \"Auto\" or \"Relay\" mode and retry.","Unable to join the host due to a protocol error. Verify you and the host are online and are using the latest version of $(shortName).","Live Share didn't succeed reusing a GitHub token for authentication. This could be caused by either a token expiration or revocation. Refresh your GitHub account in VSCode and run Live Share again to fix the problem.","Live Share didn't succeed reusing a GitHub token for authentication. This could be caused by either a token expiration or revocation. Refresh your GitHub account in VSCode and run Live Share again to fix the problem.","Unexpected authentication error. Try signing in again.","Token exchange failed with code: ${code}","The host does not allow direct connections. Switch to \"Auto\" or \"Relay\" mode and retry.","Unable to connect since the host does not allow relayed connections. Switch to \"Auto\" or \"Direct\" mode and retry.","Could not join the collaboration session as it has already reached the maximum of 5 participants. To increase the participant limit, please ask the host to change the Increased Guest Limit setting, reload and then start a new collaboration session.","The host has rejected you from joining the collaboration session.","Timed out while waiting for the host to respond to your request.","Request to join the collaboration session was canceled.","Collaboration session not found.","The host has blocked you from joining the collaboration. If this was accidental, please ask the host to restart the session.","Could not connect to the server. Received non success status code.","Live Share was unable to access the login keychain. This can happen if you recently changed your password or your login keychain has become corrupted. See more info for details on how to fix it.","The host's network conditions are poor or they are no longer connected to the Live Share cloud relay. Ask them to check their network conditions, restart the collaboration session, and try again.","Unable to connect to Live Share cloud relay. Check your proxy, firewall and network settings and try again.","The host doesn’t allow starting the debugger. If needed, ask them to enable it.","Could not connect to the server. HTTPS connection failed, verify there are no self-signed certificates or custom cert validation policies blocking Live Share.","Failed to create a Planned Session","Failed to delete a Planned Session","Failed to rename Planned Session","Failed to copy Planned Session link","Failed to join Planned Sessions","It looks like you have a directory with files that have the same name, except for the casing. This is currently unsupported and may lead to errors.","You are running VS Code outside the Applications folder, so we cannot install support for joining sessions using a browser link. You can still join sessions manually.","Failed to install support for joining sessions using a browser link. You can still join sessions manually.","正在打开远程会话...","正在加入远程会话...","正在等待主持人批准...","连接断开。请重新连接到主机...","正在创建计划的会话…","正在删除计划的会话…","找不到路径: lazyLoad(() => nlsloc($(path)","路径已存在: lazyLoad(() => nlsloc($(path)","拒绝被拒: lazyLoad(() => nlsloc($(path)","文件太大。","文件不可用。","请求加入协作会话。","接受","Accept read-only","Accept read-write","拒绝","始终接受匿名","加入了协作会话。","已断开连接。","离开协作会话。","$(userId) 聚焦关注。","$(userId) 请求你跟随他们。","已复制会话链接。","Co-editing information copied to clipboard.","To support joining a session using a browser link, we need permission to run an installer on your system. Your OS may ask you for your admin (sudo) password in a terminal. Install now?","Browser link launcher install command copied to clipboard.","You can run the \"Live Share: Launcher Setup\" command to complete the integration later.","Browser link launcher successfully installed.","Copy instead","Install","Invitation link copied to clipboard! Send it to anyone you trust","Session shared! Click \"Copy link\" to get an invitation link ","or click \"More info\" to learn about secure sharing.","A Reusable Session link is copied to the clipboard. Save the link to a secure location. Learn more about how to use your Session by clicking \"More info\".","A Reusable Session link is created! Click \"Copy link\" to get the link. Save the link to a secure location. Learn more about how to use your Session by clicking \"More info\".","Sign in with VS Live Share to join a collaboration session.","You need to sign in before joining the collaboration session.","$(options.title)","Cannot edit the terminal in read-only mode (anonymous). Sign in to proceed.","选择计划的会话","过期:","创建计划的会话…","创建计划的会话","指定计划的会话的名称","名称不能为空。请为会话输入一个由字母数字构成的名称","名称无效。请为会话输入一个由字母数字构成的名称","(只读)","(匿名，只读)"," (anonymous & read-write)"," (anonymous)","在 Live Share 会话中","键入以搜索联系人","选择要使用的状态提供程序","已邀请","已邀请","已邀请","开始协作会话...","(只读)","(匿名，只读)"," (Anonymous & Read-write)","只读用户","按以下身份继续","继续而不以只读来宾的身份登录","Please select account to sign in","Sign in using ${key} account","无法创建注释线程","无法删除注释线程","无法答复","无法编辑注释","无法保存注释","无法取消编辑注释","无法删除注释","先删除该线程上的其他注释","Live Share 会话注释","参与者:","Live Share 聊天: $(unreads) 个新项","聊天频道","会话聊天","Live Share 聊天","选择聊天频道","($(unread) 个新项)","$(username) 正在键入…","_已发起 Live Share 会话_","_已结束 Live Share 会话_","_已加入 Live Share 会话_","_已退出 Live Share 会话_","此协作会话的主持人当前已退出聊天或者其使用的 _Live Share_ 版本不支持此功能。[了解详细信息](https://aka.ms/vsls-chat)","你尝试联系的人员当前没空或者其使用的 _Live Share_ 版本不支持此功能。[了解详细信息](https://aka.ms/vsls-chat)","未知用户","与此联系人聊天","打开会话聊天频道","聊天服务当前已断开连接。请稍后重试。","请更新“Live Share Chat”助手扩展。安装的版本已不再兼容。[了解详细信息](https://aka.ms/vsls-chat)","What would you like to do?","$(x) Disconnect","Disconnect from the audio call.","$(mute) Mute Yourself","$(unmute) Unmute Yourself","Mute yourself so others cannot hear you.","Unmute your microphone so others can hear you.","$(organization) View Participants","View the list of Live Share participants that are currently in the call.","$(unmute) Configure Speakers","Select which speakers to use for the audio call.","$(megaphone) Configure Microphone","Select which microphone to use for the audio call.","Participants (0)","Join audio call...","Start audio call...","Joining audio call...","Starting audio call...","Ending audio call...","Audio Call","Audio Call Participants ($(participantCount))","Unknown user","$(displayName) (you)","Join","Connecting audio...","Disconnecting audio...","Audio Call Participants","Select the microphone to use","Select the speaker to use","An audio call has been started for this collaboration session.","结果集仅包含所有匹配的子集。请使用更加具体的搜索内容以细化搜索结果。","[新]","主持人与你共享了服务器 $(sessionName)。是否要在浏览器中查看此项?","是","否","无法在浏览器中打开服务器 $(sessionName)。主持人已取消共享该服务器","Live Share 工作区","The host has the notebook open with","Use the same view to open","Co-editing is not supported for notebooks opened with non-shared views.","Kernel to execute cells on the host's machine","The host has granted you access to execute notebook cells","The host has rejected your request to execute notebook cells","You cannot execute notebook cells in a read-only session","The host has not given you permission to execute notebook cells","Request access","Allow for this session","Allow always","Reject","A guest is requesting permission to execute notebook cells","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["你的工作区已共享，但一个或多个文件夹不是本地文件夹，无法包含在共享工作区中。","无法连接到 Azure 中继，只能与同一网络上的来宾进行协作。请验证网络防火墙或 DNS 或代理未阻止对 Microsoft Azure 中继的访问，然后重试。"],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share 现已进入 GA 阶段，感谢你一直以来的帮助! 作为预览体验人员，你可以继续优先体验新功能。","详细信息","切换到稳定的功能"],"src/_new_/util/WorkspaceFirewallUtil":["无法共享。Visual Studio Live Share 当前处于“直接”连接模式，并且你的防火墙已阻止启动协作会话所需的传入安全连接。\r\n\r\n为进行共享，你将需要修改防火墙规则以允许 vsls-agentt. exe 接受传入连接，或者切换到“自动”或“中继”连接模式。","你的防火墙将阻止 vsls-agent.exe 接受 Visual Studio Live Share 提升同一网络上协作者性能时所需的端口上的直接连接。\r\n\r\nLive Share 现将对所有后续会话切换到“直接”连接模式，并通过云中继来路由流量。按“取消”可停止共享。","Visual Studio Live Share 当前处于“直接”连接模式，共享时必须接受传入的安全连接才能正常工作。\r\n\r\n你的防火墙现将提示你向 vsls-agent.exe 授予访问所需端口的权限。如果拒绝访问，则无法共享。","Visual Studio Live Share 目前处于“自动”连接模式，通过在共享时接受传入的安全连接来提高同一网络上协作者的性能。\r\n\r\n你的防火墙现将提示你授予 vsls-agent.exe 对所需端口的访问权限。拒绝此访问将通过云中继路由所有连接。"],"src/abstractions/node/agent":[]}