{"src/commands":["Исправить","Не удалось выполнить обновление или установку VS Live Share, так как скачанный файл поврежден.","Не удалось выполнить обновление или установку VS Live Share, так как скачанный файл поврежден.","Возникли проблемы с установкой Live Share?","$(messagePrefix) Убедитесь в наличии сетевого подключения, а затем нажмите кнопку \"Восстановить\", чтобы перезапустить VS Code и повторить попытку восстановления.","Повторить","Не удалось завершить восстановление, так как файлы используются. Завершите все процессы агента Visual Studio Live Share (${processName}) и нажмите \"Повторить\"","Организатор завершил текущий сеанс совместной работы. Открытые папки и редакторы будут закрыты.","Истек срок действия сеанса совместной работы. Войдите и повторите попытку.","Вы удалены из сеанса совместной работы.","Вы заблокированы в сеансе совместной работы.","Вы были отключены от сеанса совместной работы из-за проблемы с подключением или отключения организатора от сети.","Cеанс совместной работы завершился из-за внутренней ошибки.","Истек срок действия сеанса совместной работы. Войдите и повторите попытку.","Сеанс совместной работы был завершен из-за перехода сети в автономный режим. Проверьте состояние сети.","Облачный ретранслятор Azure перешел в автономный режим для этого сеанса, возможно, новый гость не сможет подключаться через ретранслятор. Попробуйте перезапустить общий доступ.","Облачный ретранслятор Azure перешел в автономный режим для этого сеанса, возможно, новый гость не сможет подключаться через ретранслятор. Попробуйте перезапустить общий доступ.","Cеанс совместной работы завершился из-за внутренней ошибки."],"src/extension":[],"src/localizeCallback":["Что вы хотите сделать с другими участниками совместной работы?","Пригласить других (Копировать ссылку)","Скопируйте ссылку на приглашение и отправьте ее другим участникам.","Внимание участников","Попросите других участников подписаться на вас.","Общий доступ к терминалу только для чтения","Общий доступ к терминалу","Начать новый сеанс терминала/командной строки для использования всеми участниками.","Общий доступ к серверу","Предоставить доступ к локальному порту TCP всем участникам.","Показать общие серверы","Показать локальные TCP-серверы, совместно используемые с участниками совместной работы.","Отменить общий доступ к серверу","Прекращение общего доступа к локальному TCP-порту для всех участников.","Остановить сеанс совместной работы","Остановить сеанс совместной работы, отменить общий доступ к содержимому и удалить доступ для участников.","Войдите с помощью GitHub или учетной записи Майкрософт, чтобы получить доступ для чтения и записи.","Подключить к общему сеансу отладки","Подключение отладчика к сеансу отладки, которым организатор поделился с участниками.","Доступ к общему терминалу","Откройте терминал, которым организатор поделился с участниками.","Доступ к общему серверу","Копировать именованный общий TCP-порт для использования","Покинуть сеанс совместной работы","Прекратить участие в этом сеансе совместной работы.","Выберите действие","Запустить сеанс совместной работы","Начните сеанс совместной работы, чтобы поделиться содержимым и пригласить участников.","Начать сеанс совместной работы с доступом только для чтения","Начните сеанс совместной работы только для чтения, чтобы поделиться содержимым и пригласить участников.","Присоединиться к сеансу совместной работы","Присоединиться к сеансу совместной работы для доступа к общему содержимому.","Копировать еще раз","Копировать ссылку","Сделать доступным для чтения и записи","Сделать доступным только для чтения","Начать сеанс совместного доступа","Справка","ОК","Войти","Продолжить анонимно","Дополнительные сведения","Больше не показывать","Срок действия этой ссылки на приглашение истек. Поделитесь приглашением снова для создания новой ссылки.","Не удалось подключиться к серверу. Убедитесь, что вы подключены к Интернету.","Службе $(shortName) требуется более новая версия расширения, чем установленная у вас.","Для установленного расширения требуется более новая версия службы $(shortName).","Установленное расширение $(shortName) имеет слишком старую версию для подключения к этому сеансу совместной работы.","Организатор совместного сеанса использует более старую версию расширения $(shortName) по сравнению с вашей.","Агент $(shortName) имеет более новую версию, чем это расширение","Агент $(shortName) имеет более старую версию, чем это расширение","Не удается организовать общий доступ в режиме \"Прямой\" из-за отсутствия подходящих IP-адресов. Переключитесь в режим \"Авто\" или \"Ретрансляция\" и повторите попытку.","Не удалось найти совместимый адрес подключения. Переключитесь в режим \"Auto\" и повторите попытку.","Не удалось подключиться к организатору. Убедитесь, что вы и организатор подключены к сети.","Не удалось подключиться к организатору в режиме \"Relay\". Убедитесь, что вы и организатор подключены к сети. Если это так, переключитесь в режим \"Auto\" или \"Direct\" и повторите попытку.","Не удалось подключиться к организатору в режиме \"Direct\". Убедитесь, что вы и организатор подключены к сети. Если это так, переключитесь в режим \"Auto\" или \"Relay\" и повторите попытку.","Не удалось присоединиться к организатору из-за ошибки протокола. Убедитесь, что вы и организатор подключены к сети и используете последнюю версию $(shortName).","Не удалось присоединиться к организатору из-за ошибки проверки подлинности. Проверьте, что организатор подключен к сети, а затем выйдите из системы, снова войдите в нее и повторите попытку.","Не удалось присоединиться к организатору из-за ошибки проверки подлинности. Проверьте, что организатор подключен к сети, а затем выйдите из системы, снова войдите в нее и повторите попытку.","Непредвиденная ошибка проверки подлинности. Повторите попытку входа.","Сбой при обмене токенами. Код ошибки: ${code}","Организатор не разрешает прямые подключения. Переключитесь в режим \"Auto\" или \"Relay\" и повторите попытку.","Не удалось подключиться, так как организатор не разрешает использовать ретранслируемые подключения. Переключитесь на режим \"Auto\" или \"Direct\" и повторите попытку.","Не удалось присоединиться к сеансу совместной работы, так как достигнуто максимально допустимое число участников (5). Чтобы увеличить максимальное число участников, попросите организатора изменить значение параметра \"Увеличено ограничение на количество гостей\", выполните перезагрузку, а затем начните новый сеанс совместной работы.","Организатор отклонил ваше присоединение к сеансу совместной работы.","Истекло время ожидания для ответа организатора на ваш запрос.","Запрос на присоединение к сеансу совместной работы был отменен.","Сеанс совместной работы не найден.","Организатор запретил вам присоединяться к совместной работе. Если это произошло случайно, обратитесь к организатору для перезапуска сеанса.","Не удалось подключиться к серверу. Получен код состояния \"не выполнено\".","Live Share не удалось получить доступ к цепочке ключей входа. Это может произойти, если вы недавно изменили свой пароль либо цепочка ключей входа повреждена. Ознакомьтесь с дополнительными сведениями о том, как устранить эту проблему.","Состояние сети организатора неудовлетворительное или он больше не подключен к облачному ретранслятору Live Share. Попросите организатора проверить состояние сети, перезапустите сеанс совместной работы и повторите попытку.","Не удается подключиться к облачному ретранслятору Live Share. Проверьте параметры прокси-сервера, брандмауэра и сети и повторите попытку.","Организатор не разрешает запуск отладчика. При необходимости попросите его разрешить запуск отладчика.","Не удалось подключиться к серверу. Не удалось выполнить подключение HTTPS. Убедитесь в отсутствии самозаверяющих сертификатов и политик проверки пользовательских сертификатов, блокирующих Live Share.","Не удалось создать запланированный сеанс.","Не удалось удалить запланированный сеанс.","Не удалось переименовать запланированный сеанс.","Не удалось скопировать ссылку на запланированный сеанс.","Не удалось присоединяться к запланированным сеансам.","Похоже, у вас есть каталог с файлами, имеющими такое же имя, за исключением регистра. Сейчас это не поддерживается и может привести к ошибкам.","Ваш VS Code функционирует за пределами папки приложений, поэтому не удается установить поддержку присоединения к сеансам с помощью ссылки браузера. При этом присоединяться к сеансам можно вручную.","Не удалось установить поддержку для присоединения к сеансам с помощью ссылки браузера. Вы по-прежнему можете присоединяться к сеансам вручную.","Открытие удаленного сеанса...","Присоединение к удаленному сеансу...","Ожидание утверждения организатора…","Соединение потеряно. Выполняется повторное подключение к узлу…","Создание запланированного сеанса…","Удаление запланированного сеанса…","Путь не найден: lazyLoad(() => nlsloc($(path)","Путь уже существует: lazyLoad(() => nlsloc($(path)","Отказано в доступе: lazyLoad(() => nlsloc($(path)","Файл имеет слишком большой размер.","Файл недоступен.","направил вам запрос на присоединение к сеансу совместной работы.","Принять","Принимать только чтение","Принимать чтение и запись","Отклонить","Всегда принимать анонимные запросы","присоединился к сеансу совместной работы."," был отключен.","покинул сеанс совместной работы.","Пользователь $(userId) привлек ваше внимание.","Пользователь $(userId) направил вам запрос подписаться на него.","Ссылка на сеанс скопирована.","Сведения о совместном редактировании скопированы в буфер обмена.","Для поддержки соединения с сеансом с помощью ссылки браузера необходимо разрешение на запуск установщика в вашей системе. Ваша ОС может запросить пароль администратора (sudo) в терминале. Установить сейчас?","Команда запуска программы установки связи с браузером скопирована в буфер обмена.","Вы можете запустить команду \"Live Share: Настройка средства запуска\", чтобы завершить интеграцию позже.","Средство запуска ссылок браузера установлено.","Копировать вместо","Установить","Ссылка на приглашение скопирована в буфер обмена! Отправьте ее всем, кому доверяете.","Общий сеанс открыт! Нажмите кнопку \"Копировать ссылку\", чтобы получить ссылку на приглашение ","или нажмите кнопку \"Подробнее\", чтобы узнать о безопасном совместном использовании.","Многоразовая ссылка на сеанс скопирована в буфер обмена. Сохраните ссылку в безопасном месте. Чтобы больше узнать о том, как пользоваться вашим сеансом, нажмите кнопку \"Подробнее\".","Создана многоразовая ссылка на сеанс! Для получения ссылки нажмите кнопку \"Копировать ссылку\". Сохраните ссылку в безопасном месте. Чтобы больше узнать о том, как пользоваться вашим сеансом, нажмите кнопку \"Подробнее\".","Войдите с помощью VS Live Share, чтобы присоединиться к сеансу совместной работы.","Необходимо войти, чтобы присоединиться к сеансу совместной работы.","$(options.title)","Невозможно изменить терминал в режиме только для чтения (анонимный). Войдите, чтобы продолжить.","Выбор запланированного сеанса","Срок действия: ","Создание запланированного сеанса…","Создать запланированный сеанс","Укажите имя запланированного сеанса","Имя не может быть пустым. Введите буквенно-цифровое имя сеанса.","Недопустимое имя. Введите буквенно-цифровое имя сеанса."," (Только для чтения)"," (Анонимный и только для чтения)"," (анонимный и чтение/запись)"," (анонимный)","В сеансе Live Share","Введите текст для поиска контактов","Выберите используемого поставщика присутствия","Получено приглашение","Получено приглашение","Получено приглашение","Запустить сеанс совместной работы..."," (Только для чтения)"," (Анонимный и только для чтения)"," (анонимный и чтение/запись)","Пользователь с доступом только для чтения","Продолжить как","Продолжить без входа как гость с доступом только для чтения.","Выберите учетную запись для входа.","Вход с использованием учетной записи ${key}","Не удается создать цепочку комментариев","Не удается удалить цепочку комментариев","Не удается ответить","Не удается изменить комментарий","Не удается сохранить комментарий","Не удается отменить изменение комментария","Не удается удалить комментарий","сначала удалите другие комментарии в цепочке","Комментарии сеанса Live Share","Участники:","Чат Live Share: новых — $(unreads)","Чат","Чат в сеансе","Чат Live Share","Выберите канал чата.","(новых: $(unread))","$(username) печатает...","_запускает сеанс Live Share_","_завершает сеанс Live Share_","_присоединяется к сеансу Live Share_","_покидает сеанс Live Share_","Организатор этого сеанса совместной работы сейчас отключен от чата или использует версию _Live Share_, которая не поддерживает эту возможность. [Дополнительные сведения.](https://aka.ms/vsls-chat)","Человек, к которому вы пытаетесь обратиться, сейчас недоступен или использует версию _Live Share_, которая не поддерживает эту возможность. [Дополнительные сведения.](https://aka.ms/vsls-chat)","Неизвестный пользователь","Чат с этим контактом","Открыть канал чата в сеансе","Служба чатов сейчас отключена. Повторите попытку позже.","Обновите вспомогательное расширение Live Share Chat. Установленная версия больше не является совместимой. [Дополнительные сведения](https://aka.ms/vsls-chat)","Выберите действие","$(x) Отключить","Отключиться от звонка.","$(mute) Отключить микрофон","$(unmute) Включить свой микрофон","Отключите свой микрофон, чтобы другие участники не могли слышать вас.","Включите свой микрофон, чтобы другие участники могли слышать вас.","$(organization) Просмотреть участников","Просмотрите список участников Live Share, которые сейчас участвуют в звонке.","$(unmute) Настроить динамики","Выберите динамики, которые будут использоваться для звонка.","$(megaphone) Настроить микрофон","Выберите микрофон для использования при звонке.","Участники: (0)","Присоединение к звонку…","Начало звонка...","Присоединение к звонку…","Начинается звонок…","Завершение голосового звонка…","Звонок","Участники звонка ($(participantCount))","Неизвестный пользователь","$(displayName) (вы)","Присоединиться","Подключение звука…","Идет отключение звука…","Участники звонка","Выберите микрофон для использования","Выберите динамик для использования","Начат голосовой звонок для этого сеанса совместной работы.","Результирующий набор содержит лишь подмножество всех совпадений. Уточните поиск, чтобы уменьшить число результатов.","[Новое]","Узел предоставил вам доступ к серверу $(sessionName). Вы хотите просмотреть этот сервер в браузере?","Да","Нет","Не удается открыть URL-адрес сервера ($(sessionName)) в браузере. Узел отключил общий доступ к серверу.","Рабочая область Live Share","Узел открыл записную книжку с помощью","Использовать то же представление для открытия","Совместное редактирование не поддерживается для записных книжек, открытых без общих представлений.","Ядро для выполнения ячеек на компьютере узла","Узел предоставил вам доступ для выполнения ячеек записной книжки.","Узел отклонил ваш запрос на выполнение ячеек записной книжки.","Вы не можете выполнять ячейки записной книжки в сеансе только для чтения.","Узел не предоставил вам разрешение для выполнения ячеек записной книжки.","Запросить доступ","Разрешить для этого сеанса","Разрешать всегда","Отклонить","Гость запрашивает разрешение на выполнение ячеек записной книжки","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Ваша рабочая область была предоставлена для общего доступа, однако одна или несколько папок не были локальными, поэтому их не удалось включить в общую рабочую область.","Не удается подключиться к Azure Relay, вы можете осуществлять совместную работу с только гостями в той же сети. Убедитесь, что брандмауэр, DNS или прокси-сервер не блокируют доступ к Microsoft Azure Relay, и повторите попытку."],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share — теперь в общедоступной версии, и мы хотели бы поблагодарить вас за то, что вы помогли нам это сделать! Как участник программы предварительной оценки, вы продолжите получать новые компоненты в первую очередь.","Дополнительные сведения","Перейти к стабильным версиям компонентов"],"src/_new_/util/WorkspaceFirewallUtil":["Не удается организовать общий доступ. Live Share находится в режиме подключения \"Прямой\", а брандмауэр заблокировал защищенные входящие подключения, необходимые для запуска сеанса совместной работы.\r\n\r\nДля обеспечения общего доступа вам потребуется изменить правила брандмауэра, чтобы разрешить vsls-agent.exe принимать входящие подключения, или переключиться в режим подключения \"Авто\" или \"Ретрансляция\".","Ваш брандмауэр не позволяет vsls-agent.exe принимать прямые подключения через требуемые порты, которые нужны Visual Studio Live Share для повышения производительности для участников совместной работы в той же сети.\r\n\r\nСейчас Live Share переключится в режим подключения \"Ретрансляция\" для всех дальнейших сеансов и будет перенаправлять трафик через облачный ретранслятор. Вместо этого вы можете нажать кнопку \"Отмена\", чтобы прекратить общий доступ","Сейчас Live Share находится в режиме подключения \"Прямой\" и для нормальной работы должен принимать входящие безопасные соединения при общем доступе.\r\n\r\nТеперь брандмауэр будет просить вас предоставить vsls-agent.exe доступ к требуемым портам. Если вы запретите доступ, то не сможете использовать общий доступ.","Сейчас Live Share находится в режиме подключения \"Авто\", который повышает производительность для участников совместной работы в той же сети, принимая входящие защищенные подключения во время общего доступа.\r\n\r\nТеперь брандмауэр будет просить вас предоставить vsls-agent.exe доступ к требуемым портам. При запрете доступа все подключения будут перенаправлены через облачный ретранслятор."],"src/abstractions/node/agent":[]}