{"src/commands":["Reparar","Uma atualização ou instalação do VS Live Share falhou devido a uma transferência corrompida.","Uma atualização ou instalação do VS Live Share falhou devido a uma transferência corrompida.","Está a ter problemas com a sua instalação do Live Share?","$(messagePrefix) Certifique-se de que tem conectividade de rede e, em seguida, clique em \"Reparar\" para reiniciar o VS Code e tentar a recuperação.","Tentar novamente","Não foi possível concluir a reparação porque os ficheiros ainda estão em utilização. Por favor termine todos os processos do Visual Studio Live Share Agent (${processName}) e clique em \"Tentar Novamente\"","O anfitrião terminou a sessão de colaboração atual. As pastas e os editores abertos serão agora fechados.","A sessão de colaboração expirou. Por favor, inicie sessão e tente novamente.","Foi removido da sessão de colaboração.","Foi bloqueado na sessão de colaboração.","Foi desligado da sessão de colaboração devido a um problema de conectividade ou devido ao anfitrião ter ficado offline.","A sessão de colaboração terminou devido a um erro interno.","A sessão de colaboração expirou. Por favor, inicie sessão e tente novamente.","A sessão de colaboração terminou porque a rede ficou offline. Verifique o estado da sua rede.","O Azure Cloud Relay ficou offline para esta sessão, novos convidados podem não ser capazes de se juntar com sucesso através do reencaminhamento. Considere partilhar de novo.","O Azure Cloud Relay ficou offline para esta sessão, novos convidados podem não ser capazes de se juntar com sucesso através do reencaminhamento. Considere partilhar de novo.","A sessão de colaboração terminou devido a um erro interno."],"src/extension":[],"src/localizeCallback":["O que gostaria de fazer com outros colaboradores?","Convidar Outras Pessoas (Copiar Ligação)","Copie a ligação de convite para poder enviá-la a outros participantes.","Focar a Atenção dos Participantes","Peça a outros participantes para o seguirem.","Partilhar Terminal Só de Leitura","Partilhar Terminal","Inicie um novo terminal / linha de comandos para utilização por todos os participantes.","Partilhar Servidor","Expor uma porta TCP local a todos os participantes.","Mostrar Servidores Partilhados","Mostrar servidores TCP locais partilhados com participantes de colaboração.","Parar a Partilha do Servidor","Pare de partilhar uma porta TCP local para todos os participantes.","Parar Sessão de Colaboração","Pare a sessão de colaboração, pare a partilha de todos os conteúdos e remova o acesso de todos os participantes.","Inicie sessão com a sua conta GitHub ou Microsoft para obter acesso de leitura/escrita.","Anexar a uma Sessão de Depuração Partilhada","Anexe o depurador a uma sessão de depuração que o anfitrião tenha partilhado com os participantes.","Aceder ao Terminal Partilhado","Abra o terminal que o anfitrião partilhou com os participantes.","Aceder ao Servidor Partilhado","Copiar uma porta TCP com nome e partilhada para utilização","Sair da Sessão de Colaboração","Deixe de participar nesta sessão de colaboração.","O que deseja fazer?","Iniciar Sessão de Colaboração","Inicie uma sessão de colaboração para partilhar conteúdos e convidar participantes.","Iniciar Sessão de Colaboração Só de Leitura","Inicie uma sessão de colaboração só de leitura para partilhar conteúdos e convidar participantes.","Participar na Sessão de Colaboração","Participe numa sessão de colaboração para aceder a conteúdo partilhado.","Copiar novamente","Copiar ligação","Tornar de leitura/escrita","Tornar só de leitura","Iniciar Partilha","Ajuda","OK","Iniciar sessão","Continuar como anónimo","Mais informações","Não voltar a mostrar","Esta ligação de convite expirou. Partilhe novamente para gerar uma nova ligação.","Não foi possível ligar ao servidor. Verifique se está ligado à internet.","O serviço $(shortName) requer uma versão mais recente da extensão do que a que tem instalada.","A extensão que instalou requer uma versão mais recente do serviço $(shortName).","A extensão $(shortName) que tem instalada é demasiado antiga para se ligar a esta sessão de colaboração.","O anfitrião da sessão de colaboração está numa versão mais antiga da extensão $(shortName) do que a sua.","O agente $(shortName) é mais recente do que a extensão","O agente $(shortName) é mais antigo do que a extensão","Não foi possível partilhar no modo \"Direto\", uma vez que não existem endereços IP adequados. Mude para o modo \"Automático\" ou \"Reencaminhamento\" e tente novamente.","Não foi possível encontrar um endereço de ligação compatível. Mude para o modo \"Automático\" e tente novamente.","Não foi possível ligar ao anfitrião. Verifique se você e o anfitrião estão online.","Não foi possível ligar-se ao anfitrião no modo \"Reencaminhamento\". Verifique se você e o anfitrião estão online. Em caso afirmativo, mude para o modo \"Automático\" ou \"Direto\" e tente novamente.","Não foi possível ligar-se ao anfitrião no modo \"Direto\". Verifique se você e o anfitrião estão online. Em caso afirmativo, mude para o modo \"Automático\" ou \"Reencaminhamento\" e tente novamente.","Não foi possível juntar-se ao anfitrião devido a um erro de protocolo. Verifique se você e o anfitrião estão online e se estão a utilizar a versão mais recente do $(shortName).","Não foi possível juntar-se ao anfitrião devido a um erro de autenticação. Verifique que o anfitrião está online e, em seguida, termine a sua sessão, para poder voltar a iniciar sessão e tentar novamente.","Não foi possível juntar-se ao anfitrião devido a um erro de autenticação. Verifique que o anfitrião está online e, em seguida, termine a sua sessão, para poder voltar a iniciar sessão e tentar novamente.","Erro de autenticação inesperado. Tente iniciar sessão novamente.","A troca de token falhou com o código: ${code}","O anfitrião não permite ligações diretas. Mude para o modo \"Automático\" ou \"Reencaminhamento\" e tente novamente.","Não foi possível efetuar a ligação porque o anfitrião não permite ligações reencaminhadas. Mude para o modo \"Automático\" ou \"Direto\" e tente novamente.","Não foi possível participar na sessão de colaboração porque já atingiu o máximo de 5 participantes. Para aumentar o limite de participantes, peça ao anfitrião para alterar a definição Limite de Convidados Aumentado, recarregar e, em seguida, iniciar uma nova sessão de colaboração.","O anfitrião rejeitou a sua adesão à sessão de colaboração.","O limite de tempo foi excedido durante a espera pela resposta do anfitrião ao seu pedido.","O pedido de adesão à sessão de colaboração foi cancelado.","Sessão de colaboração não encontrada.","O anfitrião bloqueou a sua adesão à colaboração. Se isto tiver sido acidental, peça ao anfitrião para reiniciar a sessão.","Não foi possível ligar ao servidor. Código de estado de não êxito recebido.","O Live Share não conseguiu aceder ao porta-chaves de início de sessão. Isto pode acontecer se alterou recentemente a sua palavra-passe ou se o seu porta-chaves de início de sessão tiver sido corrompido. Veja mais informações sobre como corrigi-lo.","As condições de rede do anfitrião são fracas ou já não estão ligadas ao reencaminhamento da nuvem do Live Share. Peça-lhes para verificarem as suas condições de rede, reiniciarem a sessão de colaboração e tentarem novamente.","Não foi possível ligar ao reencaminhamento na nuvem do Live Share. Verifique as sua definições de proxy, firewall e rede e tente novamente.","O anfitrião não permite iniciar o depurador. Se necessário, peça-lhes para o possibilitar.","Não foi possível ligar ao servidor. A ligação HTTPS falhou, verifique se não existem certificados auto-assinados ou políticas de validação de certificados personalizados a bloquear o Live Share.","Falha ao criar uma Sessão Planeada","Falha ao eliminar uma Sessão Planeada","Falha ao mudar o nome da Sessão Planeada","Falha ao copiar a ligação de Sessão Planeada","Falha ao aderir a Sessões Planeadas","Parece que tem um diretório com ficheiros com o mesmo nome, exceto no uso de maiúsculas e minúsculas. Isto não é atualmente compatível e pode levar a erros.","Está a executar o VS Code fora da pasta de Aplicações, pelo que não podemos instalar o suporte para participar em sessões através de uma ligação do browser. Ainda pode participar em sessões manualmente.","Falha ao instalar o suporte para participar em sessões utilizando uma ligação do browser. Ainda pode participar em sessões manualmente.","A abrir sessão remota...","A aderir à sessão remota...","A aguardar aprovação do anfitrião...","Ligação perdida. A voltar a ligar ao anfitrião...","A criar sessão planeada...","A eliminar sessão planeada...","Caminho não encontrado: lazyLoad(() => nlsloc($(path)","O caminho já existe: lazyLoad(() => nlsloc($(path)","Acesso negado: lazyLoad(() => nlsloc($(path)","O ficheiro é demasiado grande.","O ficheiro não está disponível."," pediu para participar na sessão de colaboração.","Aceitar","Aceitar só de leitura","Aceitar leitura-escrita","Rejeitar","Aceitar sempre anónimos"," aderiu à sessão de colaboração."," foi desligado."," saiu da sessão de colaboração.","$(userId) focou a sua atenção.","$(userId) pediu-lhe para os seguir.","Ligação de sessão copiada.","Informações de edição conjunta copiadas para a área de transferência.","Para suportar a adesão a uma sessão através de uma ligação do browser, precisamos de permissão para executar um instalador no seu sistema. O seu SO pode pedir-lhe a sua palavra-passe de administrador (sudo) num terminal. Instalar agora?","O comando de instalação do iniciador de ligações do browser foi copiado para a área de transferência.","Pode executar o comando \"Live Share: Configuração do Iniciador\" para completar a integração mais tarde.","O iniciador de ligações do browser foi instalado com êxito.","Copiar em vez disso","Instalar","Ligação de convite copiada para a área de transferência! Envie-a a qualquer pessoa em quem confia","Sessão partilhada! Clique em \"Copiar ligação\" para obter uma ligação de convite ","ou clique em \"Mais informações\" para saber mais sobre a partilha segura.","Foi copiada uma ligação de Sessão Reutilizável para a área de transferência. Guarde a ligação numa localização segura. Saiba mais sobre como utilizar a sua Sessão ao clicar em \"Mais informações\".","Foi criada uma ligação de Sessão Reutilizável! Clique em \"Copiar ligação\" para obter a ligação. Guarde a ligação numa localização segura. Saiba mais sobre como utilizar a sua Sessão ao clicar em \"Mais informações\".","Inicie sessão com o VS Live Share para participar numa sessão de colaboração.","Tem de iniciar sessão antes de participar na sessão de colaboração.","$(options.title)","Não é possível editar o terminal no modo só de leitura (anónimo). Inicie sessão para continuar.","Selecione uma sessão planeada","Expiração: ","Criar sessão planeada...","Crie uma sessão planeada","Especifique o nome da sessão planeada","O nome não pode estar vazio. Por favor, insira um nome alfanumérico para a sessão","O nome é inválido. Por favor, insira um nome alfanumérico para a sessão"," (Só de leitura)"," (Anónimo e Só de Leitura)"," (Anónimo e Leitura-escrita)"," (Anónimo)","Numa sessão do Live Share","Escreva para procurar contactos","Selecione o fornecedor de presença a utilizar","Convidado","Convidado","Convidado","Iniciar sessão de colaboração..."," (Só de leitura)"," (Anónimo e Só de Leitura)"," (Anónimo e Leitura-escrita)","Utilizador só de leitura","Continuar como","Continue sem ter de iniciar sessão como um convidado Só de leitura","Selecione a conta para iniciar sessão","Inicie sessão com a conta ${key}","Não é possível criar o tópico de comentários","Não é possível eliminar o tópico de comentários","Não é possível responder","Não é possível editar o comentário","Não é possível guardar o comentário","Não é possível cancelar a edição do comentário","Não é possível eliminar o comentário","eliminar outros comentários da conversa primeiro","Comentários da Sessão do Live Share","Participantes:","Chat do Live Share: $(unreads) novos","Chat","Chat de sessão","Chat do Live Share","Selecione um canal de chat","($(unread) novos)","$(username) está a escrever...","_iniciou a sessão do Live Share_","_terminou a sessão do Live Share_","_aderiu à sessão do Live Share_","_saiu da sessão do Live Share_","O anfitrião desta sessão de colaboração encontra-se atualmente desligado do chat ou está a utilizar uma versão do _Live Share_ que não suporta esta funcionalidade. [Learn more](https://aka.ms/vsls-chat)","A pessoa que está a tentar contactar encontra-se atualmente indisponível ou a utilizar uma versão do _Live Share_ que não suporta esta funcionalidade. [Learn more](https://aka.ms/vsls-chat)","Utilizador desconhecido","Converse com este contacto","Abrir canal de chat de sessão","O serviço de chat está atualmente desligado. Por favor, tente novamente em breve.","Por favor, atualize a extensão complementar do \"Live Share Chat\". A versão instalada já não é compatível. [Saiba mais](https://aka.ms/vsls-chat)","O que deseja fazer?","$(x) Desligar","Desligue-se da chamada de áudio.","$(mute) Desativar o seu Som","$(unmute) Ativar o Seu Som","Desative o seu som para que outras pessoas não o ouçam.","Ative o som do microfone para que outras pessoas o possam ouvir.","$(organization) Ver Participantes","Veja a lista de participantes da Partilha em Direto que estão atualmente na chamada.","$(unmute) Configurar os Altifalantes","Selecione os altifalantes a utilizar para a chamada de áudio.","$(megaphone) Configurar Microfone","Selecione o microfone a utilizar para a chamada de áudio.","Participantes (0)","Participar na chamada de áudio...","Iniciar chamada de áudio...","A participar na chamada de áudio...","A iniciar chamada de áudio...","A terminar chamada de áudio...","Chamada de Áudio","Participantes de Chamada de Áudio ($(participantCount))","Utilizador desconhecido","$(displayName) (eu)","Aderir","A ligar áudio...","A desligar áudio...","Participantes de Chamada de Áudio","Selecione o microfone a utilizar","Selecione o altifalante a utilizar","Foi iniciada uma chamada de áudio para esta sessão de colaboração.","O conjunto de resultados contém apenas um subconjunto de todas as correspondências. Por favor, seja mais específico na sua pesquisa para restringir os resultados.","[Novo]","O anfitrião partilhou um servidor $(sessionName) consigo. Quer ver isto no browser?","Sim","Não","Não é possível abrir o servidor $(sessionName) no browser. O anfitrião anulou a partilha do servidor","Área de Trabalho do Live Share","O anfitrião tem o bloco de notas aberto com","Utilizar a mesma vista para abrir","A edição conjunta não é suportada para blocos de notas abertos com vistas não partilhadas.","Kernel para executar células no computador do anfitrião","O anfitrião concedeu-lhe acesso para executar células do bloco de notas","O anfitrião rejeitou o seu pedido para executar células do bloco de notas","Não pode executar células de bloco de notas numa sessão só de leitura","O anfitrião não lhe deu permissão para executar células do bloco de notas","Pedir acesso","Permitir para esta sessão","Permitir sempre","Rejeitar","Um convidado está a pedir permissão para executar células do bloco de notas","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["A sua área de trabalho foi partilhada, mas uma ou mais pastas não eram pastas locais e não puderam ser incluídas na área de trabalho partilhada.","Não foi possível ligar ao Azure Relay, só pode colaborar com convidados na mesma rede. Verifique se a firewall da sua rede, o DNS ou o proxy não está a bloquear o acesso ao Microsoft Azure Relay e tente novamente."],"src/_new_/decorators/gaNotificationCommandDecorator":["O Live Share é agora GA e gostaríamos de agradecer-lhe por nos ajudar a chegar lá! Como insider, continuará a receber novas funcionalidades primeiro.","Mais informações","Mudar para funcionalidades estáveis"],"src/_new_/util/WorkspaceFirewallUtil":["Não foi possível partilhar. O Visual Studio Live Share está atualmente no modo de ligação \"Direto\" e a sua firewall bloqueou as ligações seguras de entrada necessárias para iniciar uma sessão de colaboração.\r\n\r\nPara partilhar, terá de modificar as regras da sua firewall para permitir que o vsls-agent.exe aceite ligações de entrada ou mude para o modo de ligação \"Automático\" ou \"Reencaminhamento\".","A sua firewall está a bloquear o vsls-agent.exe, não permitindo aceitar ligações diretas nas portas que o Visual Studio Live Share requer para melhorar o desempenho dos colaboradores na mesma rede.\r\n\r\nO Live Share passará agora para o modo de ligação \"Reencaminhamento\" para todas as sessões futuras e encaminhará o tráfego através de um reencaminhamento na nuvem. Em vez disso, prima \"Cancelar\" para parar de partilhar","O Visual Studio Live Share está atualmente no modo de ligação \"Direto\" e tem de aceitar ligações protegidas recebidas ao partilhar para funcionar.\r\n\r\nA sua firewall irá agora pedir-lhe para dar acesso às portas necessárias ao vsls-agent.exe. Se negar o acesso, não poderá partilhar.","O Visual Studio Live Share encontra-se atualmente no modo de ligação \"Automático\" que melhora o desempenho dos colaboradores na mesma rede, aceitando ligações seguras de entrada ao partilhar.\r\n\r\nA sua firewall irá agora pedir-lhe que dê acesso às portas necessárias ao vsls-agent.exe. Negar este acesso irá encaminhar todas as ligações através de um reencaminhamento na nuvem."],"src/abstractions/node/agent":[]}