{"src/commands":["Napraw","Aktualizacja lub instalacja rozszerzenia VS Live Share nie powiodła się z powodu uszkodzonego pliku do pobrania.","Aktualizacja lub instalacja rozszerzenia VS Live Share nie powiodła się z powodu uszkodzonego pliku do pobrania.","Masz problemy z instalacją rozszerzenia Live Share?","$(messagePrefix) Upewnij się, że masz połączenie z siecią, a następnie kliknij pozycję „Napraw”, aby ponownie uruchomić program VS Code i podjąć próbę przeprowadzenia odzyskiwania.","Ponów próbę","Nie można zakończyć naprawy, ponieważ pliki są używane. Zakończ wszystkie procesy agenta Visual Studio Live Share (${processName}) i kliknij przycisk Ponów próbę","Gospodarz zakończył bieżącą sesję współpracy. Otwarte foldery i edytory zostaną teraz zamknięte.","Sesja współpracy wygasła. Zaloguj się i spróbuj ponownie.","Usunięto Cię z tej sesji współpracy.","Zablokowano Cię w tej sesji współpracy.","Rozłączono Cię z sesją współpracy z powodu problemu z połączeniem lub przełączenia gospodarza do trybu offline.","Sesja współpracy została zakończona z powodu błędu wewnętrznego.","Sesja współpracy wygasła. Zaloguj się i spróbuj ponownie.","Sesja współpracy została zakończona z powodu przełączenia sieci do trybu offline. Sprawdź stan sieci.","Usługa Azure Cloud Relay została przełączona do trybu offline dla tej sesji, dołączanie nowych gości za pośrednictwem przekaźnika może zakończyć się niepowodzeniem. Rozważ ponowne udostępnienie.","Usługa Azure Cloud Relay została przełączona do trybu offline dla tej sesji, dołączanie nowych gości za pośrednictwem przekaźnika może zakończyć się niepowodzeniem. Rozważ ponowne udostępnienie.","Sesja współpracy została zakończona z powodu błędu wewnętrznego."],"src/extension":[],"src/localizeCallback":["Co chcesz zrobić z innymi współpracownikami?","Zaproś innych (kopiuj link)","Kopiuj link z zaproszeniem, aby można go było wysłać innym uczestnikom.","Zwrócenie uwagi uczestników","Poproś innych uczestników o obserwowanie Ciebie.","Udostępnij terminal tylko do odczytu","Udostępnij terminal","Uruchom nowy terminal/wiersz polecenia do użytku przez wszystkich uczestników.","Udostępnij serwer","Uwidocznij lokalny port TCP wszystkim uczestnikom.","Pokaż udostępnione serwery","Pokaż lokalne serwery TCP z uczestnikami współpracy.","Zatrzymaj udostępnianie serwera","Zatrzymaj udostępnianie lokalnego portu TCP wszystkim uczestnikom.","Zatrzymaj sesję współpracy","Zatrzymaj sesję współpracy — zatrzymaj udostępnianie całej zawartości i usuń dostęp w przypadku wszystkich uczestników.","Zaloguj się na Twoje konto GitHub lub Microsoft, aby uzyskać dostęp do odczytu/zapisu.","Dołącz do udostępnionej sesji debugowania","Dołącz debuger do sesji debugowania, którą host udostępnił uczestnikom.","Uzyskaj dostęp do udostępnionego terminala","Otwórz terminal, który został udostępniony przez hosta uczestnikom.","Uzyskaj dostęp do serwera udostępnionego","Kopiuj nazwany, udostępniony port TCP do użycia","Opuść sesję współpracy","Przestań brać udział w tej sesji współpracy.","Co chcesz zrobić?","Rozpocznij sesję współpracy","Rozpocznij sesję współpracy, aby udostępniać zawartość i zapraszać uczestników.","Rozpocznij sesję współpracy tylko do odczytu","Rozpocznij sesję współpracy tylko do odczytu, aby udostępniać zawartość i zapraszać uczestników.","Dołącz do sesji współpracy","Dołącz do sesji współpracy, aby uzyskać dostęp do udostępnionej zawartości.","Kopiuj ponownie","Kopiuj link","Ustaw jako do odczytu/zapisu","Ustaw jako tylko do odczytu","Rozpocznij udostępnianie","Pomoc","OK","Zaloguj się","Kontynuuj jako uczestnik anonimowy","Więcej informacji","Nie pokazuj ponownie","Ten link z zaproszeniem wygasł. Udostępnij ponownie, aby wygenerować nowy link.","Nie można nawiązać połączenia z serwerem. Sprawdź, czy masz połączenie z Internetem.","Usługa $(shortName) wymaga nowszej wersji rozszerzenia niż zainstalowana.","Zainstalowane rozszerzenie wymaga nowszej wersji usługi $(shortName).","Zainstalowane rozszerzenie $(shortName) jest za stare, aby nawiązać połączenie z tą sesją współpracy.","Gospodarz sesji współpracy korzysta ze starszej wersji rozszerzenia $(shortName) niż Ty.","Agent $(shortName) jest nowszy niż rozszerzenie","Agent $(shortName) jest starszy niż rozszerzenie","Nie można udostępniać w trybie „Direct” z powodu braku odpowiednich adresów IP. Przełącz się do trybu „Auto” lub „Relay” i spróbuj ponownie.","Nie można odnaleźć zgodnego adresu połączenia. Przełącz do trybu „Auto”, a następnie spróbuj ponownie.","Nie można nawiązać połączenia z gospodarzem. Sprawdź, czy Ty i gospodarz jesteście w trybie online.","Nie można nawiązać połączenia z gospodarzem w trybie „Relay”. Sprawdź, czy Ty i gospodarz jesteście w trybie online. Jeśli tak, przełącz się do trybu „Auto” lub „Direct” i spróbuj ponownie.","Nie można nawiązać połączenia z gospodarzem w trybie „Direct”. Sprawdź, czy Ty i gospodarz jesteście w trybie online. Jeśli tak, przełącz się do trybu „Auto” lub „Relay” i spróbuj ponownie.","Nie można dołączyć do gospodarza z powodu błędu protokołu. Sprawdź, czy Ty i gospodarz jesteście w trybie online i używacie najnowszej wersji $(shortName).","Nie można dołączyć do gospodarza z powodu błędu uwierzytelniania. Sprawdź, czy gospodarz jest w trybie online, wyloguj się i zaloguj ponownie, a następnie spróbuj jeszcze raz.","Nie można dołączyć do gospodarza z powodu błędu uwierzytelniania. Sprawdź, czy gospodarz jest w trybie online, wyloguj się i zaloguj ponownie, a następnie spróbuj jeszcze raz.","Nieoczekiwany błąd uwierzytelniania. Spróbuj zalogować się ponownie.","Wymiana tokenów nie powiodła się, kod: ${code}","Gospodarz nie zezwala na połączenia bezpośrednie. Przełącz do trybu „Auto” lub „Relay”, a następnie spróbuj ponownie.","Nie można nawiązać połączenia, ponieważ gospodarz nie zezwala na połączenia przekazywane. Przełącz na tryb „Auto” lub „Direct” i spróbuj ponownie.","Nie można dołączyć do sesji współpracy, ponieważ osiągnięto już maksymalną liczbę 5 uczestników. Aby zwiększyć limit uczestników, poproś gospodarza o zmianę ustawienia Zwiększony limit gości, załaduj ponownie, a następnie rozpocznij nową sesję współpracy.","Gospodarz odmówił Ci dołączenia do sesji współpracy.","Upłynął limit czasu oczekiwania na odpowiedź gospodarza na Twoje żądanie.","Żądanie dołączenia do sesji współpracy zostało anulowane.","Nie można odnaleźć sesji współpracy.","Gospodarz zablokował Ci możliwość dołączenia do współpracy. Jeśli było to przypadkowe, poproś go o ponowne uruchomienie sesji.","Nie można nawiązać połączenia z serwerem. Odebrano kod stanu oznaczający niepowodzenie.","Rozszerzenie Live Share nie mogło uzyskać dostępu do łańcucha kluczy logowania. Taka sytuacja może się pojawić po niedawnej zmianie hasła lub uszkodzeniu łańcucha kluczy logowania.Zobacz więcej informacji, aby dowiedzieć się, jak to naprawić.","Warunki sieciowe gospodarza są słabe lub połączenie z usługą przekazywania w chmurze rozszerzenia Live Share zostało przerwane. Poproś go o sprawdzenie warunków sieciowych, ponowne uruchomienie sesji współpracy i ponowienie próby.","Nie można nawiązać połączenia z usługą przekazywania w chmurze rozszerzenia Live Share. Sprawdź ustawienia serwera proxy, zapory i sieci, a następnie spróbuj ponownie.","Gospodarz nie zezwala na uruchomienie debugera. W razie potrzeby poproś go o włączenie tego programu.","Nie można nawiązać połączenia z serwerem. Wystąpił błąd połączenia HTTPS, upewnij się, że nie ma żadnych certyfikatów z podpisem własnym ani niestandardowych zasad weryfikacji certyfikatów blokujących rozszerzenie Live Share.","Nie można utworzyć sesji planowanej","Nie można usunąć sesji planowanej","Nie można zmienić nazwy sesji planowanej","Nie można skopiować linku sesji planowanej ","Nie można dołączyć do sesji planowanych","Wygląda na to, że masz katalog z plikami o takich samych nazwach z wyjątkiem wielkości liter. Jest to obecnie nieobsługiwane i może powodować błędy.","Program VS Code jest uruchamiany poza folderem Aplikacje, więc nie możemy zainstalować obsługi dołączania do sesji za pomocą linku przeglądarki. Nadal możesz dołączać do sesji ręcznie.","Nie można zainstalować obsługi dołączania do sesji przy użyciu linku przeglądarki. Nadal możesz dołączać do sesji ręcznie.","Trwa otwieranie sesji zdalnej...","Trwa dołączanie do sesji zdalnej...","Trwa oczekiwanie na zatwierdzenie przez gospodarza...","Utracono połączenie. Trwa ponowne nawiązywanie połączenia z hostem...","Trwa tworzenie sesji planowanej...","Trwa usuwanie sesji planowanej...","Nie odnaleziono ścieżki: lazyLoad(() => nlsloc($(path)","Ścieżka już istnieje: lazyLoad(() => nlsloc($(path)","Odmowa dostępu: lazyLoad(() => nlsloc($(path)","Plik jest za duży.","Plik jest niedostępny.","— użytkownik zgłosił żądanie dołączenia do sesji współpracy.","Zaakceptuj","Zaakceptuj tylko do odczytu","Zaakceptuj do odczytu i zapisu","Odrzuć","Zawsze akceptuj użytkowników anonimowych","— użytkownik dołączył do sesji współpracy.","— użytkownik został odłączony.","— użytkownik opuścił sesji współpracy.","Użytkownik $(userId) poprosił o skoncentrowanie uwagi.","Użytkownik $(userId) poprosił, aby go obserwować.","Skopiowano link sesji.","Informacje o wspólnym edytowaniu zostały skopiowane do schowka.","Aby obsługiwać dołączanie do sesji przy użyciu linku przeglądarki, potrzebujemy uprawnień do uruchamiania instalatora w systemie. System operacyjny może poprosić o podanie hasła administratora (sudo) w terminalu. Zainstalować teraz?","Polecenie instalacji przycisku uruchamiania linku przeglądarki skopiowano do schowka.","Możesz uruchomić polecenie „Live Share: konfiguracja uruchamiania”, aby ukończyć integrację później.","Uruchamianie linków przeglądarki zostało pomyślnie zainstalowane.","Kopiuj zamiast tego","Zainstaluj","Link do zaproszenia skopiowany do schowka! Wyślij do wszystkich, którym ufasz","Sesja udostępniona! Kliknij pozycję „Kopiuj link”, aby pobrać link z zaproszeniem ","lub kliknij pozycję „Więcej informacji”, aby dowiedzieć się o bezpiecznym udostępnianiu.","Link sesji wielokrotnego użytku zostanie skopiowany do schowka. Zapisz link w bezpiecznej lokalizacji. Dowiedz się więcej o tym, jak używać sesji, klikając pozycję „Więcej informacji”.","Link sesji wielokrotnego użytku został utworzony! Kliknij pozycję „Kopiuj link”, aby uzyskać link. Zapisz link w bezpiecznej lokalizacji. Dowiedz się więcej o tym, jak używać sesji, klikając pozycję „Więcej informacji”.","Zaloguj się przy użyciu programu VS Live Share, aby dołączyć do sesji współpracy.","Musisz się zalogować przed dołączeniem do sesji współpracy.","$(options.title)","Nie można edytować terminalu w trybie tylko do odczytu (anonimowe). Zaloguj się, aby przejść dalej.","Wybierz sesję planowaną","Wygaśnięcie:","Utwórz sesję planowaną...","Utwórz sesję planowaną","Podaj nazwę sesji planowanej","Nazwa nie może być pusta. Wprowadź nazwę alfanumeryczną dla sesji","Nazwa jest nieprawidłowa. Wprowadź nazwę alfanumeryczną dla sesji"," (Tylko do odczytu)"," (Anonimowe i tylko do odczytu)"," (Anonim oraz odczyt i zapis)"," (Anonim)","W sesji usługi Live Share","Zacznij pisać, aby wyszukać kontakty","Wybierz dostawcę obecności do użycia","Zaproszono","Zaproszono","Zaproszono","Rozpocznij sesję współpracy..."," (Tylko do odczytu)"," (Anonimowe i tylko do odczytu)"," (Anonim oraz odczyt i zapis)","Użytkownik tylko do odczytu","Kontynuuj jako","Kontynuuj bez logowania się jako gość tylko do odczytu","Wybierz konto, aby się zalogować","Zaloguj się przy użyciu konta ${key}","Nie można utworzyć wątku komentarzy","Nie można usunąć wątku komentarzy","Nie można odpowiedzieć","Nie można edytować komentarza","Nie można zapisać komentarza","Nie można anulować edytowania komentarza","Nie można usunąć komentarza","najpierw usuń inne komentarze w wątku","Komentarze do sesji rozszerzenia Live Share","Uczestnicy:","Czat rozszerzenia Live Share — nowe: $(unreads)","Czat","Czat sesji","Czat w rozszerzeniu Live Share","Wybierz kanał czatu","(nowe: $(unread))","$(username) pisze...","_rozpoczął(-częła) sesję rozszerzenia Live Share_","_zakończył(a) sesję rozszerzenia Live Share_","_dołączył(a) do sesji rozszerzenia Live Share_","_opuścił(a) sesję rozszerzenia Live Share_","Gospodarz tej sesji współpracy jest obecnie rozłączony lub używa wersji rozszerzenia _Live Share_, która nie obsługuje tej funkcji. [Dowiedz się więcej](https://aka.ms/vsls-chat)","Osoba, z którą próbujesz się skontaktować, jest obecnie niedostępna lub używa wersji rozszerzenia _Live Share_, która nie obsługuje tej funkcji. [Dowiedz się więcej](https://aka.ms/vsls-chat)","Nieznany użytkownik","Czatowanie z tym kontaktem","Otwórz kanał czatu sesji","Usługa czatu jest obecnie rozłączona. Spróbuj ponownie wkrótce.","Zaktualizuj rozszerzenie towarzyszące „Live Share Chat”, które nie jest już zgodne. Zainstalowana wersja nie jest już zgodna. [Dowiedz się więcej](https://aka.ms/vsls-chat)","Co chcesz zrobić?","$(x) Rozłącz","Rozłącz połączenie audio.","$(mute) Włącz wyciszenie","$(unmute) Wyłącz wyciszenie","Włącz wyciszenie, aby inni Cię nie słyszeli.","Wyłącz wyciszenie mikrofonu, aby inni mogli Cię usłyszeć.","$(organization) Wyświetl uczestników","Wyświetl listę uczestników programu Live Share, którzy aktualnie biorą udział w połączeniu.","$(unmute) Konfiguruj głośniki","Wybierz głośniki, których chcesz używać podczas połączenia audio.","$(megaphone) Konfiguruj mikrofon","Wybierz mikrofon, którego chcesz używać dla połączenia audio.","Uczestnicy (0)","Dołącz do połączenia audio...","Rozpocznij połączenie audio...","Trwa dołączanie do połączenia audio...","Trwa rozpoczynanie połączenia audio...","Trwa kończenie połączenia audio...","Połączenie audio","Uczestnicy połączeń audio ($(participantCount))","Nieznany użytkownik","$(displayName) (Ty)","Dołącz","Trwa podłączanie audio...","Trwa rozłączanie audio...","Uczestnicy połączeń audio","Wybierz mikrofon, którego chcesz używać","Wybierz głośnik, którego chcesz używać","Rozpoczęto połączenie audio dla tej sesji współpracy.","Zestaw wyników zawiera tylko podzestaw wszystkich dopasowań. Podaj bardziej szczegółowe kryteria wyszukiwania, aby zawęzić wyniki.","[Nowe]","Gospodarz udostępnił Ci serwer $(sessionName). Czy chcesz wyświetlić go w przeglądarce?","Tak","Nie","Nie można otworzyć serwera $(sessionName) w przeglądarce. Gospodarz cofnął udostępnianie serwera","Obszar roboczy Live Share","Host ma notes otwarty za pomocą","Użyj tego samego widoku do otworzenia","Wspólne edytowanie nie jest obsługiwane w przypadku notesów otwartych za pomocą widoków nieudostępnionych.","Jądro do wykonywania komórek na maszynie hosta","Host przyznał dostęp do wykonywania komórek notesu","Host odrzucił żądanie wykonania komórek notesu","Nie można wykonywać komórek notesu w sesji tylko do odczytu","Host nie przyznał uprawnienia do wykonywania komórek notesu","Zażądaj dostępu","Zezwalaj w trakcie tej sesji","Zawsze zezwalaj","Odrzuć","Gość żąda uprawnienia do wykonywania komórek notesu","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Twój obszar roboczy został udostępniony, ale co najmniej jeden folder nie był folderem lokalnym i nie można go uwzględnić w udostępnionym obszarze roboczym.","Nie można nawiązać połączenia z usługą Azure Relay, możesz współpracować tylko z gośćmi w tej samej sieci. Sprawdź, czy zapora sieciowa, system DNS lub serwer proxy nie blokuje dostęp do usługi Microsoft Azure Relay, i spróbuj ponownie."],"src/_new_/decorators/gaNotificationCommandDecorator":["Rozszerzenie Live Share jest teraz ogólnie dostępne i chcemy podziękować za pomoc w dotarciu do tego etapu! Jako niejawny tester nadal będziesz uzyskiwać nowe funkcje jako pierwszy.","Więcej informacji","Przełącz się na stabilne funkcje"],"src/_new_/util/WorkspaceFirewallUtil":["Nie można udostępnić. Rozszerzenie Visual Studio Live Share jest obecnie w trybie połączenia „Direct” i Twoja zapora zablokowała zabezpieczone połączenia przychodzące wymagane do rozpoczęcia sesji współpracy.\r\n\r\nAby udostępnić, trzeba będzie zmodyfikować reguły zapory tak, aby zezwalały programowi vsls-agent.exe na akceptowanie połączeń przychodzących, lub przełączyć się do trybu połączenia „Auto” lub „Relay”.","Twoja zapora blokuje programowi vsls-agent.exe akceptowanie połączeń bezpośrednich na portach wymaganych przez rozszerzenie Visual Studio Live Share do zwiększania wydajności dla współpracowników w tej samej sieci.\r\n\r\nRozszerzenie Live Share przełączy się teraz do trybu połączenia „Relay” dla wszystkich przyszłych sesji i będzie kierować ruch za pośrednictwem przekaźnika w chmurze. Naciśnij przycisk „Anuluj”, aby zamiast tego zatrzymać udostępnianie","Rozszerzenie Visual Studio Live Share jest obecnie w trybie połączenia „Direct” i aby działało, musi przyjmować podczas udostępniania zabezpieczone połączenia przychodzące.\r\n\r\nZapora teraz poprosi Cię o przyznanie programowi vsls-agent.exe dostępu do wymaganych portów. Jeśli odmówisz dostępu, udostępnianie nie będzie możliwe.","Rozszerzenie Visual Studio Live Share jest obecnie w trybie połączenia „Auto”, który zwiększa wydajność dla współpracowników w tej samej sieci, akceptując zabezpieczone połączenia przychodzące podczas udostępniania.\r\n\r\nTwoja zapora zapyta Cię teraz o przyznanie programowi vsls-agent.exe dostępu do wymaganych portów. Odmowa tego dostępu spowoduje, że zamiast tego wszystkie połączenia będą kierowane przez przekaźnik w chmurze."],"src/abstractions/node/agent":[]}