{"src/commands":["Réparer","Échec de la mise à jour ou de l'installation de VS Live Share en raison d'un téléchargement endommagé.","Échec de la mise à jour ou de l'installation de VS Live Share en raison d'un téléchargement endommagé.","Vous avez des problèmes avec votre installation de Live Share ?","$(messagePrefix) Vérifiez que vous disposez d'une connectivité réseau, puis cliquez sur Réparer pour redémarrer VS Code et tenter une récupération.","Réessayer","Impossible de terminer la réparation car des fichiers sont en cours d’utilisation. Mettez fin à tous les processus de l’agent Visual Studio Live Share (${processName}), puis cliquez sur Réessayer","L'hôte a mis fin à la session de collaboration actuelle. Les dossiers et les éditeurs ouverts vont se fermer.","La session de collaboration a expiré. Connectez-vous, puis réessayer.","Vous avez été supprimé de la session de collaboration.","Vous avez été bloqué de la session de collaboration.","Vous avez été déconnecté de la session de collaboration en raison d'un problème de connectivité ou parce que l'hôte est hors connexion.","La session de collaboration s'est terminée en raison d'une erreur interne.","La session de collaboration a expiré. Connectez-vous, puis réessayer.","La session de collaboration a pris fin en raison d'une mise hors connexion du réseau. Vérifiez l'état du réseau.","Dans la mesure où Azure Cloud Relay est passé hors connexion pour cette session, les nouveaux invités ne pourront peut-être pas rejoindre correctement la session via le relais. Réeffectuez le partage.","Dans la mesure où Azure Cloud Relay est passé hors connexion pour cette session, les nouveaux invités ne pourront peut-être pas rejoindre correctement la session via le relais. Réeffectuez le partage.","La session de collaboration s'est terminée en raison d'une erreur interne."],"src/extension":[],"src/localizeCallback":["Qu'aimeriez-vous faire avec d'autres collaborateurs ?","Inviter d’autres Personnes (Copier le Lien)","Copiez le lien d’invitation pour que vous puissiez l’envoyer à d’autres participants.","Participants ciblés","Demandez aux autres participants de vous suivre.","Partager le terminal en lecture seule","Partager le terminal","Démarrez un nouveau terminal/invite de commande à utiliser par tous les participants.","Partager le serveur","Exposez un port TCP local à tous les participants.","Afficher les serveurs partagés","Affichez les serveurs TCP locaux partagés avec des participants de collaboration.","Arrêter de Partager le Serveur","Arrêter le partage d’un port TCP local pour tous les participants.","Arrêter la session de collaboration","Arrêtez la session de collaboration, arrêtez de partager tout le contenu et supprimez tous les accès des participants.","Connectez-vous avec votre GitHub ou compte Microsoft pour obtenir un accès en lecture/écriture.","Attacher à une session de débogage partagée","Attachez votre débogueur à une session de débogage que l'hôte a partagée avec les participants.","Accès Terminal Partagé","Terminal ouvert que l'hôte a partagé avec les participants.","Accéder au serveur partagé","Copiez un port TCP partagé nommé à utiliser","Quitter la Session de Collaboration","Arrêtez de participer à cette session de collaboration.","Que voulez-vous faire ?","Démarrer la session de collaboration","Démarrez une session de collaboration pour partager du contenu et inviter des participants.","Démarrer une session de collaboration en lecture seule","Démarrez une session de collaboration en lecture seule pour partager du contenu et inviter des participants.","Rejoindre la Session de Collaboration","Rejoignez une session de collaboration pour accéder au contenu partagé.","Copier à nouveau","Copier le lien","Faire lire/écrire","Rendre en lecture seule","Démarrer le partage","Aide","OK","Se connecter","Continuer comme anonyme","Plus d'informations","Ne plus afficher","Ce lien d’invitation a expiré. Partagez à nouveau pour générer un nouveau lien.","Connexion impossible au serveur. Vérifiez que vous êtes connecté à Internet.","Le service $(shortName) nécessite une version d'extension plus récente que celle que vous avez installée.","L'extension que vous avez installée nécessite une version plus récente du service $(shortName).","L'extension $(shortName) que vous avez installée est trop ancienne pour se connecter à cette session de collaboration.","L'hôte de session de collaboration exécute une version de l'extension $(shortName) plus ancienne que la vôtre.","L'agent $(shortName) est plus récent que l'extension","L'agent $(shortName) est plus ancien que l'extension","Impossible de partager en mode \"Direct\" en raison de l'absence d'adresses IP convenables. Basculez sur le mode \"Auto\" ou \"Relais\", et réessayez.","Adresse de connexion compatible introuvable. Passez en mode \"Auto\", puis réessayez.","Connexion impossible à l'hôte. Vérifiez que vous et l'hôte êtes en ligne.","Connexion impossible à l'hôte en mode \"Relay\". Vérifiez que vous et l'hôte êtes en ligne. Si tel est le cas, passez en mode \"Auto\" ou \"Direct\", puis réessayez.","Connexion impossible à l'hôte en mode \"Direct\". Vérifiez que vous et l'hôte êtes en ligne. Si tel est le cas, passez en mode \"Auto\" ou \"Relay\", puis réessayez.","Impossible de contacter l'hôte en raison d'une erreur de protocole. Vérifiez que vous êtes en ligne ainsi que l'hôte, et que vous utilisez la dernière version de $(shortName).","Impossible de rejoindre l'hôte en raison d'une erreur d'authentification. Vérifiez que l'hôte est en ligne, déconnectez-vous, reconnectez-vous, puis réessayez.","Impossible de rejoindre l'hôte en raison d'une erreur d'authentification. Vérifiez que l'hôte est en ligne, déconnectez-vous, reconnectez-vous, puis réessayez.","Erreur d'authentification inattendue. Essayez de vous reconnecter.","Échec de l'échange de jetons. Code : ${code}","L'hôte n'autorise pas les connexions directes. Passez en mode \"Auto\" ou \"Relay\", puis réessayez.","Connexion impossible, car l'hôte n'autorise pas les connexions relayées. Passez en mode \"Auto\" ou \"Direct\", puis réessayez.","Impossible de rejoindre la session de collaboration, car elle a déjà atteint le maximum de 5 participants. Pour augmenter la limite de participants, demandez à l'hôte de changer le paramètre Limite d'invités augmentée, relancez le chargement, puis démarrez une nouvelle session de collaboration.","L'hôte a refusé votre participation à la session de collaboration.","Expiration du délai d'attente de la réponse de l'hôte à votre demande.","La demande visant à rejoindre la session de collaboration a été annulée.","Session de collaboration introuvable.","L'hôte vous a empêché de rejoindre la session de collaboration. S'il s'agit d'une erreur par inadvertance, demandez à l'hôte de redémarrer la session.","Impossible de se connecter au serveur. Code d'état d'échec reçu.","Live Share n'a pas pu accéder au trousseau de connexion. Cette erreur peut se produire si vous avez récemment changé votre mot de passe ou que votre trousseau de connexion est endommagé. Consultez plus d'informations sur la résolution du problème.","Les conditions réseau de l'hôte sont médiocres, ou celui-ci n'est plus connecté au relais cloud Live Share. Demandez au responsable de l'hôte de vérifier l'état du réseau, de relancer la session de collaboration, puis réessayez.","Connexion impossible au relais cloud Live Share. Vérifiez vos paramètres de proxy, de pare-feu et réseau, puis réessayez.","L'hôte n'autorise pas le démarrage du débogueur. Si nécessaire, demandez son activation.","Connexion impossible au serveur. Échec de la connexion HTTPS. Vérifiez qu'aucun certificat auto-signé ou qu'aucune stratégie de validation de certificat personnalisée ne bloque Live Share.","Échec de la création d'une session planifiée","Échec de la suppression d'une session planifiée","Échec du renommage de la session planifiée","Échec de la copie du lien de session planifiée","Échec de l'opération permettant de rejoindre des sessions planifiées","Il semble que vous ayez un répertoire contenant des fichiers dont le nom est identique, à l'exception de la casse. Cette opération n'est pas prise en charge et peut entraîner des erreurs.","Vous exécutez VS Code en dehors du dossier Applications, nous ne pouvons donc pas installer la prise en charge de la participation aux sessions à l'aide d'un lien de navigateur. Vous pouvez toujours rejoindre des sessions manuellement.","Échec de l'installation de la prise en charge de la participation aux sessions à l'aide d'un lien de navigateur. Vous pouvez toujours rejoindre les sessions manuellement.","Ouverture d'une session à distance...","Accès à la session à distance...","En attente d'approbation de l'hôte...","Perte de la connexion. Reconnexion à l'hôte...","Création de la session planifiée...","Suppression de la session planifiée...","Le chemin est introuvable : lazyLoad(() => nlsloc($(path)","Le chemin existe déjà : lazyLoad(() => nlsloc($(path)","Accès refusé : lazyLoad(() => nlsloc($(path)","Le fichier est trop volumineux.","Le fichier n'est pas disponible."," a demandé à rejoindre la session de collaboration.","Accepter","Accepter en lecture seule","Accepter en lecture/écriture","Rejeter","Toujours accepter l'anonymat"," a rejoint la session de collaboration."," a été déconnecté.","a quitté la session de collaboration.","$(userId) a attiré votre attention.","$(userId) vous ont demandé de les suivre.","Lien de session copié.","Informations de travail en mode collaboratif copiées dans le Presse-papiers.","Pour pouvoir rejoindre une session à l'aide d'un lien de navigateur, nous avons besoin de l'autorisation d'exécuter un programme d'installation sur votre système. Votre système d'exploitation peut vous demander votre mot de passe administrateur (sudo) dans un terminal. Installer maintenant ?","Commande d'installation du lanceur de liens du navigateur copiée dans le presse-papiers.","Vous pouvez exécuter la commande « Live Share: Launcher Setup » pour terminer l’intégration ultérieurement.","Le lanceur de liens du navigateur a été installé avec succès.","Copier à la place","Installer","Lien d'invitation copié dans le presse-papiers ! Envoyez-le à quelqu'un en qui vous avez confiance","Session partagée ! Cliquez sur \"Copier le lien\" pour obtenir un lien d'invitation ","ou cliquez sur \"Plus d'infos\" pour en savoir plus sur le partage sécurisé.","Un lien de session réutilisable est copié dans le presse-papiers. Enregistrez le lien à un emplacement sécurisé. Apprenez-en plus sur l'utilisation de votre session en cliquant sur \"Plus d'infos\".","Un lien de session réutilisable est créé ! Cliquez sur \"Copier le lien\" pour obtenir le lien. Enregistrez le lien dans un emplacement sécurisé. Apprenez-en plus sur l'utilisation de votre session en cliquant sur \"Plus d'infos\".","Connectez-vous avec VS Live Share pour rejoindre une session de collaboration.","Vous devez vous connecter avant de rejoindre la session de collaboration.","$(options.title)","Impossible de modifier le terminal en mode lecture seule (anonyme). Connectez-vous pour continuer.","Sélectionner une session planifiée","Expiration : ","Créer une session planifiée...","Créer une session planifiée","Spécifier le nom de la session planifiée","Le nom ne doit pas être vide. Entrez un nom alphanumérique pour la session","Le nom est non valide. Entrez un nom alphanumérique pour la session"," (En lecture seule)"," (Anonyme et en lecture seule)"," (Anonyme et en lecture/écriture)"," (Anonyme)","Dans une session Live Share","Taper pour rechercher des contacts","Sélectionner le fournisseur de présence à utiliser","Invité","Invité","Invité","Démarrer la session de collaboration..."," (En lecture seule)"," (Anonyme et en lecture seule)"," (Anonyme et en lecture/écriture)","Utilisateur en lecture seule","Continuer en tant que","Continuer sans se connecter en tant qu'invité en lecture seule","Sélectionnez un compte pour vous connecter","Se connecter avec le compte ${key}","Impossible de créer le thread de commentaires","Impossible de supprimer le thread de commentaires","Impossible de répondre","Impossible de modifier le commentaire","Impossible d'enregistrer le commentaire","Impossible d'annuler la modification du commentaire","Impossible de supprimer le commentaire","supprimer d'abord les autres commentaires du thread","Commentaires de session Live Share","Participants :","Conversation Live Share : $(unreads) nouveaux éléments","Conversation","Conversation de session","Conversation Live Share","Sélectionner un canal de conversation","($(unread) nouveaux éléments)","$(username) est en train de taper...","_a démarré la session Live Share_","_a mis fin à la session Live Share_","_a rejoint la session Live Share_","_a quitté la session Live Share_","L'hôte de cette session de collaboration est actuellement déconnecté de la conversation ou utilise une version de _Live Share_ qui ne prend pas en charge cette fonctionnalité. [En savoir plus](https://aka.ms/vsls-chat)","La personne que vous essayez de contacter est actuellement indisponible ou utilise une version de _Live Share_ qui ne prend pas en charge cette fonctionnalité. [En savoir plus](https://aka.ms/vsls-chat)","Utilisateur inconnu","Converser avec ce contact","Ouvrir le canal de conversation de session","Le service de conversation est actuellement déconnecté. Réessayez dans quelques instants.","Mettez à jour l'extension complémentaire 'Live Share Chat'. La version installée n'est plus compatible. [En savoir plus](https://aka.ms/vsls-chat)","Que voulez-vous faire ?","$(x) Déconnecter","Déconnectez-vous de l'appel audio.","$(mute) Mettez-vous en sourdine","$(unmute) Rétablir le son","Mettez-vous en sourdine pour que les autres ne vous entendent pas.","Activez votre microphone pour que les autres puissent vous entendre.","$(organisation) Afficher les participants","Affichez la liste des participants Live Share qui participent actuellement à l'appel.","$(unmute) Configurer les haut-parleurs","Sélectionnez les haut-parleurs à utiliser pour l'appel audio.","$(mégaphone) Configurer le Microphone","Sélectionnez le microphone à utiliser pour l'appel audio.","Participants (0)","Rejoindre l'appel audio...","Démarrer l'appel audio","Rejoindre l’appel audio...","Démarrage de l'appel audio...","Fin de l'appel audio...","Appel audio","Participants à l'appel audio ($(participantCount))","Utilisateur inconnu","$(displayName) (vous)","Rejoindre","Connexion audio...","Déconnexion du son...","Participants à l'appel audio","Sélectionnez le microphone à utiliser","Sélectionner le haut-parleur à utiliser","Un appel audio a été lancé pour cette session de collaboration.","Le jeu de résultats contient uniquement un sous-ensemble de toutes les correspondances. Soyez plus précis dans votre recherche pour affiner les résultats.","[Nouveau]","L'hôte a partagé un serveur $(sessionName) avec vous. Voulez-vous le voir dans le navigateur ?","Oui","Non","Impossible d'ouvrir le serveur $(sessionName) dans le navigateur. L'hôte a arrêté le partage du serveur","Espace de travail Live Share","Le notebook est ouvert sur l'hôte avec","Utilisez la même vue pour ouvrir","Le travail en mode collaboratif n'est pas pris en charge pour les notebooks ouverts avec des vues non partagées.","Noyau permettant d'exécuter des cellules sur la machine de l'hôte","L'hôte vous a octroyé l'accès à l'exécution de cellules de notebook","L'hôte a rejeté votre demande d'exécution de cellules de notebook","Vous ne pouvez pas exécuter de cellules de notebook dans une session en lecture seule","L'hôte ne vous a pas octroyé l'autorisation d'exécuter des cellules de notebook","Demander l'accès","Autoriser pour cette session","Autoriser toujours","Rejeter","Un invité demande l'autorisation d'exécuter des cellules de notebook","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Votre espace de travail est partagé, mais un ou plusieurs dossiers ne sont pas locaux et ne peuvent pas être inclus dans l'espace de travail partagé.","Connexion impossible à Azure Relay, vous pouvez uniquement collaborer avec des invités sur le même réseau. Vérifiez que votre pare-feu réseau, votre DNS ou votre proxy ne bloque pas l'accès à Microsoft Azure Relay, puis réessayez."],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share est maintenant en GA. Nous vous remercions de nous avoir aidé à y parvenir ! En tant que membre du programme Insider, vous allez continuer à recevoir de nouvelles fonctionnalités en avant-première.","En savoir plus","Passer à des fonctionnalités stables"],"src/_new_/util/WorkspaceFirewallUtil":["Partage impossible. Visual Studio Live Share est actuellement en mode de connexion \"Direct\" et votre pare-feu a bloqué les connexions sécurisées entrantes nécessaires pour démarrer une session de collaboration.\r\n\r\nPour effectuer le partage, vous devez modifier vos règles de pare-feu de sorte à autoriser vsls-agent.exe à accepter les connexions entrantes, ou basculez sur le mode de connexion \"Auto\" ou \"Relais\".","Votre pare-feu empêche vsls-agent.exe d'accepter les connexions directes sur les ports dont Visual Studio Live Share a besoin pour améliorer les performances des collaborateurs figurant sur le même réseau.\r\n\r\nLive Share doit maintenant basculer en mode de connexion \"Relais\" pour toutes les futures sessions et router le trafic avec un relais cloud. Appuyez sur \"Annuler\" si vous préférez arrêter le partage","Visual Studio Live Share est actuellement en mode de connexion \"Direct\" et doit accepter les connexions entrantes sécurisées pendant le partage.\r\n\r\nVotre pare-feu doit maintenant vous inviter à donner l'accès à vsls-agent.exe sur les ports nécessaires. Si vous refusez l'accès, vous ne pouvez pas effectuer de partage.","Visual Studio Live Share est actuellement en mode de connexion \"Auto\" qui améliore les performances des collaborateurs figurant sur le même réseau en acceptant des connexions entrantes sécurisées pendant le partage.\r\n\r\nVotre pare-feu doit maintenant vous inviter à donner l'accès à vsls-agent.exe sur les ports nécessaires. Si vous refusez l'accès, toutes les connexions sont routées par un relais cloud."],"src/abstractions/node/agent":[]}