{"src/commands":["Reparieren","Fehler beim Aktualisieren oder Installieren von VS Live Share aufgrund eines beschädigten Downloads.","Fehler beim Aktualisieren oder Installieren von VS Live Share aufgrund eines beschädigten Downloads.","Treten bei der Live Share-Installation Probleme auf?","$(messagePrefix) Stellen Sie sicher, dass Sie über Netzwerkkonnektivität verfügen, und klicken Sie dann auf \"Reparieren\", um VS Code neu zu starten und eine Wiederherstellung zu versuchen.","Wiederholen","Die Reparatur kann nicht abgeschlossen werden, weil Dateien verwendet werden. Bitte beenden Sie alle Prozesse des Visual Studio Live Share-Agent (${processName}), und klicken Sie auf „Wiederholen“.","Der Gastgeber hat die aktuellen Zusammenarbeitssitzung beendet. Offene Ordner und Editoren werden jetzt geschlossen.","Die Zusammenarbeitssitzung ist abgelaufen. Melden Sie sich erneut an, und versuchen Sie es noch mal.","Sie wurden aus der Zusammenarbeitssitzung entfernt.","Die Zusammenarbeitssitzung wurde für Sie gesperrt.","Die Verbindung mit der Zusammenarbeitssitzung wurde getrennt, weil ein Verbindungsproblem vorliegt oder der Host offline geschaltet wurde.","Die Zusammenarbeitssitzung wurde aufgrund eines internen Fehlers beendet.","Die Zusammenarbeitssitzung ist abgelaufen. Melden Sie sich erneut an, und versuchen Sie es noch mal.","Die Zusammenarbeitssitzung wurde beendet, weil das Netzwerk offline geschaltet wurde. Überprüfen Sie Ihren Netzwerkstatus.","Azure Cloud Relay wurde für diese Sitzung offline geschaltet. Neue Gäste können möglicherweise nicht erfolgreich über die Vermittlung beitreten. Erwägen Sie eine erneute Freigabe.","Azure Cloud Relay wurde für diese Sitzung offline geschaltet. Neue Gäste können möglicherweise nicht erfolgreich über die Vermittlung beitreten. Erwägen Sie eine erneute Freigabe.","Die Zusammenarbeitssitzung wurde aufgrund eines internen Fehlers beendet."],"src/extension":[],"src/localizeCallback":["Was möchten Sie mit anderen Projektmitarbeitern tun?","Andere einladen (Link kopieren)","Kopieren Sie den Einladungslink, damit Sie ihn an andere Teilnehmer senden können.","Teilnehmer hinzuziehen","Bitten Sie andere Teilnehmer, Ihnen zu folgen.","Schreibgeschütztes Terminal freigeben","Terminal freigeben","Starten Sie ein neues Terminal / eine Eingabeaufforderung für alle Teilnehmer.","Server freigeben","Machen Sie einen lokalen TCP-Port für alle Teilnehmer verfügbar.","Freigegebene Server anzeigen","Lokale TCP-Server anzeigen, die für Teilnehmer der Zusammenarbeit freigegeben sind.","Freigabeserver beenden","Beenden Sie die Freigabe eines lokalen TCP-Ports für alle Teilnehmer.","Zusammenarbeitssitzung beenden","Beenden Sie die Zusammenarbeitssitzung sowie die Freigabe aller Inhalte, und entfernen Sie den gesamten Teilnehmerzugriff.","Melden Sie sich mit Ihrem GitHub oder Microsoft-Konto an, um Lese-/Schreibzugriff zu erhalten.","Anfügen an eine freigegebene Debugsitzung","Fügen Sie Ihren Debugger an eine Debugsitzung an, die der Host für Teilnehmer freigegeben hat.","Zugriff auf freigegebenes Terminal","Öffnen Sie das Terminal, das der Host für Teilnehmer freigegeben hat.","Zugriff auf freigegebenen Server","Kopieren eines benannten, freigegebenen TCP-Ports zur Verwendung","Zusammenarbeitssitzung verlassen","Beenden Sie die Teilnahme an dieser Zusammenarbeitssitzung.","Wie möchten Sie fortfahren?","Zusammenarbeitssitzung starten","Starten Sie eine Zusammenarbeitssitzung, um Inhalte freizugeben und Teilnehmer einzuladen.","Schreibgeschützte Zusammenarbeitssitzung starten","Starten Sie eine schreibgeschützte Zusammenarbeitssitzung, um Inhalte freizugeben und Teilnehmer einzuladen.","Zusammenarbeitssitzung beitreten","Nehmen Sie an einer Zusammenarbeitssitzung teil, um auf freigegebene Inhalte zuzugreifen.","Erneut kopieren","Link kopieren","Lese-/Schreibzugriff","Als schreibgeschützt festlegen","Freigabe starten","Hilfe","OK","Anmelden","Als anonym fortfahren","Weitere Informationen","Nicht mehr anzeigen","Dieser Einladungslink ist abgelaufen. Erneut freigeben, um einen neuen Link zu generieren.","Es konnte keine Verbindung mit dem Server hergestellt werden. Überprüfen Sie, ob Sie mit dem Internet verbunden sind.","Für den $(shortName)-Dienst wird eine neuere Version der installierten Erweiterung benötigt.","Für die installierte Erweiterung wird eine neuere Version des $(shortName)-Diensts benötigt.","Die installierte $(shortName)-Erweiterung ist zu alt, um eine Verbindung mit dieser Zusammenarbeitssitzung herzustellen.","Der Host der Zusammenarbeitssitzung verwendet eine ältere Version der $(shortName)-Erweiterung als Sie.","Der $(shortName)-Agent ist neuer als die Erweiterung.","Der $(shortName)-Agent ist älter als die Erweiterung.","Eine Freigabe im Modus \"Direkt\" ist nicht möglich, weil keine geeigneten IP-Adressen verfügbar sind. Wechseln Sie in den Modus \"Auto\" oder \"Vermittlung\", und versuchen Sie es noch mal.","Es wurde keine kompatible Verbindungsadresse gefunden. Wechseln Sie in den Modus \"Auto\", und versuchen Sie es noch mal.","Es konnte keine Verbindung mit dem Gastgeber hergestellt werden. Stellen Sie sicher, dass sowohl Sie als auch der Gastgeber online sind.","Im Modus \"Relay\" kann keine Verbindung mit dem Host hergestellt werden. Überprüfen Sie, ob Sie und der Host online sind. Falls ja, wechseln Sie in den Modus \"Auto\" oder \"Direct\", und versuchen Sie es noch mal.","Im Modus \"Direct\" kann keine Verbindung mit dem Host hergestellt werden. Überprüfen Sie, ob Sie und der Host online sind. Falls ja, wechseln Sie in den Modus \"Auto\" oder \"Relay\", und versuchen Sie es noch mal.","Der Beitritt zum Host ist aufgrund eines Protokollfehlers nicht möglich. Stellen Sie sicher, dass Sie und der Host online sind und die neueste Version von $(shortName) verwenden.","Der Beitritt zum Gastgeber ist aufgrund eines Authentifizierungsfehlers nicht möglich. Überprüfen Sie, ob der Gastgeber online ist. Melden Sie sich anschließend ab und wieder an, und versuchen Sie es noch mal.","Der Beitritt zum Gastgeber ist aufgrund eines Authentifizierungsfehlers nicht möglich. Überprüfen Sie, ob der Gastgeber online ist. Melden Sie sich anschließend ab und wieder an, und versuchen Sie es noch mal.","Unerwarteter Authentifizierungsfehler. Versuchen Sie die Anmeldung noch mal.","Fehler bei Tokenaustausch. Code: ${code}","Der Host lässt keine direkten Verbindungen zu. Wechseln Sie in den Modus \"Auto\" oder \"Relay\", und versuchen Sie es noch mal.","Es kann keine Verbindung mit dem Gastgeber hergestellt werden, weil keine vermittelten Verbindungen zulässig sind. Wechseln Sie in den Modus \"Auto\" oder \"Direct\", und versuchen Sie es noch mal.","Die Teilnahme an der Zusammenarbeitssitzung ist nicht möglich, weil die maximal zulässige Anzahl von 5 Teilnehmern bereits erreicht ist. Um das Teilnehmerlimit zu erhöhen, bitten Sie den Gastgeber, die Einstellung \"Erhöhte Höchstzahl für Gäste\" zu ändern, neu zu laden und dann eine neue Zusammenarbeitssitzung zu starten.","Der Host hat Ihre Teilnahme an der Zusammenarbeitssitzung abgelehnt.","Timeout beim Warten auf eine Antwort auf Ihre Anfrage vom Gastgeber.","Die Beitrittsanfrage für die Zusammenarbeitssitzung wurde abgebrochen.","Die Zusammenarbeitssitzung wurde nicht gefunden.","Der Gastgeber hat Sie für die Teilnahme an der Zusammenarbeitssitzung gesperrt. Falls dies versehentlich geschehen ist, bitten Sie den Gastgeber, die Sitzung neu zu starten.","Es konnte keine Verbindung mit dem Server hergestellt werden. Statuscode für nicht erfolgreichen Vorgang empfangen.","Live Share konnte nicht auf die Schlüsselsammlung zum Verwalten von Anmeldeinformationen zugreifen. Dies kann vorkommen, wenn Sie vor kurzem Ihr Kennwort geändert haben oder die Schlüsselsammlung zum Verwalten von Anmeldeinformationen beschädigt ist. Unter \"Weitere Informationen\" erfahren Sie, wie Sie das Problem beheben.","Die Netzwerkbedingungen des Gastgebers sind schlecht, oder die Verbindung mit der Live Share-Cloudvermittlung wurde getrennt. Veranlassen Sie eine Überprüfung der Netzwerkbedingungen des Gastgebers, starten Sie die Zusammenarbeitssitzung erneut, und versuchen Sie es noch mal.","Es kann keine Verbindung mit der Live Share-Cloudvermittlung hergestellt werden. Überprüfen Sie Ihre Proxy-, Firewall- und Netzwerkeinstellungen, und versuchen Sie es noch mal.","Der Gastgeber lässt das Starten des Debuggers nicht zu. Fordern Sie bei Bedarf eine Aktivierung an.","Die Verbindung zum Server konnte nicht hergestellt werden. Fehler bei der HTTPS-Verbindung – stellen Sie sicher, dass Live Share nicht durch selbstsignierte Zertifikate oder benutzerdefinierte Überprüfungsrichtlinien für Zertifikate blockiert wird.","Fehler beim Erstellen einer geplanten Sitzung.","Fehler beim Löschen einer geplanten Sitzung.","Fehler beim Umbenennen der geplanten Sitzung","Fehler beim Kopieren des Links für die geplante Sitzung.","Fehler beim Beitritt zu geplanten Sitzungen","Offenbar verwenden Sie ein Verzeichnis mit Dateien, die abgesehen von der Groß- und Kleinschreibung den gleichen Namen aufweisen. Dies wird zurzeit nicht unterstützt und kann zu Fehlern führen.","Sie führen VS Code außerhalb des Ordners \"Anwendungen\" aus, sodass wir die Unterstützung für die Teilnahme an Sitzungen über einen Browserlink nicht installieren können. Sie können Sitzungen weiterhin manuell beitreten.","Fehler beim Installieren der Unterstützung für die Teilnahme an Sitzungen über einen Browserlink. Sie können Sitzungen weiterhin manuell beitreten.","Remotesitzung wird geöffnet ...","Beitritt zur Remotesitzung erfolgt ...","Warten auf Gastgebergenehmigung...","Die Verbindung wurde getrennt. Verbindung zum Host wird wiederhergestellt...","Geplante Sitzung wird erstellt...","Geplante Sitzung wird gelöscht...","Pfad nicht gefunden: lazyLoad(() => nlsloc($(path)","Pfad bereits vorhanden: lazyLoad(() => nlsloc($(path)","Zugriff verweigert: lazyLoad(() => nlsloc($(path)","Die Datei ist zu groß.","Die Datei ist nicht verfügbar.","hat eine Anforderung zum Beitritt der Zusammenarbeitssitzung gesendet.","Akzeptieren","Schreibschutz akzeptieren","Lese-/Schreibzugriff akzeptieren","Ablehnen","Anonyme Gäste immer akzeptieren","ist der Zusammenarbeitssitzung beigetreten."," wurde getrennt.","hat die Zusammenarbeitssitzung verlassen.","$(userId) hat Ihnen eine Fokusanfrage gesendet.","$(userId) möchte, dass Sie ihm/ihr folgen.","Der Sitzungslink wurde kopiert.","In die Zwischenablage kopierte Informationen werden gemeinsam bearbeitet.","Um die Teilnahme an einer Sitzung über einen Browserlink zu unterstützen, benötigen wir die Berechtigung zum Ausführen eines Installationsprogramms auf Ihrem System. Ihr Betriebssystem fragt Sie möglicherweise nach Ihrem Administratorkennwort (sudo) in einem Terminal. Jetzt installieren?","Der Installationsbefehl des Browserlinks wurde in die Zwischenablage kopiert.","Sie können den Befehl \"Live Share: Launcher Setup\" ausführen, um die Integration später abzuschließen.","Das Browserlink-Startprogramm wurde erfolgreich installiert.","Stattdessen kopieren","Installieren","Einladungslink in Zwischenablage kopiert! Senden Sie es an jeden, dem Sie vertrauen.","Sitzung freigegeben! Klicken Sie auf \"Link kopieren\", um einen Einladungslink zu erhalten ","oder klicken Sie auf \"Weitere Informationen\", um mehr über die sichere Freigabe zu erfahren.","Ein wiederverwendbarer Sitzungslink wird in die Zwischenablage kopiert. Speichern Sie den Link an einem sicheren Speicherort. Erfahren Sie mehr über die Verwendung Ihrer Sitzung, indem Sie auf \"Weitere Informationen\" klicken.","Ein wiederverwendbarer Sitzungslink wird erstellt. Klicken Sie auf \"Link kopieren\" um den Link abzurufen. Speichern Sie den Link an einem sicheren Speicherort. Erfahren Sie mehr über die Verwendung Ihrer Sitzung, indem Sie auf \"Weitere Informationen\" klicken.","Melden Sie sich mit VS Live Share an, um an einer Zusammenarbeitssitzung teilzunehmen.","Sie müssen sich anmelden, bevor Sie an der Zusammenarbeitssitzung teilnehmen können.","$(options.title)","Das Terminal kann nicht im schreibgeschützten Modus (anonym) bearbeitet werden. Melden Sie sich an, um fortzufahren.","Geplante Sitzung auswählen","Ablaufdatum: ","Geplante Sitzung erstellen...","Geplante Sitzung erstellen","Geben Sie den Namen der geplanten Sitzung an.","Der Name darf nicht leer sein. Geben Sie einen alphanumerischen Namen für die Sitzung ein.","Der Name ist ungültig. Geben Sie einen alphanumerischen Namen für die Sitzung ein."," (Schreibgeschützt)"," (Anonym & schreibgeschützt)"," (Anonym und Lesen/Schreiben)"," (Anonym)","In einer Live Share-Sitzung","Text eingeben, um nach Kontakten zu suchen","Präsenzanbieter auswählen","Eingeladen","Eingeladen","Eingeladen","Zusammenarbeitssitzung starten..."," (Schreibgeschützt)"," (Anonym & schreibgeschützt)"," (Anonym und Lesen/Schreiben)","Benutzer mit Leseberechtigung","Fortfahren als","Ohne Anmeldung als Gast mit Leseberechtigung fortfahren","Wählen Sie ein Konto für die Anmeldung aus.","Mit ${key}-Konto anmelden","Der Kommentarthread kann nicht erstellt werden.","Der Kommentarthread kann nicht gelöscht werden.","Antwort nicht möglich.","Der Kommentar kann nicht bearbeitet werden.","Der Kommentar kann nicht gespeichert werden.","Die Bearbeitung des Kommentars kann nicht abgebrochen werden.","Der Kommentar kann nicht gelöscht werden.","Löschen Sie zuerst andere Kommentare im Thread.","Kommentare zur Live Share-Sitzung","Teilnehmer:","Live Share-Chat: $(unreads) neu","Chat","Sitzungschat","Live Share-Chat","Chatkanal auswählen","($(unread) neu)","Eingabe von $(username)...","_hat die Live Share-Sitzung gestartet_","_hat die Live Share-Sitzung beendet_","_ist der Live Share-Sitzung beigetreten_","_hat die Live Share-Sitzung verlassen_","Der Gastgeber dieser Zusammenarbeitssitzung ist derzeit vom Chat getrennt oder verwendet eine Version von \"_Live Share_\", die dieses Feature nicht unterstützt. [Weitere Informationen](https://aka.ms/vsls-chat)","Die Person, die Sie kontaktieren möchten, ist nicht erreichbar oder verwendet eine Version von _Live Share_, die dieses Feature nicht unterstützt. [Weitere Informationen](https://aka.ms/vsls-chat)","Unbekannter Benutzer","Mit diesem Kontakt chatten","Chatkanal für Sitzung öffnen","Der Chatdienst ist zurzeit getrennt. Versuchen Sie es in Kürze noch mal.","Aktualisieren Sie die Begleiterweiterung \"Live Share-Chat\". Die installierte Version ist nicht mehr kompatibel. [Weitere Informationen](https://aka.ms/vsls-chat)","Wie möchten Sie fortfahren?","$(x) Trennen","Audioanruf trennen.","$(mute) Sich selbst stummschalten","$(unmute) Stummschaltung selbst aufheben","Schalten Sie sich selbst stumm, damit andere Sie nicht hören können.","Heben Sie die Stummschaltung Ihres Mikrofons auf, damit andere Sie hören können.","$(organization) Teilnehmer anzeigen","Zeigen Sie die Liste der Live Share-Teilnehmer an, die sich derzeit im Anruf befinden.","$(unmute) Lautsprecher konfigurieren","Wählen Sie aus, welche Lautsprecher für den Audioanruf verwendet werden sollen.","$(megaphone) Mikrofon konfigurieren","Wählen Sie aus, welches Mikrofon für den Audioanruf verwendet werden soll.","Teilnehmer (0)","Audioanruf beitreten...","Audioanruf starten...","Beitritt zum Audioanruf wird durchgeführt...","Audioanruf wird gestartet...","Audioanfruf wird beendet...","Audioanruf","Audioanrufteilnehmer ($(participantCount))","Unbekannter Benutzer","$(displayName) (Sie)","Beitreten","Audio wird verbunden...","Audio wird getrennt...","Audioanrufteilnehmer","Wählen Sie das zu verwendende Mikrofon aus.","Wählen Sie den zu verwendenden Lautsprecher aus.","Für diese Zusammenarbeitssitzung wurde ein Audioanruf gestartet.","Die Ergebnismenge enthält nur eine Teilmenge aller Übereinstimmungen. Präzisieren Sie Ihre Suche, um die Ergebnisse einzugrenzen.","[Neu]","Der Host hat einen Server \"$(sessionName)\" für Sie freigegeben. Möchten Sie ihn im Browser anzeigen?","Ja","Nein","Die Server \"$(sessionName)\" kann im Browser nicht geöffnet werden. Der Host hat die Freigabe des Servers aufgehoben.","Live Share-Arbeitsbereich","Auf dem Host ist das Notebook geöffnet mit","Dieselbe Ansicht zum Öffnen verwenden","Die gemeinsame Bearbeitung wird nur für Notebooks unterstützt, die mit freigegebenen Ansichten geöffnet wurden.","Kernel zum Ausführen von Zellen auf dem Hostcomputer","Der Host hat Ihnen Zugriff zum Ausführen von Notebook-Zellen gewährt.","Der Host hat Ihre Anforderung zum Ausführen von Notebook-Zellen abgelehnt.","Sie können in einer schreibgeschützten Sitzung keine Notebook-Zellen ausführen.","Der Host hat Ihnen nicht die Berechtigung zum Ausführen von Notebook-Zellen erteilt.","Zugriff anfordern","Für diese Sitzung zulassen","Immer zulassen","Ablehnen","Ein Gast fordert die Berechtigung zum Ausführen von Notebook-Zellen an.","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Ihr Arbeitsbereich wurde freigegeben, aber mindestens ein Ordner war kein lokaler Ordner und konnte daher nicht in den freigegebenen Arbeitsbereich aufgenommen werden.","Es kann keine Verbindung mit Azure Relay hergestellt werden, Sie können nur mit Gästen im selben Netzwerk zusammenarbeiten. Stellen Sie sicher, dass Ihre Netzwerkfirewall oder Ihre DNS- oder Proxyeinstellungen nicht den Zugriff auf Microsoft Azure Relay blockieren, und versuchen Sie es noch mal."],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share befindet sich jetzt in der GA (ist allgemein verfügbar), und wir danken Ihnen für Ihre Unterstützung! Als Insider gehören Sie weiterhin zu den Ersten, die neue Features erhalten.","Weitere Informationen","Zu stabilen Features wechseln"],"src/_new_/util/WorkspaceFirewallUtil":["Freigabe nicht möglich. Visual Studio Live Share befindet sich momentan im Verbindungsmodus \"Direkt\", und Ihre Firewall hat eingehende gesicherte Verbindungen gesperrt, die zum Starten einer Zusammenarbeitssitzung erforderlich sind.\r\n\r\nÄndern Sie Ihre Firewallregeln so, dass \"vsls-agent.exe\" eingehende Verbindungen zulässt, oder wechseln Sie in den Verbindungsmodus \"Auto\" oder \"Vermittlung\", um die Freigabe zu ermöglichen.","Ihre Firewall hindert \"vsls-agent.exe\" daran, direkte Verbindungen über Ports zu akzeptieren, die Visual Studio Live Share benötigt, um die Leistung für Projektmitarbeiter im selben Netzwerk zu verbessern.\r\n\r\nLive Share wechselt jetzt für alle künftigen Sitzungen in den Verbindungsmodus \"Vermittlung\" und leitet den Datenverkehr über eine Cloudvermittlung weiter. Klicken Sie auf \"Abbrechen\", um stattdessen die Freigabe zu beenden.","Visual Studio Live Share befindet sich momentan im Verbindungsmodus \"Direkt\" und muss eingehende gesicherte Verbindungen bei der Freigabe zulassen, um ordnungsgemäß zu funktionieren.\r\n\r\nIhre Firewall wird Sie nun auffordern, \"vsls-agent.exe\" Zugriff auf die erforderlichen Ports zu gewähren. Wenn Sie den Zugriff verweigern, ist keine Freigabe möglich.","Visual Studio Live Share befindet sich aktuell im Verbindungsmodus \"Auto\", der die Leistung für Projektmitarbeiter im selben Netzwerk verbessert, indem bei der Freigabe eingehende sichere Verbindungen akzeptiert werden.\r\n\r\nIhre Firewall wird Sie nun auffordern, \"vsls-agent.exe\" Zugriff auf die erforderlichen Ports zu gewähren. Wenn Sie diesen Zugriff verweigern, werden alle Verbindungen stattdessen über eine Cloudvermittlung geleitet."],"src/abstractions/node/agent":[]}