{"src/commands":["Opravit","Aktualizace nebo instalace rozšíření VS Live Share neproběhly úspěšně, protože stažený soubor byl poškozený.","Aktualizace nebo instalace rozšíření VS Live Share neproběhly úspěšně, protože stažený soubor byl poškozený.","Máte problém s instalací rozšíření Live Share?","$(messagePrefix) Ujistěte se, že jste připojení k síti, a pak klikněte na Opravit, aby se restartoval nástroj VS Code a proběhl pokus o obnovení.","Zkusit znovu","Opravu nejde dokončit, protože se soubory používají. Ukončete všechny procesy (${processName}) Visual Studio Live Share Agent a klikněte na tlačítko Opakovat.","Hostitel ukončil aktuální relaci spolupráce. Otevřené složky a editory se teď zavřou.","Platnost relace spolupráce vypršela. Přihlaste se prosím a zkuste to znovu.","Byli jste odebráni z relace spolupráce.","Váš přístup do relace spolupráce je blokován.","Byli jste odpojeni z relace spolupráce z důvodu problému s připojením nebo přechodu hostitele do offline režimu.","Relace spolupráce skončila kvůli vnitřní chybě.","Platnost relace spolupráce vypršela. Přihlaste se prosím a zkuste to znovu.","Relace spolupráce byla ukončena z důvodu přechodu sítě do offline režimu. Zkontrolujte stav sítě.","Cloudový přenos Azure se pro tuto relaci přepnul do offline režimu, noví hosté se pravděpodobně nebudou moct úspěšně připojit prostřednictvím přenosu. Bylo by vhodné relaci znovu nasdílet.","Cloudový přenos Azure se pro tuto relaci přepnul do offline režimu, noví hosté se pravděpodobně nebudou moct úspěšně připojit prostřednictvím přenosu. Bylo by vhodné relaci znovu nasdílet.","Relace spolupráce skončila kvůli vnitřní chybě."],"src/extension":[],"src/localizeCallback":["Co byste chtěli udělat s ostatními spolupracovníky?","Pozvat ostatní (Zkopírovat odkaz)","Zkopírujte odkaz na pozvánku, abyste ho mohli poslat ostatním účastníkům.","Upozornění účastníků","Požádejte ostatní účastníky, aby vás sledovali.","Sdílet terminál jen pro čtení","Sdílet terminál","Spusťte nový terminál nebo příkazový řádek, který budou používat všichni účastníci.","Server pro sdílení","Zveřejněte místní port protokolu TCP všem účastníkům.","Zobrazit sdílené servery","Zobrazit místní servery protokolu TCP sdílené s účastníky spolupráce","Zastavit sdílení serveru","Zastavte sdílení místního portu protokolu TCP pro všechny účastníky.","Zastavit relaci spolupráce","Zastavit relaci spolupráce, zastavit sdílení veškerého obsahu a odebrat přístup všem účastníkům","Přihlaste se pomocí účtu GitHub nebo Microsoft a získejte přístup pro čtení i zápis.","Připojit se k sdílené ladicí relaci","Připojte ladicí program k ladicí relaci, kterou hostitel sdílí s účastníky.","Přístup ke sdílenému terminálu","Otevřete terminál, který hostitel sdílí s účastníky.","Přístup ke sdílenému serveru","Zkopírovat pojmenovaný sdílený port protokolu TCP pro použití","Opustit relaci spolupráce","Zastavte účast v této relaci spolupráce.","Co chcete provést?","Spustit relaci spolupráce","Pokud chcete sdílet obsah a pozvat účastníky, zahajte relaci spolupráce.","Zahájit relaci spolupráce jen pro čtení","Pokud chcete sdílet obsah a pozvat účastníky, zahajte relaci spolupráce jen pro čtení.","Připojit se k relaci spolupráce","Pokud chcete získat přístup ke sdílenému obsahu, připojte se k relaci spolupráce.","Zkopírovat znovu","Zkopírovat odkaz","Nastavit pro čtení i zápis","Nastavit jen pro čtení","Zahájit sdílení","Nápověda","OK","Přihlásit se","Pokračovat jako anonymní","Další informace","Znovu nezobrazovat","Platnost tohoto odkazu na pozvánku vypršela. Pokud chcete vygenerovat nový odkaz, sdílejte ho znovu.","Nejde se připojit k serveru. Zkontrolujte, jestli jste připojení k internetu.","Služba $(shortName) vyžaduje novější verzi rozšíření, než jste si nainstalovali.","Rozšíření, které jste nainstalovali, vyžaduje novější verzi služby $(shortName).","Rozšíření $(shortName), které jste nainstalovali, je příliš staré pro připojení k této relaci spolupráce.","Hostitel relace spolupráce používá starší verzi rozšíření $(shortName) než vy.","Agent $(shortName) je novější než rozšíření.","Agent $(shortName) je starší než rozšíření.","Nejde sdílet v přímém režimu, protože neexistují žádné vhodné IP adresy. Přepněte rozšíření do automatického nebo přenosového režimu a zkuste to znovu.","Nepovedlo se najít kompatibilní adresu připojení. Přepněte rozšíření do automatického režimu (Auto) a zkuste to znovu.","Nejde se připojit k hostiteli. Ověřte, že jste vy i hostitel online.","K hostiteli se nejde připojit v přenosovém (Relay) režimu. Ověřte, že jste jak vy, tak i hostitel online. Pokud ano, přepněte rozšíření do automatického (Auto) nebo přímého (Direct) režimu a zkuste to znovu.","K hostiteli se nejde připojit v přímém (Direct) režimu. Ověřte, že jste jak vy, tak i hostitel online. Pokud ano, přepněte rozšíření do automatického (Auto) nebo přenosového (Relay) režimu a zkuste to znovu.","Nejde se připojit k hostiteli kvůli chybě protokolu. Ověřte, že vy i hostitel jste online a používáte nejnovější verzi rozšíření $(shortName).","Nejde připojit hostitele kvůli chybě ověřování. Ověřte, že hostitel je online, pak se odhlaste a znovu přihlaste a zkuste to znovu.","Nejde připojit hostitele kvůli chybě ověřování. Ověřte, že hostitel je online, pak se odhlaste a znovu přihlaste a zkuste to znovu.","Neočekávaná chyba ověřování. Zkuste se přihlásit znovu.","Výměna tokenů neproběhla úspěšně, kód: ${code}","Hostitel neumožňuje přímá připojení. Přepněte rozšíření do automatického (Auto) nebo přenosového (Relay) režimu a zkuste to znovu.","Nejde se připojit, protože hostitel neumožňuje přenášená připojení. Přepněte rozšíření do automatického (Auto) nebo přímého (Direct) režimu a zkuste to znovu.","K relaci spolupráce se nepovedlo připojit, protože už má maximální počet 5 účastníků. Pokud chcete tento limit zvýšit, požádejte prosím pořadatele, aby změnil nastavení Zvýšený limit pro hosty, načetl zobrazení znovu a pak zahájil novou relaci spolupráce.","Hostitel vám odmítl připojení k relaci spolupráce.","Při čekání na odpověď hostitele na vaši žádost vypršel časový limit.","Žádost o připojení k relaci spolupráce byla zrušena.","Relace spolupráce se nenašla.","Hostitel zablokoval vaše připojení k této relaci spolupráce. Pokud to bylo neúmyslné, požádejte prosím hostitele, aby relaci restartoval.","Nešlo se připojit k serveru. Přijal se stavový kód neúspěchu.","Rozšíření Live Share nemohlo získat přístup k přihlašovací klíčence. K tomu může dojít, pokud jste si nedávno změnili heslo nebo se přihlašovací klíčenka poškodila. Podívejte se na další informace s podrobnostmi o tom, jak to opravit.","Hostitel má nedostatečné síťové připojení nebo už není připojený ke cloudovému přenosu Live Share. Požádejte ho, aby si zkontroloval stav síťového připojení, restartujte relaci spolupráce a zkuste to znovu.","Nejde se připojit ke cloudovému přenosu rozšíření Live Share. Zkontrolujte nastavení proxy serveru, brány firewall a sítě a zkuste to znovu.","Hostitel neumožňuje spustit ladicí program. Pokud ho potřebujete, požádejte hostitele, aby ho povolil.","Nepovedlo se připojit k serveru. Připojení protokolu HTTPS nebylo úspěšné. Ověřte, že neexistují žádné certifikáty podepsané svými držiteli (self-signed certificate) ani vlastní zásady ověřování certifikátu, které blokují Live Share.","Nepovedlo se vytvořit plánovanou relaci.","Nepovedlo se odstranit plánovanou relaci.","Nepovedlo se přejmenovat plánovanou relaci","Nepovedlo se zkopírovat odkaz na plánovanou relaci.","Nepovedlo se připojit k plánovaným relacím","Vypadá to, že se máte adresář se soubory, které mají stejný název, liší se jen velkými a malými písmeny. To se v současné době nepodporuje a může to způsobit chyby.","Ve složce Aplikace máte spuštěný kód Vs Code, takže nemůžeme nainstalovat podporu připojování k relacím přes odkaz v prohlížeči. K relacím se nadále budete moct připojovat manuálně.","Podporu pro připojování se k relacím přes odkaz z prohlížeče se nepodařilo nainstalovat. K relacím se i nadále můžete připojovat manuálně.","Otevírá se vzdálená relace...","Připojování ke vzdálené relaci...","Čeká se na schválení hostitele...","Ztratilo se připojení. Spojení s hostitelem se navazuje znovu...","Vytváří se plánovaná relace...","Odstraňuje se plánovaná relace...","Cesta neexistuje: lazyLoad(() => nlsloc($(path)","Cesta už existuje: lazyLoad(() => nlsloc($(path)","Přístup se zamítl: lazyLoad(() => nlsloc($(path)","Soubor je moc velký.","Soubor není k dispozici.","žádá o připojení k relaci spolupráce.","Přijmout","Přijmout jen pro čtení","Přijmout pro čtení i zápis","Odmítnout","Vždy přijímat anonymní","se připojil(a) k relaci spolupráce."," byl odpojen.","opustil(a) relaci spolupráce.","$(userId) vás žádá o pozornost.","$(userId) vás požádal(a), abyste ho/ji sledovali.","Odkaz na relaci se zkopíroval.","Informace o společných úpravách se zkopírovaly do schránky.","Abychom mohli poskytovat podporu pro připojování k relaci přes odkaz v prohlížeči, budeme potřebovat oprávnění, abychom ve vašem systému mohli spustit instalační program. Váš operační systém může v terminálu vyžadovat zadání hesla správce (sudo). Chcete spustit instalaci?","Do schránky se zkopíroval příkaz pro instalaci spouštěče odkazů prohlížeče.","Když budete chtít integraci dokončit později, můžete spustit příkaz „Live Share: Launcher Setup“.","Spouštěč odkazů prohlížeče se úspěšně nainstaloval.","Místo toho zkopírovat","Nainstalovat","Odkaz na pozvánku se zkopíroval do schránky! Pošlete ho komukoli, komu důvěřujete,","Relace se sdílí! Pokud chcete získat odkaz na pozvánku, klikněte na Zkopírovat odkaz. ","nebo klikněte na Další informace a přečtěte si více o bezpečném sdílení.","Odkaz opakovaně použitelné relace se zkopíroval do schránky. Uložte odkaz do zabezpečeného umístění. Pokud chcete získat další informace o tom, jak používat relaci, klikněte na Další informace.","Vytvořil se odkaz opakovaně použitelné relace! Pokud chcete získat odkaz, klikněte na Kopírovat odkaz. Uložte odkaz do zabezpečeného umístění. Pokud chcete získat další informace o tom, jak používat relaci, klikněte na Další informace.","Přihlaste se pomocí Visual Studio Live Share a připojte se k relaci spolupráce.","Než se připojíte k relaci spolupráce, musíte se přihlásit.","$(options.title)","Terminál se nedá upravit v režimu jen pro čtení (anonymní). Pokud chcete pokračovat, přihlaste se.","Vyberte plánovanou relaci.","Vypršení platnosti: ","Vytvořit plánovanou relaci...","Vytvořit plánovanou relaci","Zadejte název plánované relace.","Název nemůže být prázdný. Zadejte prosím pro relaci alfanumerický název.","Název není platný. Zadejte prosím pro relaci alfanumerický název."," (Jen pro čtení)"," (Anonymní a jen pro čtení)"," (Anonymní a čtení a zápis)"," (Anonymní)","V relaci Live Share","Zadáním sem můžete hledat kontakty.","Vyberte zprostředkovatele informací o stavu, kterého chcete používat.","Pozván(a)","Pozván(a)","Pozván(a)","Spustit relaci spolupráce..."," (Jen pro čtení)"," (Anonymní a jen pro čtení)"," (Anonymní a čtení a zápis)","Uživatel s přístupem jen pro čtení","Pokračovat jako","Pokračovat bez přihlášení jako host s přístupem jen pro čtení","Vyberte prosím účet, pomocí kterého se přihlásíte.","Přihlásit pomocí účtu ${key}","Vlákno komentáře nelze vytvořit.","Vlákno komentáře nelze odstranit.","Nelze odpovědět.","Komentář nejde upravit.","Komentář nejde uložit.","Úpravu komentáře nejde zrušit.","Komentář nelze odstranit.","Nejprve odstranit jiné komentáře ve vlákně","Komentáře k relaci Live Share","Účastníci:","Chat Live Share: $(unreads) – nové","Chat","Chat relace","Chat Live Share","Vyberte kanál chatu.","($(unread) – nové)","$(username) píše...","_spustil(a) relaci Live Share_","_ukončil(a) relaci Live Share_","_se připojil(a) k relaci Live Share_","_opustil(a) relaci Live Share_","Hostitel této relace spolupráce je momentálně odpojený od chatu nebo používá verzi _Live Share_, která tuto funkci nepodporuje. [Další informace](https://aka.ms/vsls-chat)","Osoba, kterou se pokoušíte kontaktovat, momentálně není k dispozici nebo používá verzi _Live Share_, která nepodporuje tuto funkci. [Další informace](https://aka.ms/vsls-chat)","Neznámý uživatel","Chatovat s tímto kontaktem","Otevřít kanál chatu relace","Služba chatu je momentálně odpojená. Zkuste to prosím znovu za chvíli.","Aktualizujte si prosím doprovodné rozšíření Live Share Chat. Nainstalovaná verze už není kompatibilní. [Další informace](https://aka.ms/vsls-chat)","Co chcete provést?","$(x) Odpojit","Odpojit z audiohovoru","$(mute) Ztlumit mikrofon","$(unmute) Zrušit ztlumení","Ztlumte mikrofon, aby vás ostatní neslyšeli.","Zrušte ztlumení mikrofonu, aby vás ostatní slyšeli.","$(organization) Zobrazit účastníky","Zobrazení seznamu účastníků Live Share, kteří jsou aktuálně v hovoru","$(unmute) Nakonfigurovat reproduktory","Vyberte reproduktory, které se mají použít pro audiohovor.","$(megaphone) Nakonfigurovat mikrofon","Vyberte mikrofon, který se má použít pro audiohovor.","Účastníci (0)","Připojit se k audiohovoru…","Zahájit audiohovor…","Připojuje se audiohovor…","Zahajuje se audiohovor…","Ukončuje se audiohovor…","Audiohovor","Účastníci audiohovoru ($(participantCount))","Neznámý uživatel","$(displayName) (vy)","Připojit se","Připojuje se zvuk…","Odpojuje se zvuk…","Účastníci audiohovoru","Vyberte mikrofon, který se má použít.","Vyberte reproduktor, který se má použít.","Pro tuto relaci spolupráce se zahájil audiohovor.","Sada výsledků obsahuje jenom podmnožinu všech shod. Zadejte prosím konkrétnější hledání, aby se počet výsledků snížil.","[Nové]","Hostitel s vámi sdílí server $(sessionName). Chcete si ho zobrazit v prohlížeči?","Ano","Ne","Server $(sessionName) se nedá otevřít v prohlížeči. Hostitel zrušil jeho sdílení.","Pracovní prostor Live Share","Hostitel má poznámkový blok otevřený v","K otevření použijte stejné zobrazení.","Společné úpravy se pro poznámkové bloky otevřené v zobrazeních, která nejsou sdílená, nepodporují.","Jádro pro spuštění buněk na počítači hostitele","Hostitel vám udělil oprávnění spouštět buňky poznámkového bloku.","Hostitel odmítl váš požadavek na spuštění buněk poznámkového bloku.","V relaci určené jen pro čtení nemůžete spouštět buňky poznámkového bloku.","Hostitel vám neudělil oprávnění spustit buňky poznámkového bloku.","Požádat o přístup","Povolit pro tuto relaci","Vždy povolit","Odmítnout","Host žádá o oprávnění spouštět buňky poznámkového bloku.","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Váš pracovní prostor se nasdílel, ale nejméně jedna složka nebyla místní a nešlo ji zahrnout do sdíleného pracovního prostoru.","Nejde se připojit k Azure Relay, můžete spolupracovat jenom s hosty ve stejné síti. Ověřte prosím, jestli síťová brána firewall nebo DNS nebo proxy neblokuje přístup k Microsoft Azure Relay a zkuste to znovu."],"src/_new_/decorators/gaNotificationCommandDecorator":["Rozšíření Live Share je teď obecně dostupné (GA) a rádi bychom vám poděkovali, že jste nám s tím pomohli! Jako účastník programu Insider budete nadále dostávat nové funkce jako první.","Další informace","Přepnout na stabilní funkce"],"src/_new_/util/WorkspaceFirewallUtil":["Nejde nic sdílet. Visual Studio Live Share je aktuálně v režimu přímého připojení a brána firewall zablokovala příchozí zabezpečená připojení nezbytná ke spuštění relace spolupráce.\r\n\r\nPokud chcete něco sdílet, bude potřeba upravit pravidla brány firewall tak, aby program vsls-agent.exe mohl přijímat příchozí připojení, nebo přepnout na režim automatického nebo přenosového připojení.","Brána firewall blokuje programu vsls-agent.exe možnost přijímat přímá připojení na portech, které Visual Studio Live Share vyžaduje za účelem zvýšení výkonu pro spolupracovníky ve stejné síti.\r\n\r\nLive Share se teď přepne do režimu přenosového připojení pro všechny budoucí relace a provoz bude směrovat přes cloudový přenos. Stisknutím Zrušit místo toho zastavíte sdílení.","Visual Studio Live Share je aktuálně v režimu přímého připojení, a aby fungovalo, musí přijímat příchozí zabezpečená připojení při sdílení.\r\n\r\nBrána firewall vás teď vyzve, abyste programu vsls-agent.exe udělili přístup k požadovaným portům. Pokud přístup odepřete, nebudete moct nic sdílet.","Visual Studio Live Share je aktuálně v režimu automatického připojení, který zlepšuje výkon pro spolupracovníky ve stejné síti díky tomu, že přijímá příchozí zabezpečená připojení při sdílení.\r\n\r\nBrána firewall vás teď vyzve, abyste programu vsls-agent.exe udělili přístup k požadovaným portům. V případě odepření tohoto přístupu se všechna připojení místo toho přesměrují přes cloudový přenos."],"src/abstractions/node/agent":[]}