{"src/commands":["修復","破損しているダウンロードがあるため、VS Live Share の更新またはインストールが失敗しました。","破損しているダウンロードがあるため、VS Live Share の更新またはインストールが失敗しました。","Live Share のインストールで問題が発生していますか?","$(messagePrefix) ネットワークに接続していることを確認してから、[修復] をクリックし、VS Code を再起動して回復をお試しください。","再試行","ファイルが使用中のため、修復を完了できません。すべての Visual Studio Live Share エージェント (${processName}) プロセスを終了してから `再試行` をクリックしてください。","ホストが現在のコラボレーション セッションを終了しました。開いているフォルダーとエディターは閉じます。","コラボレーション セッションの有効期限が切れました。サインインして、もう一度お試しください。","コラボレーション セッションから削除されました。","コラボレーション セッションからブロックされました。","コラボレーション セッションから切断されました。接続に問題があるか、ホストがオフラインになりました。","コラボレーション セッションは、内部エラーのため終了しました。","コラボレーション セッションの有効期限が切れました。サインインして、もう一度お試しください。","ネットワークがオフラインになったため、コラボレーション セッションが終了しました。ネットワークの状態を確認してください。","このセッションの Azure クラウド リレーがオフラインになったため、新しいゲストがリレー経由で正常に参加できない可能性があります。再共有を検討してください。","このセッションの Azure クラウド リレーがオフラインになったため、新しいゲストがリレー経由で正常に参加できない可能性があります。再共有を検討してください。","コラボレーション セッションは、内部エラーのため終了しました。"],"src/extension":[],"src/localizeCallback":["他のコラボレーターとの間で何を行いたいですか?","他のユーザーを招待する (リンクのコピー)","招待リンクをコピーして、他の参加者に送信できるようにします。","参加者へフォロー依頼","他の参加者にフォローを要求します。","読み取り専用ターミナルの共有","ターミナルの共有","すべての参加者が使用する新しいターミナル/コマンド プロンプトを開始します。","共有サーバー","すべての参加者にローカル TCP ポートを公開します。","共有サーバーの表示","コラボレーション参加者と共有されたローカル TCP サーバーを表示します。","サーバー共有の停止","すべての参加者のローカル TCP ポートの共有を停止します。","コラボレーション セッションの停止","コラボレーション セッションを停止し、すべてのコンテンツの共有を停止して、すべての参加者のアクセスを削除します。","GitHub または Microsoft アカウントでサインインして、読み取り/書き込みアクセスを取得します。","共有デバッグ セッションにアタッチする","ホストが参加者と共有しているデバッグ セッションにデバッガーをアタッチします。","共有ターミナルにアクセスする","ホストが参加者と共有しているターミナルを開きます。","共有サーバーへのアクセス","名前付きの共有 TCP ポートをコピーして使用する","コラボレーション セッションから退席する","このコラボレーション セッションへの参加を中止します。","実行する操作を選択してください","コラボレーション セッションの開始","コラボレーション セッションを開始して、コンテンツを共有し、参加者を招待します。","読み取り専用コラボレーション セッションを開始する...","コラボレーション セッションを開始して、コンテンツを共有し、参加者を招待します。","コラボレーション セッションに参加する","コラボレーション セッションに参加して、共有コンテンツにアクセスします。","もう一度コピーする","リンクをコピーする","読み取り/書き込みにする","読み取り専用にする","共有の開始","ヘルプ","OK","サインイン","匿名で続行する","詳細情報","今後は表示しない","この招待リンクの有効期限が切れました。新しいリンクを生成するには、もう一度共有してください。","サーバーに接続できませんでした。インターネットに接続していることを確認してください。","$(shortName) サービスには、インストールされている拡張機能よりも新しいバージョンの拡張機能が必要です。","インストールされている拡張機能には、新しいバージョンの $(shortName) サービスが必要です。","インストールされている $(shortName) 拡張機能が古すぎるため、このコラボレーション セッションに接続できません。","コラボレーション セッション ホストは、お使いの $(shortName) 拡張機能より古いバージョン上にあります。","拡張機能よりも新しい $(shortName) エージェントです","その拡張機能より古い $(shortName) エージェントです","適切な IP アドレスがないため \"ダイレクト\" モードで共有できません。\"自動\" モードまたは \"リレー\" モードに切り替えて、もう一度お試しください。","互換性のある接続アドレスが見つかりませんでした。\"Auto\" モードに切り替えて、もう一度お試しください。","ホストに接続できません。あなたとホストの両方がオンラインであることを確認してください。","\"Relay\" モードではホストに接続できません。自分とホストがオンラインであることをご確認ください。オンラインである場合は、\"Auto\" または \"Direct\" モードに切り替えて、もう一度お試しください。","\"Direct\" モードではホストに接続できません。自分とホストがオンラインであることをご確認ください。オンラインである場合は、\"Auto\" または \"Relay\" モードに切り替えて、もう一度お試しください。","プロトコル エラーのためホストに参加できません。自分とホストがオンラインであることと、最新バージョンの $(shortName) を使用していることを確認してください。","認証エラーが原因で、ホストに参加できません。ホストがオンラインであることを確認してから、サインアウトした後にもう一度サインインして、もう一度お試しください。","認証エラーが原因で、ホストに参加できません。ホストがオンラインであることを確認してから、サインアウトした後にもう一度サインインして、もう一度お試しください。","予期しない認証エラーです。もう一度サインインしてみてください。","トークンの交換がコード ${code} で失敗しました","ホストはダイレクト接続を許可していません。\"Auto\" または \"Relay\" モードに切り替えて、もう一度お試しください。","ホストがリレー接続を許可していないため、接続できません。\"Auto\" または \"Direct\" モードに切り替えて、もう一度お試しください。","最大 5 人の参加者に既に達しているため、コラボレーション セッションに参加できませんでした。参加者の制限を引き上げるには、[ゲスト制限の増加] の設定を変更するようにホストに依頼し、再読み込みしてから、新しいコラボレーション セッションを開始してください。","ホストによって、コラボレーション セッションへの参加が拒否されました。","ホストが要求に応答するのを待機中にタイムアウトしました。","コラボレーション セッションへの参加要求が取り消されました。","コラボレーション セッションが見つかりません。","ホストにより、コラボレーション セッションへの参加がブロックされました。誤ってブロックされた場合は、ホストにセッションを再起動するようご依頼ください。","サーバーに接続できませんでした。失敗の状態コードを受信しました。","Live Share がログイン キーチェーンにアクセスできませんでした。これは、最近パスワードを変更したか、ログイン キーチェーンが破損している場合に生じることがあります。修正方法の詳細をご覧ください。","ホストのネットワーク状態が低下しているか、ホストが Live Share クラウド リレーに接続していません。ネットワーク状態を確認するよう依頼して、コラボレーション セッションを再開し、もう一度お試しください。","Live Share クラウド リレーに接続できません。プロキシ、ファイアウォール、ネットワークの設定を確認して、もう一度お試しください。","ホストはデバッガーの開始を許可していません。必要な場合は、有効にするよう依頼してください。","サーバーに接続できませんでした。HTTPS 接続に失敗しました。Live Share をブロックしている自己署名証明書またはカスタム証明書の検証ポリシーがないことをご確認ください。","計画セッションを作成できませんでした","計画セッションを削除できませんでした","計画セッションの名前を変更できませんでした","計画セッション リンクをコピーできませんでした","計画セッションに参加できませんでした","大文字と小文字の区別を除いて同じ名前のファイルを含むディレクトリがあるようです。これは現在サポートされていないため、エラーが発生するおそれがあります。","VS Code をアプリケーション フォルダーの外部で実行しているため、ブラウザー リンクを使用してセッションに参加するためのサポートをインストールできません。手動でセッションに参加することはできます。","ブラウザー リンクを使用してセッションに参加するためのサポートをインストールできませんでした。手動でセッションに参加することはできます。","リモート セッションを開いています...","リモート セッションに参加しています...","ホストの承認を待機しています...","接続が失われました。ホストに再接続しています...","計画セッションを作成しています...","計画セッションを削除しています...","パスが見つかりません: lazyLoad(() => nlsloc($(path)","パスが既に存在します: lazyLoad(() => nlsloc($(path)","アクセスが拒否されました: lazyLoad(() => nlsloc($(path)","ファイルが大きすぎます。","ファイルが使用できません。","コラボレーション セッションへの参加を要求しました。","承認","読み取り専用を許可","読み取り/書き込みを許可","拒否","匿名を常に受け入れる","コラボレーション セッションに参加しました。","切断されました。","コラボレーション セッションから退席しました。","$(userId) がフォーカスを設定しました。","$(userId) がフォローするよう要求しました。","セッション リンクがコピーされました。","共同編集情報がクリップボードにコピーされました。","ブラウザー リンクを使用したセッションへの参加をサポートするには、システムでインストーラーを実行するためのアクセス許可が必要です。OS によっては、ターミナルで管理者 (sudo) パスワードの入力を求められる場合があります。今すぐインストールしますか?","ブラウザー リンク ランチャーのインストール コマンドがクリップボードにコピーされました。","\"Live Share: Launcher Setup\" コマンドを実行して、後で統合を完了することができます。","ブラウザー リンク ランチャーが正常にインストールされました。","代わりにコピーする","インストール","招待リンクがクリップボードにコピーされました! 信頼できるすべてのユーザーに送信します","セッションを共有しました! 招待リンクを取得するには [リンクのコピー] をクリックします ","または、セキュリティで保護された共有の詳細については、[詳細情報] をクリックしてください。","再利用可能なセッション リンクがクリップボードにコピーされました。安全な場所へのリンクを保存します。セッションの使用方法に関する詳細については、\"詳細情報\" をクリックします。","再利用可能なセッション リンクが作成されました。\"リンクのコピー\" をクリックしてリンクを取得します。安全な場所へのリンクを保存します。セッションの使用方法に関する詳細については、\"詳細情報\" をクリックします。","コラボレーションセッションに参加するには、VS Live Share でサインインしてください。","コラボレーション セッションに参加する前に、サインインする必要があります。","$(options.title)","読み取り専用モード (匿名) でターミナルを編集することはできません。サインインして続行します。","計画セッションの選択","期限: ","計画セッションを作成...","計画セッションを作成します","計画セッションの名前を指定します","名前を空にすることはできません。セッションの名前を英数字で入力してください","名前が無効です。セッションの名前を英数字で入力してください"," (読み取り専用)"," (匿名および読み取り専用)"," (匿名および読み取り/書き込み)"," (匿名)","Live Share セッション","入力して連絡先を検索します","使用する対応プロバイダーを選択します","招待された","招待された","招待された","コラボレーション セッションの開始..."," (読み取り専用)"," (匿名および読み取り専用)"," (匿名および読み取り/書き込み)","読み取り専用ユーザー","以下として続行","読み取り専用のゲストとしてサインインせずに続行する","サインインするためのアカウントを選択してください","${key} アカウントを使用してサインインする","コメント スレッドを作成できません","コメント スレッドを削除できません","返信できません","コメントを編集できません","コメントを保存できません","コメントの編集を取り消すことができません","コメントを削除できません","最初にスレッドの他のコメントを削除します","Live Share セッションのコメント","参加者:","Live Share チャット: 新規 $(unreads) 件","チャット","セッション チャット","Live Share チャット","チャット チャネルの選択","(新規 $(unread) 件)","$(username) が入力しています...","_が Live Share セッションを開始しました_","_が Live Share セッションを終了しました_","_が Live Share セッションに参加しました_","_が Live Share セッションから退席しました_","このコラボレーション セッションのホストは現在チャットから切断されているか、この機能をサポートしていないバージョンの _Live Share_ を使用しています。[詳細情報](https://aka.ms/vsls-chat)","接続しようとしている相手は現在応対できないか、この機能をサポートしていないバージョンの _Live Share_ を使用しています。[詳細情報](https://aka.ms/vsls-chat)","不明なユーザー","この連絡先とのチャット","セッション チャット チャネルを開く","チャット サービスは現在切断されています。しばらくしてからもう一度お試しください。","\"Live Share チャット\" コンパニオン拡張機能を更新してください。インストールされているバージョンとの互換性がなくなりました。[詳細情報](https://aka.ms/vsls-chat)","実行する操作を選択してください","$(x) 切断","音声通話から切断します。","$(mute) 自分をミュートする","$(unmute) 自分自身のミュート解除","自分をミュートして、他のユーザーに音声が聞こえないようにします。","他のユーザーが音声を聞くことができるように、マイクをミュート解除します。","$(organization) 参加者の表示","現在通話中の Live Share 参加者の一覧を表示します。","$(unmute) スピーカーの構成","音声通話に使用するスピーカーを選択します。","$(megaphone) マイクの構成","音声通話に使用するマイクを選択します。","参加者 (0)","音声通話に参加する...","音声通話を開始...","音声通話に参加しています","音声通話を開始しています...","音声通話を終了しています...","音声通話","音声通話参加者 ($(participantCount))","不明なユーザー","$(displayName) (you)","参加する","オーディオを接続しています...","オーディオを切断しています...","音声通話の参加者","使用するマイクを選択する","使用するスピーカーを選択します","このコラボレーション セッションで音声通話が開始されました。","結果セットには、すべての一致の内のサブセットのみが含まれています。より具体的な検索条件を指定して、結果を絞り込んでください。","[新規]","ホストがサーバー $(sessionName) を共有しました。ブラウザーで表示しますか?","はい","いいえ","ブラウザーでサーバー $(sessionName) を開くことができません。ホストによってサーバーの共有が解除されました","Live Share ワークスペース","ホストは、次を使用してノートブックを開いています","同じビューを使用して開きます","非共有ビューで開いているノートブックでは、共同編集はサポートされていません。","ホストのマシン上でセルを実行するためのカーネル","ホストによって、ノートブック セルを実行するためのアクセス権が付与されました","ホストによって、ノートブック セルの実行要求が拒否されました","読み取り専用セッションでノートブック セルを実行することはできません","ホストがノートブック セルを実行するためのアクセス許可を付与していません","アクセス権を要求する","このセッションに対して許可する","常に許可する","拒否","ゲストがノートブック セルを実行するためのアクセス許可を要求しています","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["ワークスペースは共有されましたが、1 つまたは複数のフォルダーがローカル フォルダーではないため、共有ワークスペースに含めることができませんでした。","Azure Relay に接続できません。同じネットワーク上のゲストとのみ共同作業できます。ネットワーク ファイアウォール、DNS、またはプロキシが Microsoft Azure Relay へのアクセスをブロックしていないことを確認して、もう一度お試しください。"],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share が GA になりました。ご協力いただき、ありがとうございました。インサイダーとして、引き続き新機能を最初にご利用いただけます。","詳細","安定した機能に切り替える"],"src/_new_/util/WorkspaceFirewallUtil":["共有できません。現在 Visual Studio Live Share は \"ダイレクト\" 接続モードで、コラボレーション セッションを開始するために必要なセキュリティで保護された着信接続がファイアウォールによってブロックされました。\r\n\r\n共有するには、ファイアウォール規則を変更し、vsls-agent.exe が着信接続を許可するか、\"自動\" または \"リレー\" 接続モードに切り替える必要があります。","ご使用のファイアウォールは、同じネットワーク上のコラボレーターのパフォーマンスを向上させるために Visual Studio Live Share が必要とする直接接続を vsls-agent.exe がポート上で受け入れないようブロックしています。\r\n\r\nLive Share は今後すべての接続を \" Relay\" 接続モードに切り替えて、トラフィックをクラウド リレー経由でルーティングします。その代わりに共有を停止するには、[キャンセル] を押してください","Live Share は現在 \"Direct\" 接続モードです。このモードが機能するためには、共有時、セキュリティで保護された受信接続を承諾する必要があります。\r\n\r\n必要なポートへのアクセスを vsls-agent.exe に許可するよう求めるメッセージがファイアウォールから表示されます。アクセスを拒否すると、共有できなくなります","Visual Studio Live Share は現在 \"自動\" 接続モードです。このモードの場合、共有時にセキュリティで保護された受信接続を受け入れることにより、同じネットワークにおけるコラボレーターのパフォーマンスが向上します。 \r\n\r\nファイアウォールによって、必要なポートに対するアクセスを vsls-agent.exe に許可するよう求めるメッセージが表示されます。このアクセスを拒否すると、すべての接続は代わりにクラウド リレー経由でルーティングされます。"],"src/abstractions/node/agent":[]}