{"src/commands":["Reparar","Error de actualización o instalación de VS Live Share debido a una descarga incorrecta.","Error de actualización o instalación de VS Live Share debido a una descarga incorrecta.","¿Tiene problemas con la instalación de Live Share?","$(messagePrefix) Asegúrese de que tiene conectividad de red y, a continuación, haga clic en \"Reparar\" para reiniciar VS Code e intentar la recuperación.","Reintentar","No se puede finalizar la reparación porque hay archivos en uso. Finalice todos los procesos del agente de Visual Studio Live Share (${processName}) y haga clic en \"Reintentar\".","El anfitrión ha finalizado la sesión de colaboración actual. Las carpetas y los editores abiertos se cerrarán.","La sesión de colaboración ha expirado. Inicie sesión y vuelva a intentarlo.","Se le ha eliminado de la sesión de colaboración.","Has sido bloqueado de la sesión de colaboración.","Se le ha desconectado de la sesión de colaboración debido a un problema de conectividad o a que el anfitrión se ha desconectado.","La sesión de colaboración ha terminado debido a un error interno.","La sesión de colaboración ha expirado. Inicie sesión y vuelva a intentarlo.","La sesión de colaboración ha finalizado porque la red se ha quedado sin conexión. Compruebe el estado de la red.","La retransmisión a través de la nube de Azure se ha quedado sin conexión en esta sesión y es posible que no puedan unirse nuevos invitados mediante retransmisión. Considere la posibilidad de volver a compartir.","La retransmisión a través de la nube de Azure se ha quedado sin conexión en esta sesión y es posible que no puedan unirse nuevos invitados mediante retransmisión. Considere la posibilidad de volver a compartir.","La sesión de colaboración ha terminado debido a un error interno."],"src/extension":[],"src/localizeCallback":["¿Qué le gustaría hacer con otros colaboradores?","Invitar a otros (copiar vínculo)","Copiar el vínculo de invitación para poder enviarlo a otros participantes.","Atraer la atención de los participantes","Solicite a otros participantes que le sigan.","Compartir terminal de solo lectura","Compartir terminal","Iniciar un nuevo terminal o símbolo del sistema para que lo usen todos los participantes.","Compartir servidor","Exponer un puerto TCP local a todos los participantes.","Mostrar servidores compartidos","Muestra los servidores TCP locales compartidos con los participantes de colaboración.","Dejar de compartir servidor","Dejar de compartir un puerto TCP local para todos los participantes.","Detener la sesión de colaboración","Detenga la sesión de colaboración, deje de compartir todo el contenido y quite el acceso de todos los participantes.","Inicie sesión con su cuenta de GitHub o Microsoft para obtener acceso de lectura y escritura.","Adjuntar a una sesión de depuración compartida","Asociar el depurador a una sesión de depuración que el anfitrión haya compartido con los participantes.","Acceso al terminal compartido","Abrir el terminal que el host ha compartido con los participantes.","Acceso al servidor compartido","Copiar un puerto TCP compartido y con nombre para su uso","Abandonar la sesión de colaboración","Dejar de participar en esta sesión de colaboración.","¿Qué desea hacer?","Iniciar sesión de colaboración","Iniciar una sesión de colaboración para compartir contenido e invitar a participantes.","Iniciar una sesión de colaboración de solo lectura","Iniciar una sesión de colaboración de solo lectura para compartir contenido e invitar a participantes.","Unirse a la sesión de colaboración","Unirse a una sesión de colaboración para acceder al contenido compartido.","Copiar de nuevo","Copiar vínculo","Hacer lectura y escritura","Hacer de solo lectura","Iniciar uso compartido","Ayuda","Aceptar","Iniciar sesión","Continuar como anónimo","Más información","No volver a mostrar","Este vínculo de invitación ha expirado. Compartir de nunevo para generar un nuevo vínculo.","No se pudo conectar con el servidor. Compruebe que está conectado a Internet.","El servicio de $(shortName) requiere una versión más reciente de la extensión que ha instalado.","La extensión que ha instalado requiere una versión más reciente del servicio $(shortName).","La extensión de $(shortName) que ha instalado es demasiado antigua para conectarse a esta sesión de colaboración.","El host de la sesión de colaboración se encuentra en una versión de la extensión $(shortName) anterior a la suya.","El agente $(shortName) es más reciente que la extensión","El agente $(shortName) es más antiguo que la extensión","No se puede compartir en modo \"Directo\" ya que hay no hay direcciones IP adecuadas. Cambie al modo \"Auto\" o \"Retransmisión\" y vuelva a intentarlo.","No se encuentra ninguna dirección de conexión compatible. Cambie al modo \"Automático\" y vuelva a intentarlo.","No se puede conectar con el anfitrión. Compruebe que tanto usted como el anfitrión están en línea.","No se puede conectar con el anfitrión en modo \"Relay\". Compruebe que tanto usted como el anfitrión están en línea. Si es así, cambie al modo \"Auto\" o \"Direct\" y vuelva a intentarlo.","No se puede conectar con el anfitrión en modo \"Direct\". Compruebe que tanto usted como el anfitrión están en línea. Si es así, cambie al modo \"Auto\" o \"Relay\" y vuelva a intentarlo.","No se puede unir al anfitrión debido a un error del protocolo. Compruebe que usted y el anfitrión estén en línea y que usan la versión más reciente de $(shortName).","No se puede unir al anfitrión debido a un error de autenticación. Compruebe que el anfitrión está en línea y, después, cierre la sesión, vuelva a iniciarla y reintente el proceso.","No se puede unir al anfitrión debido a un error de autenticación. Compruebe que el anfitrión está en línea y, después, cierre la sesión, vuelva a iniciarla y reintente el proceso.","Error de autenticación inesperado. Pruebe a iniciar sesión de nuevo.","Error de intercambio de tokens con código: ${code}","El anfitrión no permite las conexiones directas. Cambie al modo \"Auto\" o \"Relay\" y vuelva a intentarlo.","No se puede conectar porque el anfitrión no permite las conexiones retransmitidas. Cambie al modo \"Direct\" o \"Auto\" y vuelva a intentarlo.","No se pudo unir a la sesión de colaboración porque ya se ha alcanzado el máximo de 5 participantes. Para aumentar el límite de participantes, pida al anfitrión que cambie el valor del Límite de invitados incrementado, vuelva a cargar y, a continuación, inicie una nueva sesión de colaboración.","El anfitrión ha rechazado su unión a la sesión de colaboración.","Se agotó el tiempo de espera de respuesta del anfitrión a la solicitud.","La solicitud para unirse a la sesión de colaboración se ha cancelado.","No se encontró la sesión de colaboración.","El host ha impedido que se una a la colaboración. Si la decisión ha sido accidental, pida al host que reinicie la sesión.","No se pudo conectar al servidor. Se ha recibido un código de estado con error.","Live Share no pudo acceder al llavero de inicio de sesión. Esto puede suceder si recientemente cambió su contraseña o su llavero de inicio de sesión se ha dañado. Vea más información para obtener detalles sobre cómo solucionarlo.","Las condiciones de la red del host son deficientes o ya no está conectado a la retransmisión a través de la nube de Live Share. Pida que compruebe las condiciones de red, reinicie la sesión de colaboración y vuelva a intentarlo.","No se puede conectar a la retransmisión a través de la nube de Live Share. Compruebe la configuración del proxy, el firewall y la red y vuelva a intentarlo.","El anfitrión no permite iniciar el depurador. Si es necesario, pida que lo habiliten.","No se pudo conectar con el servidor. Error en la conexión HTTPS; compruebe que no hay certificados autofirmados ni directivas de validación de certificados personalizados que bloquean Live Share.","No se pudo crear una sesión planeada.","No se pudo eliminar una sesión planeada.","No se pudo cambiar el nombre de la sesión planeada.","No se pudo copiar el vínculo de la sesión planeada.","No se pudo unir a las sesiones planeadas","Parece que tiene un directorio de archivos con el mismo nombre, salvo por el uso de mayúsculas y minúsculas. Esta acción no se admite y puede generar errores.","Está ejecutando VS Code fuera de la carpeta Aplicaciones, por lo que no se puede instalar compatibilidad para unirse a sesiones mediante un vínculo del explorador. Todavía puede unirse a las sesiones manualmente.","No se pudo instalar la compatibilidad para unirse a sesiones mediante un vínculo del explorador. Todavía puede unirse a las sesiones manualmente.","Apertura de sesión remota...","Unirse a sesión remota...","Esperando aprobación del anfitrión...","Se perdió la conexión. Reconectando con el host...","Creando la sesión planeada...","Eliminando la sesión planeada...","No se encontró la ruta de acceso: lazyLoad(() => nlsloc($(path)","La ruta de acceso ya existe: lazyLoad(() => nlsloc($(path)","Acceso denegado: lazyLoad(() => nlsloc($(path)","El archivo es demasiado grande.","El archivo no está disponible.","pidió unirse a la sesión de colaboración.","Aceptar","Aceptar solo lectura","Aceptar lectura y escritura","Rechazar","Aceptar siempre anónimos","se unió a la sesión de colaboración."," se desconectó."," dejó la sesión de colaboración.","$(userId) ha centrado su atención.","$(userId) han solicitado que les siga.","El vínculo de la sesión se ha copiado.","La información de edición conjunta se ha copiado en el Portapapeles.","Para poder entrar en una sesión mediante un enlace del navegador, necesitamos permiso para ejecutar un instalador en su sistema. Su sistema operativo puede pedirle su contraseña de administrador (sudo) en un terminal. ¿Instalar ahora?","Comando de instalación del iniciador de vínculos del explorador copiado en el Portapapeles.","Puede ejecutar el comando \"Live Share: Instalación del iniciador\" para completar la integración más adelante.","El iniciador de vínculos del explorador se instaló correctamente.","Copiar en su lugar","Instalar","Vínculo de invitación copiado en el portapapeles. Envíelo a cualquier persona de confianza","Sesión compartida. Hacer clic en \"Copiar vínculo\" para obtener un vínculo de invitación","o haga clic en \"Más información\" para obtener información sobre el uso compartido seguro.","Se ha copiado un vínculo de sesión reutilizable en el portapapeles. Guarde el vínculo en una ubicación segura. Para obtener más información sobre cómo usar la sesión, haga clic en \"Más información\".","Se ha creado un vínculo de sesión reutilizable en el portapapeles. Haga clic en \"Copiar vínculo\" para obtener el vínculo. Guarde el vínculo en una ubicación segura. Para más información sobre cómo usar la sesión, haga clic en \"Más información\".","Iniciar sesión con VS Live Share para unirse a una sesión de colaboración.","Debe iniciar sesión antes de unirse a la sesión de colaboración.","$(options.title)","No se puede editar el terminal en modo de solo lectura (anónimo). Inicie sesión para continuar.","Seleccionar una sesión planeada","Expiración: ","Crear una sesión planeada...","Crear una sesión planeada","Especificar el nombre de la sesión planeada","El nombre no puede estar vacío. Escriba un nombre alfanumérico para la sesión.","El nombre no es válido. Escriba un nombre alfanumérico para la sesión."," (Solo lectura)"," (Anónimo y solo lectura)"," (Anónimo, lectura y escritura)"," (Anónimo)","En una sesión de Live Share","Escribir para buscar contactos","Seleccione el proveedor de presencia que debe utilizarse","Invitado","Invitado","Invitado","Iniciar la sesión de colaboración..."," (Solo lectura)"," (Anónimo y solo lectura)"," (Anónimo, lectura y escritura)","Usuario de solo lectura","Continuar como","Continuar sin iniciar sesión como invitado de solo lectura","Seleccione una cuenta para iniciar sesión","Iniciar sesión con la cuenta de ${key}","No se puede crear el hilo de comentarios","No se puede eliminar el hilo de comentarios","No se puede responder","No se puede editar el comentario.","No se puede guardar el comentario.","No se puede cancelar la edición del comentario.","No se puede eliminar el comentario","eliminar primero otros comentarios del hilo","Comentarios de la sesión de Live Share","Participantes:","Chat de Live Share: $(unreads) nuevos","Chat","Chat de la sesión","Chat de Live Share","Seleccionar un canal de chat","($(unread) nuevo)","$(username) está escribiendo...","_ha iniciado la sesión de Live Share_","_ha finalizado la sesión de Live Share_","_se ha unido a la sesión de Live Share_","_ha abandonado la sesión de Live Share_","El host de esta sesión de colaboración está usando una versión de _Live Share_ que no admite esta característica o está desconectado del chat. [Más información](https://aka.ms/vsls-chat)","La persona con la que intenta contactar está usando una versión de _Live Share_ que no admite esta característica o no está disponible. [Más información](https://aka.ms/vsls-chat)","Usuario desconocido","Chat con este contacto","Abrir sesión de canal de chat","El servicio de chat está desconectado. Vuelva a intentarlo en breve.","Actualice la extensión complementaria \"Live Share Chat\". La versión instalada ya no es compatible. [Más información](https://aka.ms/vsls-chat)","¿Qué desea hacer?","$(x) Desconectar","Desconectarse de la llamada de audio.","$(silenciar) Silenciarse a uno mismo","$(reactivar audio) Reactivar audio personalmente","Silénciese para que otros usuarios no puedan oírle.","Reactive el micrófono para que otros usuarios puedan oírte.","$(organización) Ver participantes","Ver la lista de participantes de Live Share que están actualmente en la llamada.","$(reactivar audio) Configurar altavoces","Seleccionar los altavoces que se usarán para la llamada de audio.","$(megaphone) Configurar micrófono","Seleccionar el micrófono que se usará para la llamada de audio.","Participantes (0)","Unirse a la llamada de audio...","Iniciar llamada de audio...","Uniéndose a la llamada de audio...","Iniciando la llamada de audio...","Finalizando llamada de audio...","Llamada de audio","Participantes de la llamada de audio ($(participantCount))","Usuario desconocido","$(displayName) (usted)","Unirse","Conectando audio...","Desconectando audio...","Participantes de la llamada de audio","Seleccionar el micrófono que se va a usar","Seleccionar el altavoz que se va a usar","Se ha iniciado una llamada de audio para esta sesión de colaboración.","El conjunto de resultados solo contiene un subconjunto de todas las coincidencias. Sea más específico en la búsqueda para acotar los resultados.","[Nuevo]","El host ha compartido un servidor $(sessionName) con usted. ¿Quiere verlo en el explorador?","Sí","No","No se puede abrir el servidor $(sessionName) en el explorador. El host ha dejado de compartir el servidor.","Área de trabajo de Live Share","El host tiene el bloc de notas abierto con","Usar la misma vista para abrir","No se admite la edición conjunta para los blocs de notas abiertos con vistas no compartidas.","Kernel para ejecutar celdas en la máquina del host","El host le ha concedido acceso para ejecutar celdas del bloc de notas.","El host ha rechazado la solicitud para ejecutar celdas del bloc de notas.","No se pueden ejecutar celdas del bloc de notas en una sesión de solo lectura.","El host no le ha concedido permiso para ejecutar celdas del bloc de notas.","Solicitar acceso","Permitir para esta sesión","Permitir siempre","Rechazar","Un invitado está solicitando permiso para ejecutar celdas del bloc de notas.","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Su área de trabajo se compartió, pero una o más carpetas no eran carpetas locales y no se pudieron incluir en el área de trabajo compartida.","No se puede conectar con Azure Relay, solo puede colaborar con invitados que estén en la misma red. Compruebe que el firewall de red, DNS o proxy no bloquea el acceso a Microsoft Azure Relay y vuelva a intentarlo."],"src/_new_/decorators/gaNotificationCommandDecorator":["LIve Share está ahora disponible con carácter general y queremos agradecerle su ayuda para llegar hasta aquí. Como participante, en primer lugar, seguirá recibiendo nuevas características.","Más información","Cambiar a características estables"],"src/_new_/util/WorkspaceFirewallUtil":["No se puede compartir. Visual Studio Live Share se encuentra actualmente en el modo de conexión \"Directa\" y su firewall ha bloqueado las conexiones seguras entrantes necesarias para iniciar una sesión de colaboración.\r\n\r\nPara compartir, deberá modificar las reglas de su firewall para permitir que vsls-agent.exe acepte conexiones entrantes o cambie al modo de conexión \"Automático\" o \"Retransmisión\".","El firewall está impidiendo que vsls-agent.exe acepte conexiones directas en los puertos que necesita Visual Studio Live Share para mejorar el rendimiento de la colaboración en la misma red.\r\n\r\nLive Share cambiará ahora al modo de conexión \"\"Retransmisión\"\" en todas las futuras sesiones y enrutará el tráfico mediante una retransmisión a través de la nube. Presione \"\"Cancelar\"\" para dejar de compartir","Visual Studio Live Share está actualmente en modo de conexión directa y debe aceptar conexiones protegidas entrantes al compartir para que funcione.\r\n\r\nEl firewall le pedirá ahora que ofrezca acceso a give vsls-agent.exe a los puertos requeridos. Si deniega el acceso, no podrá compartir.","Visual Studio Live Share se encuentra actualmente en el modo de conexión \"Automático\" que mejora el rendimiento de los colaboradores en la misma red al aceptar conexiones seguras entrantes al compartir.\r\n\r\nAhora su firewall le solicitará que otorgue a vsls-agent.exe acceso a los puertos requeridos. La denegación de este acceso enrutará todas las conexiones mediante una retransmisión a través de la nube."],"src/abstractions/node/agent":[]}