{"src/commands":["Reparera","En uppdatering eller installation av VS Live Share misslyckades på grund av en skadad nedladdning.","En uppdatering eller installation av VS Live Share misslyckades på grund av en skadad nedladdning.","Har du problem med Live Share-installationen?","$(messagePrefix) Kontrollera att du har nätverksanslutning och klicka \"Reparera\" för att starta om VS Code och försök återställning.","Försök igen","Det går inte att slutföra reparationen eftersom filerna används. Avsluta alla Visual Studio Live Share-agentprocesser (${processName}) och klicka på \"Försök igen\"","Värden har avslutat den nuvarande samarbetssessionen. Öppna mappar och redigerare kommer nu att vara närmare.","Samarbetssessionen har gått ut. Logga in och försök igen.","Du har tagits bort från samarbetssessionen.","Du har blockerats från samarbetssessionen.","Du har kopplats bort från samarbetssessionen på grund av ett anslutningsproblem eller värden som har gått offline.","Samarbetssessionen har avslutats på grund av ett internt fel.","Samarbetssessionen har gått ut. Logga in och försök igen.","Samarbetssessionen har avslutats på grund av att nätverket är offline. Kontrollera din nätverksstatus.","Azure Cloud Relay gick offline för den här sessionen, nya gäster kanske inte kan ansluta till via vidarebefordring. Tänk på att dela igen.","Azure Cloud Relay gick offline för den här sessionen, nya gäster kanske inte kan ansluta till via vidarebefordring. Tänk på att dela igen.","Samarbetssessionen har avslutats på grund av ett internt fel."],"src/extension":[],"src/localizeCallback":["Vad vill du göra med andra medarbetare?","Bjud in andra (kopiera länk)","Kopiera inbjudningslänken så att du kan skicka den till andra deltagare.","Fokusera deltagare","Be andra deltagare att följa dig.","Dela skrivskyddad terminal","Dela Terminal","Starta en ny terminal/kommandotolk för användning av alla deltagare.","Dela Server","Exponera en lokal TCP-port för alla deltagare.","Visa delade servrar","Visa lokala TCP-servrar som delas med samarbetsdeltagare.","Sluta dela server","Sluta dela en lokal TCP-port för alla deltagare.","Stoppa samarbetssession","Stoppa samarbetssessionen, sluta dela allt innehåll och ta bort all deltagaråtkomst.","Logga in med ditt GitHub eller Microsoft-konto för att få läs- och skrivåtkomst.","Bifoga till en delad felsökningssession","Bifoga felsökningsprogrammet till en felsökningssession som värden har delat med deltagarna.","Åtkomst till delad terminal","Öppna terminalen som värden har delat med deltagarna.","Åtkomst till delad server","Kopiera en namngiven, delad TCP-port för användning","Lämna samarbetssession","Sluta delta i den här samarbetssessionen.","Vad vill du göra?","Starta samarbetssession","Starta en samarbetssession för att dela innehåll och bjuda in deltagare.","Starta skrivskyddad samarbetssession","Starta en skrivskyddad samarbetssession för att dela innehåll och bjuda in deltagare.","Anslut till samarbetssession","Anslut till en samarbetssession för att få åtkomst till delat innehåll.","Kopiera igen","Kopiera länk","Göra läs/skriv","Skrivskydda","Börja dela","Hjälp","OK","Logga in","Fortsätt som anonym","Mer information","Visa inte igen","Den här inbjudningslänken har upphört att gälla. Dela igen för att generera en ny länk.","Det gick inte att ansluta till servern. Kontrollera att du är ansluten till Internet.","$(shortName)-tjänsten kräver en nyare version av tillägget än det du har installerat.","Det filnamnstillägg som du har installerat kräver en nyare version av $(shortName)-tjänsten.","$(shortName)-tillägget som du har installerat är för gammalt för att ansluta till den här samarbetssessionen.","Den här värden för samarbetssession finns i en äldre version av $(shortName)-tillägget än vad du är.","$(shortName) agenten är nyare än tillägget","$(shortName) agenten är äldre än tillägget","Det går inte att dela i \"Direkt\" läge eftersom det inte finns några lämpliga IP-adresser. Växla till läget \"Auto\" eller \"Vidarebefordra\" och försök igen.","Det gick inte att hitta en kompatibel anslutningsadress. Växla till läget \"Auto\" och försök igen.","Det gick inte att ansluta till värden. Verifiera både du och värden är online.","Det gick inte att ansluta till värden i läget \"Vidarebefordra\". Kontrollera att du och värden är online. Om så är fallet, växla till läget \"Auto\" eller \"Direkt\" och försök igen.","Det gick inte att ansluta till värden i \"Direkt\" läge. Kontrollera att du och värden är online. Om så är fallet, växla till läget \"Auto\" eller \"Vidarebefordra\" och försök igen.","Det gick inte att ansluta värden på grund av ett protokollfel. Kontrollera att du och värden är online och använder den senaste versionen av $(shortName).","Det gick inte att ansluta värden på grund av ett autentiseringsfel. Kontrollera att värden är online, logga ut och logga sedan in igen och försök igen.","Det gick inte att ansluta värden på grund av ett autentiseringsfel. Kontrollera att värden är online, logga ut och logga sedan in igen och försök igen.","Oväntat autentiseringsfel. Försök att logga in igen.","Token-utbyte misslyckades med koden: ${code}","Värden tillåter inte direkta anslutningar. Växla till läget \"Auto\" eller \"Vidarebefordra\" och försök igen.","Det går inte att ansluta eftersom värden inte tillåter vidarebefordrade anslutningar. Växla till läget \"Auto\" eller \"Direkt\" och försök igen.","Det gick inte att ansluta till samarbetssessionen eftersom det redan har nått det maximala antalet 5 deltagare. Om du vill öka deltagargränsen ber du värden att ändra den ökade inställningen för gästgräns, Läs in och starta en ny samarbetssession.","Värden har avvisat dig från att delta i samarbetssessionen.","Tidsgränsen nåddes i väntan på att värden skulle svara på din begäran.","Begäran om att gå med i samarbetsprocessen avbröts.","Det går inte att hitta samarbetssessionen.","Värden har blockerat dig från att delta i samarbetet. Om detta var oavsiktligt så be du värden att starta om sessionen.","Det gick inte att ansluta till servern. Mottagen statuskod som inte lyckades.","Det gick inte att komma åt inloggnings nyckel ringen. Detta kan inträffa om du nyligen har ändrat ditt lösen ord eller om din inloggnings nyckel har skadats. Mer information om hur du löser det finns i mer information.","Värdens nätverkstillstånd är dåliga eller så är de inte längre anslutna till Live Share molnvidarebefordring. Be dem att kontrollera nätverkstillstånd, starta om samarbetssessionen och försök igen.","Det gick inte att ansluta till Live Share molnvidarebefordring. Kontrollera proxyn, brandväggen och nätverksinställningarna och försök igen.","Värden tillåter inte att felsökaren startas. Om det behövs kan du be dem att aktivera det.","Det gick inte att ansluta till servern. HTTPS-anslutningen misslyckades, verifiera att inga självsignerade certifikat eller valideringsprinciper för anpassade certifikat blockerar Live Share.","Det gick inte att skapa en planerad session","Det gick inte att ta bort en planerad session","Det gick inte att byta namn på planerad session","Det gick inte att kopiera en planerad sessionslänk","Det gick inte att ansluta till planerade sessioner","Det verkar som om du har en katalog med filer som har samma namn, förutom höljet. Det här stöds inte för tillfället och kan leda till fel.","Du kör VS Code utanför programmappen, så det går inte att installera stöd för att ansluta till sessioner med hjälp av en webbläsarlänk. Du kan fortfarande ansluta till sessioner manuellt.","Det gick inte att installera stöd för att ansluta till sessioner med hjälp av en webbläsarlänk. Du kan fortfarande ansluta till sessioner manuellt.","Öppnar fjärrsession...","Ansluter till fjärrsession...","Väntar på värdgodkännande...","Anslutningen bröts. Återansluter till värden...","Skapar planerad session...","Tar bort planerad session...","Det gick inte att hitta sökvägen: lazyLoad (() => nlsloc ($(path)","Sökvägen finns redan: lazyLoad (() => nlsloc ($(path)","Åtkomst nekad: lazyLoad (() => nlsloc ($(path)","Filen är för stor.","Filen är inte tillgänglig."," begärde att ansluta till samarbetssessionen.","Godkänn","Acceptera skrivskydd","Acceptera Läs/skriv","Avvisa","Acceptera alltid anonyma"," gick med i samarbetssessionen."," blev frånkopplad."," lämnade samarbetssessionen.","$(userId) fokuserat på din uppmärksamhet.","$(userId) begärde att du ska följa dem.","Sessionslänken har kopierats.","Information om samtidig redigering kopieras till Urklipp.","För att stödja anslutning till en session med hjälp av en webbläsarlänk måste vi ha behörighet att köra ett installationsprogram på datorn. Ditt operativsystem kan be dig om ditt administratörslösen ord (sudo) i en kommandotolk. Installera nu?","Installationskommando för starta webbläsarlänk har kopierats till Urklipp.","Du kan köra kommandot \"Live Share: Konfigurera startprogram\" för att slutföra integrationen senare.","Webbläsarlänkens startprogram har installerats.","Kopiera istället","Installera","Inbjudningslänken har kopierats till Urklipp! Skicka den till alla du litar på","Sessionen har delats! Klicka på \"Kopiera länk\" för att få en inbjudningslänk ","eller klicka på Mer information om du vill veta mer om säker delning.","En återanvändbar sessionslänk kopieras till Urklipp. Spara länken på en säker plats. Läs mer om hur du använder sessionen genom att klicka på Mer information.","En återanvändbar sessionslänk skapas! Klicka på “Kopiera länk” för att hämta länken. Spara länken på en säker plats. Läs mer om hur du använder sessionen genom att klicka på “Mer information”.","Logga in med VS Live Share för att ansluta till en samarbetssession.","Du måste logga in innan du ansluter till samarbetssessionen.","$(options.title)","Det går inte att redigera terminalen i skrivskyddat läge (anonym). Logga in för att fortsätta.","Välj en planerad session...","Upphör: ","Skapa planerad session...","Skapa en planerad session","Ange namnet på den planerade sessionen","Namnet kan inte vara tomt. Ange ett alfanumeriskt namn för sessionen","Namnet är ogiltigt. Ange ett alfanumeriskt namn för sessionen"," (Skrivskyddad)"," (Anonym och Skrivskyddad)"," (Anonym och Läs-Skriv)"," (Anonym)","I en Live Share-session","Skriv för att söka efter kontakter","Välj den närvaroleverantör som ska användas","Inbjuden","Inbjuden","Inbjuden","Starta samarbetssessionen..."," (Skrivskyddad)"," (Anonym och Skrivskyddad)"," (Anonym och Läs-Skriv)","Skrivskyddad användare","Fortsätt som","Fortsätt utan att logga in som en skrivskyddad gäst","Välj konto att logga in på","Logga in med ${key}-konto","Det går inte att skapa kommentarstråd","Det går inte att ta bort kommentarstråd","Kan inte svara","Det går inte att redigera kommentar","Det går inte att spara kommentar","Det går inte att avbryta redigering av kommentar","Det går inte att ta bort kommentar","ta bort andra kommentarer i tråden först","Kommentarer till Live Share-session","Deltagare:","Live Share Chat: $(unreads) nya","Chatt","Sessionschatt","Live Share-chatt","Välj en chatt-kanal","($(unread) ny)","$(username) skriver...","_har startat Live Share-sessionen_","_har avslutat Live Share-sessionen_","_har anslutit till Live Share-sessionen_","_har lämnat Live Share sessionen_","Värden för den här samarbetssessionen är för tillfället frånkopplad från chatten eller använder en version av _Live Share_ som inte stöder den här funktionen. [Läs mer] (https://aka.ms/vsls-chat)","Personen du försöker kontakta är för tillfället inte tillgänglig eller också använder du en version av _Live Share_ som inte stöder den här funktionen. [Läs mer] (https://aka.ms/vsls-chat)","Okänd användare","Chatta med den här kontakten","Öppna sessionens Chat-kanal","Chat-tjänsten är för tillfället frånkopplad. Försök igen om en stund.","Uppdatera companiontillägget Live Share chat. Den installerade versionen är inte längre kompatibel. [Läs mer] (https://aka.ms/vsls-chat)","Vad vill du göra?","$(x) Koppla från","Koppla från ljudsamtalet.","$(mute) Stäng av ljudet för dig själv","$(unmute) Slå på ljudet för dig själv","Stäng av ljudet så att andra inte kan höra dig.","Slå på ljudet på mikrofonen så att andra kan höra dig.","$(organization) Visa deltagare","Visa listan över Live Share-deltagare som för närvarande deltar i samtalet.","$(unmute) Konfigurera högtalare","Välj vilka högtalare som ska användas för ljudsamtalet.","$(megaphone) Konfigurera mikrofon","Välj vilken mikrofon som ska användas för ljudsamtalet.","Deltagare (0)","Anslut till ljudsamtal...","Starta ljudsamtal...","Ansluter till ljudsamtal...","Startar ljudsamtal...","Avslutar ljudsamtal...","Ljudsamtal","Deltagare i ljudsamtal ($(participantCount))","Okänd användare","$(displayName) (du)","Gå med","Ansluter ljud...","Kopplar från ljud...","Deltagare i ljudsamtal","Välj mikrofonen som ska användas","Välj den högtalare som ska användas","Ett ljudsamtal har startats för den här samarbetssessionen.","Resultatuppsättningen innehåller bara en delmängd av alla matchningar. Var mer specifik i sökningen för att begränsa resultaten.","[Nytt]","Värden har delat en server-$(sessionName) med dig. Vill du se det här i webbläsaren?","Ja","Nej","Det går inte att öppna server $(sessionName) i webbläsare. Värden har avdelat servern","Live Share-arbetsyta","Datorn har anteckningsboken öppen med","Använd samma visning för att öppna","Samtidig redigering stöds inte för anteckningsböcker som öppnas med icke-delade vyer.","Kärnan för att köra celler på värdens dator","Värden har gett dig åtkomst att köra anteckningsboksceller","Värden har avvisat din begäran om att köra anteckningsboksceller","Du kan inte köra anteckningsboksceller i en skrivskyddad session","Värden har inte gett dig behörighet att köra anteckningsboksceller","Begär åtkomst","Tillåt för den här sessionen","Tillåt alltid","Avvisa","En gäst begär behörighet att köra anteckningsboksceller","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Din arbetsyta har delats, men en eller flera mappar var inte lokala mappar och kunde inte ingå i den delade arbetsytan.","Det går inte att ansluta till Azure Relay, du kan bara samarbeta med gäster i samma nätverk. Kontrollera att nätverksbrandväggen eller DNS eller proxy inte blockerar åtkomst till Microsoft Azure Relay och försök igen."],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share är nu GA och vi vill tacka dig för att du har hjälpt oss att komma dit! Som ett Insider kommer du att få nya funktioner först.","Mer information","Växla till stabila funktioner"],"src/_new_/util/WorkspaceFirewallUtil":["Det gick inte att dela. Visual Studio Live Share är för närvarande i anslutningsläget \"Direkt\" och din brandvägg har blockerat inkommande säkra anslutningar som krävs för att starta en samarbetssession.\r\n\r\nFör att kunna dela måste du ändra brandväggsreglerna så att vsls-agent.exe acceptera inkommande anslutningar eller växla till anslutningsläget \"Auto\" eller \"Vidarebefordra\".","Brandväggen blockerar vsls-agent.exe från att acceptera direktanslutningar på portar Visual Studio Live Share kräver för att förbättra prestanda för medarbetare i samma nätverk.\r\n\r\nLive Share kommer nu att växla till anslutningsläget \"Vidarebefordra\" för alla framtida sessioner och dirigera trafik via en molnvidarebefordring. Klicka på \"Avbryt\" om du vill sluta dela istället","Visual Studio Live Share är för närvarande i anslutningsläget \"Direkt\" och måste acceptera inkommande säkra anslutningar när de ska fungera.\r\n\r\nDin brandvägg kommer nu att be dig att ge vsls-agent.exe åtkomst till de begärda portarna. Om du nekar åtkomst kan du inte dela.","Visual Studio Live Share är för närvarande i det anslutningsläget \"Auto\" som förbättrar prestanda för medarbetare i samma nätverk genom att acceptera inkommande säkra anslutningar vid delning.\r\n\r\nDin brandvägg kommer nu att be dig att ge vsls-agent.exe åtkomst till de begärda portarna. Om du nekar den här åtkomsten dirigeras alla anslutningar via en molnvidarebefordring i stället."],"src/abstractions/node/agent":[]}