{"src/commands":["Herstellen","Een update of installatie van VS Live Share is mislukt vanwege een beschadigde download.","Een update of installatie van VS Live Share is mislukt vanwege een beschadigde download.","Hebt u problemen met de installatie van uw Live Share?","$(messagePrefix) zorg dat u verbinding hebt met het netwerk en klik vervolgens op Herstellen om de VS-code opnieuw te starten en herstel te proberen.","Opnieuw","Kan het herstel niet voltooien omdat er bestanden in gebruik zijn. Beëindig alle processen van Visual Studio Live Share Agent (${processName}) en klik op Opnieuw","De host heeft de huidige samenwerkingssessie beëindigd. Geopende mappen en editors worden nu gesloten.","De samenwerkingssessie is verlopen. Meld u aan en probeer het opnieuw.","U bent verwijderd uit de samenwerkingssessie.","U bent geblokkeerd voor de samenwerkingssessie.","De verbinding met de samenwerkingssessie is verbroken vanwege een verbindingsprobleem of omdat de host offline is gegaan.","De samenwerkingssessie is beëindigd vanwege een interne fout.","De samenwerkingssessie is verlopen. Meld u aan en probeer het opnieuw.","De samenwerkingssessie is beëindigd omdat het netwerk offline gaat. Controleer uw netwerkstatus.","Azure Cloud Relay is offline gegaan voor deze sessie. Nieuwe gasten kunnen mogelijk niet deelnemen via Relay. Overweeg opnieuw te delen.","Azure Cloud Relay is offline gegaan voor deze sessie. Nieuwe gasten kunnen mogelijk niet deelnemen via Relay. Overweeg opnieuw te delen.","De samenwerkingssessie is beëindigd vanwege een interne fout."],"src/extension":[],"src/localizeCallback":["Wat wilt u doen met andere samenwerkers?","Anderen uitnodigen (koppeling kopiëren)","De uitnodigingskoppeling kopiëren zodat u deze naar andere deelnemers kunt verzenden.","Focus deelnemers","Vraag andere deelnemers om u te volgen.","Alleen-lezen terminal delen","Terminal delen","Start een nieuwe terminal/opdrachtprompt voor gebruik door alle deelnemers.","Server delen","Een lokale TCP-poort beschikbaar maken voor alle deelnemers.","Gedeelde servers weergeven","Lokale TCP-servers weergeven die zijn gedeeld met deelnemers aan de samenwerking.","Delen van server stoppen","Delen van een lokale TCP-poort voor alle deelnemers stoppen.","Samenwerkingssessie stoppen","Stop de samenwerkingssessie, stop met het delen van alle inhoud en verwijder alle toegang van deelnemers.","Meld u aan met uw GitHub- of Microsoft-account om lees-/schrijftoegang te krijgen.","Koppelen aan een gedeelde foutopsporingssessie","Koppel uw foutopsporingsprogramma aan een foutopsporingssessie die de host heeft gedeeld met deelnemers.","Gedeelde terminal openen","Open de terminal die de host heeft gedeeld met deelnemers.","Gedeelde server openen","Een benoemde, gedeelde TCP-poort kopiëren voor gebruik","Samenwerkingssessie verlaten","Deelname aan deze samenwerkingssessie stoppen.","Wat wilt u doen?","Samenwerkingssessie starten","Een samenwerkingssessie starten om inhoud te delen en deelnemers uit te nodigen.","Samenwerkingssessie voor alleen-lezen starten...","Een samenwerkingssessie voor alleen-lezen starten om inhoud te delen en deelnemers uit te nodigen.","Deelnemen aan samenwerkingssessie","Deelnemen aan een samenwerkingssessie voor toegang tot gedeelde inhoud.","Opnieuw kopiëren","Koppeling kopiëren","Lezen/schrijven maken","Alleen-lezen maken","Delen starten","Help","OK","Aanmelden","Doorgaan als anoniem","Meer informatie","Niet opnieuw weergeven","Deze uitnodigingskoppeling is verlopen. Deel opnieuw om een nieuwe koppeling te genereren.","Kan geen verbinding maken met de server. Controleer of u verbinding hebt met internet.","Voor de extensie die u hebt geïnstalleerd, is een nieuwere versie van de $(shortName) service vereist.","Voor de extensie die u hebt geïnstalleerd, is een nieuwere versie van de $(shortName) service vereist.","De $(shortName) extensie die u hebt geïnstalleerd, is te oud om verbinding te maken met deze samenwerkingssessie.","De host van de samenwerkingssessie bevindt zich op een oudere versie van de $(shortName) extensie dan dat u bent.","De $(shortName) agent is nieuwer dan de extensie","De $(shortName) agent is ouder dan de extensie","Kan niet delen in de modus Direct omdat er geen geschikte IP-adressen zijn. Schakel over naar de modus Auto of Relay en probeer het opnieuw.","Kan geen compatibel verbindingsadres vinden. Schakel over naar de modus Auto en probeer het opnieuw.","Kan geen verbinding maken met de host. Controleer of u en de host online zijn.","Kan geen verbinding maken met de host in de modus Relay. Controleer of u en de host online zijn. Als dat zo is, schakelt u over naar de modus Auto of Direct en probeer het opnieuw.","Kan geen verbinding maken met de host in de modus Direct. Controleer of u en de host online zijn. Als dat zo is, schakelt u over naar de modus Auto of Relay en probeert u het opnieuw.","Kan niet deelnemen aan de host vanwege een protocolfout. Controleer of u en de host online zijn en de nieuwste versie van $(shortName) gebruiken.","Kan niet deelnemen aan de host vanwege een verificatiefout. Controleer of de host online is, meld u af en meld u opnieuw aan en probeer het opnieuw.","Kan niet deelnemen aan de host vanwege een verificatiefout. Controleer of de host online is, meld u af en meld u opnieuw aan en probeer het opnieuw.","Onverwachte verificatiefout. Probeer u opnieuw aan te melden.","Tokenuitwisseling is mislukt met code: ${code}","De host staat geen directe verbindingen toe. Schakel over naar de modus Auto of Relay en probeer het opnieuw.","Kan geen verbinding maken omdat de host geen relayverbindingen toestaat. Schakel over naar de modus Auto of Direct en probeer het opnieuw.","Kan niet deelnemen aan de samenwerkingssessie omdat het maximum van 5 deelnemers al is bereikt. Als u de limiet voor deelnemers wilt verhogen, vraagt u de host om de Instelling voor verhoogde gastlimiet te wijzigen, opnieuw te laden en vervolgens een nieuwe samenwerkingssessie te starten.","De host heeft geweigerd dat u deelneemt aan de samenwerkingssessie.","Er is een time-out opgetreden terwijl er werd gewacht op de host om te antwoorden op uw aanvraag.","De aanvraag om deel te nemen aan de samenwerkingssessie is geannuleerd.","Samenwerkingssessie niet gevonden.","De host heeft u geblokkeerd om deel te nemen aan de samenwerking. Als dit per ongeluk is, vraagt u de host om de sessie opnieuw te starten.","Kan geen verbinding maken met de server. Statuscode ontvangen die niet is geslaagd.","Live Share heeft geen toegang tot de aanmeldingssleutelhanger. Dit kan gebeuren als u onlangs uw wachtwoord hebt gewijzigd of als uw aanmeldingssleutelhanger is beschadigd. Zie Meer informatie voor meer informatie over hoe u dit kunt oplossen.","De netwerkomstandigheden van de host zijn slecht of ze zijn niet langer verbonden met de Live Share-cloudrelay. Vraag hen om de netwerkomstandigheden te controleren, de samenwerkingssessie opnieuw te starten en het opnieuw te proberen.","Kan geen verbinding maken met Live Share-cloudrelay. Controleer de proxy-, firewall- en netwerkinstellingen en probeer het opnieuw.","De host staat niet toe dat het opsporingsprogramma wordt gestart. Vraag zo nodig om de functie in te schakelen.","Kan geen verbinding maken met de server. Https-verbinding is mislukt. Controleer of er geen zelfondertekende certificaten of aangepast certificaatvalidatiebeleid zijn die Live Share blokkeren.","Kan geen geplande sessie maken","Kan een geplande sessie niet verwijderen","Kan de naam van de geplande sessie niet wijzigen","Kan de koppeling van de geplande sessie niet kopiëren","Kan niet deelnemen aan geplande sessies","Het lijkt erop dat u een map hebt met bestanden met dezelfde naam, met uitzondering van het hoofdlettergebruik. Dit wordt momenteel niet ondersteund en kan leiden tot fouten.","U gebruikt de VS-code buiten de map Toepassingen, dus kan de ondersteuning voor het samenvoegen van sessies met een browserkoppeling niet worden geïnstalleerd. U kunt nog steeds handmatig deelnemen aan sessies.","Kan geen ondersteuning installeren voor het deelnemen aan sessies via een browserkoppeling. U kunt nog steeds handmatig deelnemen aan sessies.","Externe sessie openen...","Deelnemen aan externe sessie...","Wachten op goedkeuring van host...","Verbinding verbroken. Opnieuw verbinding maken met host...","Geplande sessie maken...","Geplande sessie verwijderen...","Pad niet gevonden: lazyLoad(() => nlsloc($(pad)","Pad bestaat al: lazyLoad(() => nlsloc($(pad)","Toegang geweigerd: lazyLoad(() => nlsloc($(path)","Bestand is te groot.","Bestand is niet beschikbaar."," heeft gevraagd om deel te nemen aan de samenwerkingssessie.","Accepteren","Alleen-lezen accepteren","Lezen/schrijven accepteren","Afwijzen","Altijd anoniem accepteren"," deelgenomen aan de samenwerkingssessie."," de verbinding was verbroken."," heeft de samenwerkingssessie verlaten.","$(userId) gericht op uw aandacht.","$(userId) heeft u gevraagd deze te volgen.","Sessiekoppeling gekopieerd.","Informatie over het samen bewerken wordt naar het Klembord gekopieerd.","Om deelname aan een sessie via een browserkoppeling te ondersteunen, hebben we toestemming nodig om een installatieprogramma op uw systeem uit te voeren. Uw besturingssysteem kan u vragen om uw beheerderswachtwoord (sudo) in een terminal. Nu installeren?","De starter van de installatieopdracht voor de browserkoppeling is gekopieerd naar het Klembord.","U kunt de opdracht Live Share: Launcher Setup uitvoeren om de integratie later te voltooien.","Startprogramma voor browserkoppelingen is geïnstalleerd.","In plaats daarvan kopiëren","Installeren","De uitnodigingskoppeling is gekopieerd naar het klembord. Verzenden naar iedereen die u vertrouwt","De sessie is gedeeld. Klik op Koppeling kopiëren om een uitnodigingskoppeling op te halen ","of klik op Meer informatie voor meer informatie over veilig delen.","Er wordt een herbruikbare sessiekoppeling naar het klembord gekopieerd. Sla de koppeling op een veilige locatie op. Klik op Meer informatie voor meer informatie over het gebruik van uw sessie.","Er wordt een herbruikbare sessiekoppeling gemaakt. Klik op \"Koppeling kopiëren\" om de koppeling op te halen. Sla de koppeling op een veilige locatie op. Klik op Meer informatie voor meer informatie over het gebruik van uw sessie.","Meld u aan met VS Live Share om deel te nemen aan een samenwerkingssessie.","U moet zich aanmelden voordat u deelneemt aan de samenwerkingssessie.","$(options.title)","Kan de terminal niet bewerken in de modus Alleen-lezen (anoniem). Meld u aan om door te gaan.","Een geplande sessie selecteren","Vervaldatum: ","Geplande sessie maken...","Een geplande sessie maken","De naam van de geplande sessie opgeven","De naam mag niet leeg zijn. Voer een alfanumerieke naam in voor de sessie","De naam is ongeldig. Voer een alfanumerieke naam in voor de sessie"," (Alleen-lezen)"," (Anoniem en alleen-lezen)"," (Anoniem en lezen/schrijven)"," (Anoniem)","In een Live Share-sessie","Typ om naar contactpersonen te zoeken","Selecteer de aanwezigheidsprovider die u wilt gebruiken","Uitgenodigd","Uitgenodigd","Uitgenodigd","Samenwerkingssessie starten..."," (Alleen-lezen)"," (Anoniem en alleen-lezen)"," (Anoniem en lezen/schrijven)","Alleen-lezen gebruiker","Doorgaan als","Doorgaan zonder u aan te melden als gast voor alleen-lezen","Selecteer een account om u aan te melden","Aanmelden met een ${key} account","Kan geen opmerkingenthread maken","Kan opmerkingenthread niet verwijderen","Kan niet antwoorden","Kan opmerking niet bewerken","Kan opmerking niet opslaan","Kan het bewerken van de opmerking niet annuleren","Kan opmerking niet verwijderen","verwijder eerst andere opmerkingen over de thread","Opmerkingen bij Live Share-sessie","Deelnemers:","Live Share-chat: $(ongelezen) nieuw","Chatten","Sessiechat","Live Share-chat","Een chatkanaal selecteren","($(ongelezen) nieuw)","$(username) is aan te typen...","_is de Live Share-sessie begonnen_","_heeft de Live Share-sessie beëindigd_","_is lid geworden van de Live Share-sessie_","_heeft de Live Share-sessie verlaten_","De host van deze samenwerkingssessie is momenteel niet verbonden met chat of gebruikt een versie van _Live Share_ die deze functie niet ondersteunt. [Meer informatie](https://aka.ms/vsls-chat)","De persoon waarmee u contact probeert op te nemen, is momenteel niet beschikbaar of gebruikt een versie van _Live Share_ die deze functie niet ondersteunt. [Meer informatie](https://aka.ms/vsls-chat)","Onbekende gebruiker","Chatten met deze contactpersoon","Sessiechatkanaal openen","De verbinding met de chatservice is momenteel verbroken. Probeer het over een ogenblik opnieuw.","Werk de companion-extensie Live Share-chat bij. De geïnstalleerde versie is niet meer compatibel. [Meer informatie](https://aka.ms/vsls-chat)","Wat wilt u doen?","$(x) Verbinding verbreken","Verbreek de verbinding met het audiogesprek.","$(dempen) Uzelf dempen","$(dempen opheffen) Dempen van uzelf opheffen","Demp uzelf zodat anderen u niet kunnen horen.","Dempen van uw microfoon opheffen zodat anderen u kunnen horen.","$(organisatie) Deelnemers weergeven","Bekijk de lijst met Live Share-deelnemers die momenteel deelnemen aan het gesprek.","$(dempen opheffen) Luidsprekers configureren","Selecteer welke luidsprekers u wilt gebruiken voor het audiogesprek.","$(megafoon) Microfoon configureren","Selecteer welke microfoon u wilt gebruiken voor het audiogesprek.","Deelnemers (0)","Deelnemen aan audiogesprek...","Audiogesprek starten...","Deelnemen aan audiogesprek...","Audiogesprek starten...","Audiogesprek beëindigen...","Audiogesprek","Deelnemers aan audiogesprek ($(participantCount))","Onbekende gebruiker","$(displayName) (u)","Deelnemen","Audio verbinden...","Audioverbinding verbreken...","Deelnemers aan audiogesprek","Selecteer de microfoon die u wilt gebruiken","Selecteer de luidspreker die u wilt gebruiken","Er is een audiogesprek gestart voor deze samenwerkingssessie.","De resultatenset bevat slechts een subset van alle overeenkomsten. Wees specifiek in uw zoekopdracht om de resultaten te beperken.","[Nieuw]","De host heeft een server $(sessionName) met u gedeeld. Wilt u dit in de browser bekijken?","Ja","Nee","Kan de server $(sessionName) niet openen in de browser. De host deelt de server niet meer","Live Share-werkruimte","De host heeft het notitieblok geopend met","Dezelfde weergave gebruiken om te openen","Samen bewerken wordt niet ondersteund voor notitieblokken die zijn geopend met niet-gedeelde weergaven.","Kernel voor het uitvoeren van cellen op de computer van de host","De host heeft u toegang verleend om cellen van notitieblokken uit te voeren","De host heeft uw aanvraag voor het uitvoeren van cellen van notitieblokken afgewezen","U kunt geen cellen van notitieblok uitvoeren in een sessie voor alleen-lezen","De host heeft u geen toestemming gegeven om cellen van het notitieblok uit te voeren","Toegang aanvragen","Toestaan voor deze sessie","Altijd toestaan","Afwijzen","Een gast vraagt om toestemming voor het uitvoeren van cellen van notitieblokken","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Uw werkruimte is gedeeld, maar een of meer mappen zijn geen lokale mappen en kunnen niet worden opgenomen in de gedeelde werkruimte.","Kan geen verbinding maken met Azure Relay. U kunt alleen samenwerken met gasten in hetzelfde netwerk. Controleer of de netwerkfirewall of DNS of proxy de toegang tot Microsoft Azure Relay niet blokkeert en probeer het opnieuw."],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share is nu algemeen beschikbaar en we willen u bedanken voor uw hulp. Als insider zal u als eerst nieuwe functies ontvangen.","Meer informatie","Overschakelen naar stabiele functies"],"src/_new_/util/WorkspaceFirewallUtil":["Kan niet delen. Visual Studio Live Share bevindt zich momenteel in de directe verbindingsmodus en uw firewall heeft binnenkomende beveiligde verbindingen geblokkeerd die nodig zijn om een samenwerkingssessie te starten.\r\n\r\nAls u wilt delen, moet u uw firewallregels wijzigen zodat vsls-agent.exe binnenkomende verbindingen kan accepteren of moet u overschakelen naar de verbindingsmodus Auto of Relay.","Uw firewall blokkeert dat vsls-agent.exe directe verbindingen accepteert op poorten, Visual Studio Live Share vereist dat de prestaties voor samenwerkers in hetzelfde netwerk moet verbeteren.\r\n\r\nLive Share schakelt nu over naar de verbindingsmodus Relay voor alle toekomstige sessies en stuurt verkeer via een cloudrelay. Druk op Annuleren om in plaats daarvan te stoppen met delen","Visual Studio Live Share bevindt zich momenteel in de directe verbindingsmodus en moet binnenkomende beveiligde verbindingen accepteren bij het delen om te kunnen functioneren.\r\n\r\nUw firewall vraagt u nu om vsls-agent.exe toegang te geven tot de vereiste poorten. Als u de toegang weigert, kunt u niet delen.","Visual Studio Live Share bevindt zich momenteel in de verbindingsmodus Auto, waardoor de prestaties voor samenwerkers op hetzelfde netwerk verbeteren door binnenkomende beveiligde verbindingen te accepteren tijdens het delen.\r\n\r\nU wordt nu door uw firewall gevraagd vsls-agent.exe toegang tot de vereiste poorten toe te kennen. Als u deze toegang weigert, worden alle verbindingen via een Cloudrelay gerouteerd."],"src/abstractions/node/agent":[]}