{"src/commands":["Onar","Bozuk bir indirme nedeniyle, VS Live Share güncelleştirmesi veya yüklemesi başarısız oldu.","Bozuk bir indirme nedeniyle, VS Live Share güncelleştirmesi veya yüklemesi başarısız oldu.","Live Share yüklemenizde sorunla mı karşılaşıyorsunuz?","$(messagePrefix) Ağ bağlantısına sahip olduğunuzdan emin olun ve VS Code'u yeniden başlatıp kurtarmayı denemek için `Onar`a tıklayın.","Yeniden dene","Dosyalar kullanımda olduğundan onarım bitirilemedi. Lütfen tüm Visual Studio Canlı Paylaşım Aracı (${processName}) işlemlerini sonlandırın ve 'Yeniden Dene'ye tıklayın","Oturum sahibi, geçerli işbirliği oturumunu sonlandırdı. Açık klasörler ve düzenleyiciler şimdi kapatılacak.","İşbirliği oturumunun süresi doldu. Lütfen oturum açın ve yeniden deneyin.","İşbirliği oturumundan çıkarıldınız.","İşbirliği oturumundan engellendiniz.","Bir bağlantı sorunu nedeniyle veya konak çevrimdışı olduğundan işbirliği oturumunuzun bağlantısı kesildi.","İşbirliği oturumu bir iç hata nedeniyle sona erdi.","İşbirliği oturumunun süresi doldu. Lütfen oturum açın ve yeniden deneyin.","İşbirliği oturumu, ağın çevrimdışı olması nedeniyle sona erdi. Ağ durumunuzu denetleyin.","Azure Bulut Geçişi bu oturum için çevrimdışı oldu, yeni konuklar geçiş aracılığıyla başarılı bir şekilde katılamayabilir. Yeniden paylaşmayı düşünün.","Azure Bulut Geçişi bu oturum için çevrimdışı oldu, yeni konuklar geçiş aracılığıyla başarılı bir şekilde katılamayabilir. Yeniden paylaşmayı düşünün.","İşbirliği oturumu bir iç hata nedeniyle sona erdi."],"src/extension":[],"src/localizeCallback":["Diğer ortak çalışanlarla ne yapmak istiyorsunuz?","Diğerlerini Davet Et (Bağlantıyı Kopyala)","Diğer katılımcılara gönderebilmek için davet bağlantısını kopyalayın.","Katılımcıların Dikkatini Çekme","Diğer katılımcıların sizi takip etmesini isteyin.","Salt Okunur Terminali Paylaş","Terminali Paylaş","Tüm katılımcıların kullanımı için yeni bir terminal/komut istemi başlatın.","Sunucuyu Paylaş","Tüm katılımcılar için yerel bir TCP bağlantı noktasını kullanıma sunun.","Paylaşılan Sunucuları Göster","İşbirliği katılımcılarıyla paylaşılan yerel TCP sunucularını göster.","Sunucu Paylaşımını Durdur","Tüm katılımcılar için yerel TCP bağlantı noktası paylaşımını durdurun.","İşbirliği Oturumunu Durdur","İşbirliği oturumunu durdur, tüm içeriği paylaşmayı durdur ve tüm katılımcıların erişimini kaldır.","Okuma/yazma erişimi elde etmek için GitHub veya Microsoft hesabınız ile oturum açın.","Paylaşılan bir Hata Ayıklama Oturumuna Ekle","Hata ayıklayıcınızı oturum sahibinin katılımcılarla paylaştığı bir hata ayıklama oturumuna ekleyin.","Paylaşılan Terminale Erişin","Oturum sahibinin katılımcılarla paylaştığı terminali açın.","Paylaşılan Sunucuya Erişin","Adlandırılmış, paylaşılmış bir TCP bağlantı noktasını kullanmak üzere kopyalama","İşbirliği Oturumundan Ayrıl","Bu işbirliği oturumuna katılımı durdurun.","Ne yapmak istersiniz?","İşbirliği Oturumunu Başlat","İçerik paylaşmak ve katılımcıları davet etmek için bir işbirliği oturumu başlatın.","Salt Okunur İşbirliği Oturumu Başlat","İçerik paylaşmak ve katılımcıları davet etmek için salt okunur bir işbirliği oturumu başlatın.","İşbirliği Oturumuna Katıl","Paylaşılan içeriğe erişmek için bir işbirliği oturumuna katılın.","Yeniden kopyala","Bağlantıyı kopyala","Okuma/yazma yap","Salt okunur yap","Paylaşımı Başlat","Yardım","Tamam","Oturum aç","Anonim olarak devam et","Daha fazla bilgi","Tekrar gösterme","Bu davet bağlantısının süresi oldu. Yeni bir bağlantı oluşturmak için yeniden paylaşın.","Sunucuya bağlanılamadı. İnternete bağlı olup olmadığınızı denetleyin.","$(shortName) hizmeti yüklü uzantının daha yeni bir sürümünü gerektiriyor.","Yüklediğiniz uzantı $(shortName) hizmetinin daha yeni bir sürümünü gerektiriyor.","Yüklediğiniz $(shortName) uzantısı bu işbirliği oturumuna katılmak için çok eski.","İşbirliği oturumu konağı, $(shortName) uzantısının daha eski bir sürümünü kullanıyor.","$(shortName) aracısı uzantıdan daha yeni","$(shortName) aracısı uzantıdan daha eski","Uygun IP adresi olmadığından \"Doğrudan\" modunda paylaşılamıyor. \"Otomatik\" veya \"Geçiş\" moduna geçin ve yeniden deneyin.","Uyumlu bağlantı adresi bulunamadı. \"Auto\" moduna geçin ve yeniden deneyin.","Oturum sahibine bağlanılamıyor. Kendinizin ve oturum sahibinin çevrimiçi olduğunu doğrulayın.","\"Relay\" modunda oturum sahibine bağlanılamıyor. Kendinizin ve oturum sahibinin çevrimiçi olduğunu doğrulayın. Çevrimiçiyseniz, \"Auto\" veya \"Direct\" moduna geçin ve yeniden deneyin.","\"Direct\" modunda oturum sahibine bağlanılamıyor. Kendinizin ve oturum sahibinin çevrimiçi olduğunu doğrulayın. Çevrimiçiyseniz, \"Auto\" veya \"Relay\" moduna geçin ve yeniden deneyin.","Bir protokol hatası nedeniyle konağa katılınamıyor. Hem sizin hem de konağın çevrimiçi olduğunu ve en son $(shortName) sürümünü kullandığını doğrulayın.","Bir kimlik doğrulama hatası nedeniyle oturum sahibine katılınamıyor. Oturum sahibinin çevimiçi olduğunu doğrulayın, ardından oturumu kapatıp yeniden açın ve yeniden deneyin.","Bir kimlik doğrulama hatası nedeniyle oturum sahibine katılınamıyor. Oturum sahibinin çevimiçi olduğunu doğrulayın, ardından oturumu kapatıp yeniden açın ve yeniden deneyin.","Beklenmeyen kimlik doğrulama hatası oluştu. Yeniden oturum açmayı deneyin.","Belirteç değişimi şu kodla başarısız oldu: ${code}","Oturum sahibi doğrudan bağlantılara izin vermiyor. \"Auto\" veya \"Relay\" moduna geçin ve yeniden deneyin.","Oturum sahibi geçişli bağlantılara izin vermediğinden bağlanılamıyor. \"Auto\" veya \"Direct\" moduna geçin ve yeniden deneyin.","En fazla 5 katılımcı sayısına zaten ulaşıldığından işbirliği oturumuna katılınamadı. Katılımcı sınırını artırmak için lütfen oturum sahibinden Artırılmış Konuk Sınırı ayarını değiştirmesini, yeniden yüklemesini ve yeni bir işbirliği oturumu başlatmasını isteyin.","Konak işbirliği oturumuna katılmanızı reddetti.","Oturum sahibinin isteğinizi yanıtlaması beklenirken zaman aşımı oluştu.","İşbirliği oturumuna katılma isteği iptal edildi.","İşbirliği oturumu bulunamadı.","Oturum sahibi, işbirliği oturumuna katılmanızı engelledi.","Sunucuya bağlanılamadı. Başarısız durum kodu alındı.","Live Share oturum açma anahtar zincirine erişemiyor. Bu durum yakın zamanda parolanızı değiştirdiyseniz veya oturum açma anahtar zinciri bozulduysa oluşabilir. Nasıl düzelteceğiniz hakkında ayrıntılı bilgi için diğer bilgilere bakın.","Oturum sahibinin ağ koşulları zayıf veya artık Canlı Paylaşım bulut geçişine bağlı değil. Ağ koşullarını denetlemesini isteyin, işbirliği oturumunu yeniden başlatın ve yeniden deneyin.","Live Share bulut geçişine bağlanılamıyor. Ara sunucu, güvenlik duvarı ve ağ ayarlarınızı denetleyin ve yeniden deneyin.","Oturum sahibi, hata ayıklayıcısını başlatmaya izin vermiyor. Gerekirse etkinleştirmesini isteyin.","Sunucuya bağlanamadı. HTTPS bağlantısı başarısız oldu. Canlı Paylaşım'ı engelleyen otomatik olarak imzalanan sertifika veya özel sertifika doğrulama ilkesi olmadığını doğrulayın.","Planlı Oturum oluşturulamadı","Planlı Oturum silinemedi","Planlı Oturum yeniden adlandırılamadı","Planlı Oturum bağlantısı kopyalanamadı","Planlı Oturumlara katılınamadı","Büyük/küçük harf kullanımı dışında aynı ada sahip dosyalar içeren bir dizine sahipsiniz gibi görünüyor. Bu işlem şu anda desteklenmiyor ve hatalara neden olabilir.","VS Code’u Uygulamalar klasörünün dışında çalıştırıyorsunuz, bu nedenle bir tarayıcı bağlantısı kullanarak oturumlara katılma desteği yükleyemiyoruz. Yine de oturumlara el ile katılabilirsiniz.","Tarayıcı bağlantısı kullanarak oturumlara katılma desteği yüklenemedi. Yine de oturumlara el ile katılabilirsiniz.","Uzak oturum açılıyor...","Uzak oturuma katılınıyor...","Oturum sahibinin onayı bekleniyor...","Bağlantı kesildi. Ana bilgisayara yeniden bağlanılıyor...","Planlı oturum oluşturuluyor...","Planlı oturum siliniyor...","Yol bulunamadı: lazyLoad(() => nlsloc($(path)","Yol zaten var: lazyLoad(() => nlsloc($(path)","Erişim reddedildi: lazyLoad(() => nlsloc($(path)","Dosya çok büyük.","Dosya kullanılamıyor.","işbirliği oturumuna katılma isteğinde bulundu.","Kabul Et","Salt okunur kabul et","Okuma-yazmayı kabul et","Reddet","Anonim kullanıcıları her zaman kabul et","işbirliği oturumuna katıldı.","bağlantısı kesildi.","işbirliği oturumunda ayrıldı.","$(userId) dikkatinizi çekti.","$(userId) kendisini takip etmenizi istedi.","Oturum bağlantısı kopyalandı.","Panoya kopyalanan bilgiler birlikte düzenleniyor.","Tarayıcı bağlantısı kullanarak bir oturuma katılmayı desteklemek için, sisteminizde bir yükleyici çalıştırma iznine ihtiyacımız var. İşletim sisteminiz sizden bir terminalde yönetici (sudo) şifrenizi isteyebilir. Şimdi yüklensin mi?","Tarayıcı bağlantı başlatıcısı yükleme komutu panoya kopyalandı.","Tümleştirmeyi daha sonra tamamlamak için “Live Share: Launcher Setup” komutunu çalıştırabilirsiniz.","Tarayıcı bağlantı başlatıcısı başarıyla yüklendi.","Bunun yerine kopyala","Yükle","Davet bağlantısı panoya kopyalandı! Bağlantıyı güvendiğiniz kişilere gönderin","Oturum paylaşıldı! Davet bağlantısı almak için “Bağlantıyı kopyala” seçeneğine tıklayın ","veya güvenli paylaşım hakkında bilgi edinmek için “Daha fazla bilgi” seçeneğine tıklayın.","Yeniden Kullanılabilir Oturum bağlantısı panoya kopyalandı! Bağlantıyı güvenli bir konuma kaydedin. \"Daha fazla bilgi\" seçeneğine tıklayarak Oturumunuzu nasıl kullanacağınız hakkında daha fazla bilgi edinin.","Yeniden Kullanılabilir Oturum bağlantısı oluşturuldu! Bağlantıyı almak için \"Bağlantıyı kopyala\" seçeneğine tıklayın. Bağlantıyı güvenli bir konuma kaydedin. \"Daha fazla bilgi\" seçeneğine tıklayarak Oturumunuzu nasıl kullanacağınız hakkında daha fazla bilgi edinin.","Bir işbirliği oturumuna katılmak için Visual Studio Live Share ile oturum açın.","İşbirliği oturumuna katılmadan önce oturum açmanız gerekiyor.","$(options.title)","Terminal salt okunur modunda (anonim) düzenlenemez. Devam etmek için giriş yapın.","Planlanmış bir oturum seç","Süre Sonu: ","Planlı oturum oluştur...","Planlı oturum oluştur","Planlı oturumun adını belirtin","Ad boş olamaz. Lütfen oturum için alfasayısal bir ad girin","Ad geçersiz. Lütfen oturum için alfasayısal bir ad girin"," (Salt okunur)"," (Anonim ve Salt okunur)"," (Anonim ve Okuma-Yazma)"," (Anonim)","Live Share oturumunda","Kişileri aramak için yazın","Kullanılacak iletişim durumu sağlayıcısını seçin","Davet edildi","Davet edildi","Davet edildi","İşbirliği oturumunu başlat..."," (Salt okunur)"," (Anonim ve Salt okunur)"," (Anonim ve Okuma-Yazma)","Salt okunur kullanıcı","Şu olarak devam et:","Salt okunur konuk olarak oturum açmadan devam et","Lütfen oturum açılacak hesabı seçin","${key} hesabını kullanarak oturum açın","Açıklama yazışması oluşturulamıyor","Açıklama yazışması silinemiyor","Yanıtlanamıyor","Yorum düzenlenemiyor","Yorum kaydedilemiyor","Yorum düzenleme iptal edilemiyor","Açıklama silinemiyor","önce yazışmadaki diğer açıklamaları silin","Canlı Paylaşım Oturumu Açıklamaları","Katılımcılar:","Live Share Sohbeti: $(unreads) yeni","Sohbet","Sohbet oturumu","Live Share Sohbeti","Sohbet kanalı seçin","($(unread) yeni)","$(username) yazıyor...","_Live Share oturumunu başlattı_","_Live Share oturumunu sonlandırdı_","_Live Share oturumuna katıldı_","_Live Share oturumundan ayrıldı_","Bu işbirliği oturumunun sahibi şu anda sohbete bağlı değil veya bu özelliği desteklemeyen bir _Live Share_ sürümü kullanıyor. [Daha fazla bilgi](https://aka.ms/vsls-chat)","Bağlantı kurmaya çalıştığınız kişi şu anda meşgul veya bu özelliği desteklemeyen bir _Live Share_ sürümü kullanıyor. [Daha fazla bilgi](https://aka.ms/vsls-chat)","Bilinmeyen kullanıcı","Bu kişiyle sohbet edin","Açık sohbet oturumu kanalı","Sohbet hizmetinin bağlantısı şu anda kesik. Lütfen kısa bir süre sonra tekrar deneyin.","`Live Share Chat` yardımcı uzantısını güncelleştirin. Yüklü sürüm artık uyumlu değil. [Daha fazla bilgi] (https://aka.ms/vsls-chat)","Ne yapmak istersiniz?","$(x) Bağlantıyı kes","Sesli arama bağlantısını kesin.","$(mute) Sesinizi Kapatın","$(unmute) Sesinizi Açın","Diğerlerinin sizi duymaması için sesinizi kapatın.","Diğerlerinin sizi duyabilmesi için mikrofonunuzun sesini açın.","$(organization) Katılımcıları Görüntüle","Şu anda aramada olan Live Share katılımcılarının listesini görüntüleyin.","$(unmute) Hoparlörleri Yapılandır","Sesli arama için kullanılacak hoparlörleri seçin.","$(megaphone) Mikrofonu Yapılandır","Sesli arama için kullanılacak mikrofonu seçin.","Katılımcılar (0)","Sesli aramaya katıl...","Sesli arama başlat...","Sesli aramaya katılınıyor...","Sesli arama başlatılıyor...","Sesli arama sonlandırılıyor...","Sesli Arama","Sesli Arama Katılımcıları ($(participantCount))","Bilinmeyen kullanıcı","$(displayName) (siz)","Katıl","Ses bağlantısı kuruluyor...","Ses bağlantısı kesiliyor...","Sesli Arama Katılımcıları","Kullanılacak mikrofonu seçin","Kullanılacak hoparlörü seçin","Bu işbirliği oturumu için bir sesli arama başlatıldı.","Sonuç kümesi, tüm eşleşmelerin yalnızca bir alt kümesini içeriyor. Lütfen sonuçları daraltmak için aramanızı daha belirgin hale getirin.","[Yeni]","Oturum sahibi sizinle $(sessionName) sunucusunu paylaştı. Bunu tarayıcıda görüntülemek istiyor musunuz?","Evet","Hayır","$(sessionName) sunucusu tarayıcıda açılamıyor. Oturum sahibi, sunucunun paylaşımını kaldırdı","Canlı Paylaşım Çalışma Alanı","Oturum sahibinde not defteri şununla açık:","Açmak için aynı görünümü kullan","Paylaşılmayan görünümlerle açılan not defterlerinde birlikte düzenleme işlemi desteklenmiyor.","Oturum sahibinin makinesinde hücrelerin yürütüleceği çekirdek","Oturum sahibi size not defteri hücrelerini çalıştırmak için erişim izni verdi","Oturum sahibi, not defteri hücrelerini çalıştırma isteğinizi reddetti","Salt okunur bir oturumda not defteri hücrelerini yürütemezsiniz","Oturum sahibi size not defteri hücrelerini çalıştırma izni vermedi","Erişim iste","Bu oturum için izin ver","Her zaman izin ver","Reddet","Bir konuk, not defteri hücrelerini çalıştırmak için izin istiyor","Join collaboration session...","Start read-only collaboration session...","Creating a Reusable Session link...","Failed to create a Reusable Session link","Sign in to presence will allow people to see your status based on your e-mail"],"src/_new_/commands/ShareCommand":["Çalışma alanınız paylaşıldı ancak bir veya daha fazla klasör yerel klasör olmadığından paylaşılan çalışma alanına eklenemedi.","Azure Relay ile bağlantı kurulamıyor, yalnızca aynı ağ üzerindeki konuklar ile işbirliği yapabilirsiniz. Lütfen ağ güvenlik duvarınızın, DNS'nizin veya ara sunucunuzun Microsoft Azure Relay erişimini engellemediğini doğrulayın ve yeniden deneyin."],"src/_new_/decorators/gaNotificationCommandDecorator":["Live Share artık GA aşamasında kullanılabilir. Buraya ulaşmamıza yardımcı olduğunuz için teşekkür ederiz! Bir Insider olarak, yeni özellikleri önce almaya devam edeceksiniz.","Daha fazla bilgi","Kararlı özelliklere geç"],"src/_new_/util/WorkspaceFirewallUtil":["Paylaşılamıyor. Visual Studio Live Share şu anda \"Doğrudan\" bağlantı modunda ve güvenlik duvarınız bir işbirliği oturumu başlatmak için gereken gelen güvenli bağlantıları engelliyor.\r\n\r\nPaylaşmak için, güvenlik duvarı kurallarınızı vsls-agent.exe dosyasına gelen bağlantıları kabul etme izni vermek için değiştirmeniz veya \"Otomatik\" ya da \"Geçiş\" bağlantı moduna geçmeniz gerekir.","Güvenlik duvarınız vsls-agent.exe dosyasının Visual Studio Live Share'in aynı ağ üzerinde işbirliği yapan kişiler için performansı iyileştirmek için gerektirdiği bağlantı noktaları üzerinde doğrudan bağlantıları kabul etmesini engelliyor.\r\n\r\nLive Share şimdi tüm gelecekteki oturumlar için \"Geçiş\" bağlantı moduna geçecek ve trafiği bir bulut geçişi üzerinden yönlendirecek. Bunun yerine paylaşmayı durdurmak için \"İptal\" seçeneğine basın","Visual Studio Live Share şu anda \"Doğrudan\" bağlantı modunda ve çalışmak için paylaşırken gelen güvenli bağlantıları kabul etmesi gerekiyor.\r\n\r\nGüvenlik duvarınız şimdi vsls-agent.exe dosyasına gereken bağlantı noktalarına erişim izni vermenizi isteyecek. Erişimi reddederseniz, paylaşmanız mümkün olmayacak.","Visual Studio Live Share şu anda paylaşım sırasında gelen güvenli bağlantıları kabul ederek aynı ağ üzerinde işbirliği yapan kişiler için performansı iyileştiren \"Otomatik\" bağlantı modunda.\r\n\r\nGüvenlik duvarınız şimdi vsls-agent.exe dosyasına gerekli bağlantı noktalarına erişim izni vermenizi isteyecek. Bu erişim iznini reddetmek tüm bağlantıları bir bulut geçişi üzerinden yönlendirir."],"src/abstractions/node/agent":[]}