cask_args appdir: '/Applications'

tap "aws/tap"
tap "heroku/brew"
tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/services"
tap "planetscale/tap/pscale"

# Search tool like grep, but optimized for programmers
brew "ack"

# Clone of cat with syntax highlighting and Git integration
brew "bat"

# Distributed revision control system
brew "git"

# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"

# Good-lookin' diffs with diff-highlight and more
brew "git-delta"

# In-depth comparison of files, archives, and directories
brew "diffoscope"

# Load/unload environment variables based on $PWD
brew "direnv"

# Modern replacement for 'ls'
brew "exa"

# Simple, fast and user-friendly alternative to find
brew "fd"

# Cleans up old and inactive forks on your GitHub account
brew "fork-cleaner"

# GitHub command-line tool
brew "gh"

# GNU Pretty Good Privacy (PGP) package
brew "gnupg"

# Open source programming language to build simple/reliable/efficient software
brew "go"

# Colorize logfiles and command output
brew "grc"

# Improved top (interactive process viewer)
brew "htop"

# Command-line benchmarking tool
brew "hyperfine"

# High-performance regular expression matching library
brew "hyperscan"

# Making APIs simple from the command line
brew "httpie"

# Lightweight and flexible command-line JSON processor
brew "jq"

# Command line JSON viewer
brew "fx"

# Mac App Store command-line interface
brew "mas"

# AWS SAM CLI
brew "aws-sam-cli"

# Simple tool to make locally trusted development certificates
brew "mkcert"

# Open source relational database management system
brew "mysql@5.7", restart_service: true
brew "mysql-client"

# Node version management
brew "n"

# Development kit for the Java programming language - see http://whichjdk.com/
brew "temurin"

# Powerful IDE - IDEA Ultimate
brew "intellij-idea"

# Process manager for Procfile-based applications and tmux
brew "overmind"

# Display the PID number for a given process name
brew "pidof"

# Protocol buffers (Google's data interchange format)
brew "protobuf"

# Ruby version manager
brew "rbenv"

# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"

# Search tool like grep and The Silver Searcher
brew "ripgrep"

# Powerful, clean, object-oriented scripting language
brew "ruby"

# Powerful, clean, object-oriented scripting language
brew "ruby@2.7"

# Powerful, clean, object-oriented scripting language
brew "ruby@3"

# Easy configuration of the system wide default browser (CLI)
brew "defaultbrowser"

# Internet file retriever
brew "wget"

# Screen recording utility
brew "kap"

# Download YouTube videos from the command-line
brew "youtube-dlc"

# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"

# Everything you need to get started with Heroku
brew "heroku/brew/heroku"

# Fixing command line typos!
brew "thefuck"

# Community driven man pages
brew "tldr"

# Password manager that keeps all passwords secure behind one password
cask "1password"

# Command-line helper for the 1Password password manager
cask "1password-cli"

# Voice and text chat software
cask "discord"

# App to build and share containerized applications and microservices
cask "docker"

# GIT client
cask "tower"

# GIT client (GitHub Desktop)
cask "github"

# Awesome terminal emulator
cask "iterm2"

# HTTP client that helps testing and describing APIs
cask "paw"

# GraphQL client
cask "altair-graphql-client"
cask "graphiql"

# HTTP and GraphQL Client
cask "insomnia"

# Host based application firewall
cask "little-snitch"

# Tool to remove unnecessary files and folders, and cleanly uninstall applications
cask "cleanmymac"

# VPN client for secure internet access and private browsing
cask "nordvpn"

# Web browser
cask "google-chrome"
cask "firefox"

# Open-source software for live streaming and screen recording
cask "obs"

# Silence embarrassing notifications while screensharing
cask "muzzle"

# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"

# Music streaming service
cask "spotify"

# Menu bar organiser
cask "bartender"

# Emoji picker
cask "rocket"

# Video game digital distribution service
cask "steam"

# Open-source code editor
cask "visual-studio-code"

# Video communication and virtual meeting platform
cask "zoom"

# AWS VPN
cask "aws-vpn-client"

# Aerial Screensaver (from Apple TV screensaver)
cask "aerial"

# 2FA software (also used on iPhone)
cask "authy"

# Communication and collaboration. And memes. And emoji!
cask "slack"

mas "Amphetamine", id: 937984704
mas "Bear" id: 1091189122
mas "Buffer", id: 1474298973
mas "Cardhop", id: 1290358394
mas "Cyberduck", id: 409222199
mas "Dato", id: 1470584107
mas "Fantastical", id: 975937182
mas "Hue Menu Bar", id: 1500678169
mas "iMazing HEIC Converter", id: 1292198261
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Mactracker", id: 430255202
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Petrify", id: 1451177988
mas "Pixelmator Pro", id: 1289583905
mas "RunCat", id: 1429033973
mas "Save to Pocket", id: 1477385213
mas "SmugMug", id: 1115348888
mas "StopTheMadness", id: 1376402589
mas "TextSniper", id: 1528890965
mas "Times", id: 1048770312
mas "Todoist", id: 585829637
mas "ToothFairy", id: 1191449274
mas "Tweetbot", id: 1384080005
mas "Whalebird", id: 1378283354
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835

# Install manually...
# Obsidian - https://obsidian.md/
