tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'
cask 'xquartz'
brew 'ack'
brew 'autoconf'
brew 'automake'
brew 'bash-completion'
brew 'libpng'
brew 'freetype'
brew 'fontconfig'
brew 'gettext'
brew 'libffi'
brew 'pcre'
brew 'glib'
brew 'pixman'
brew 'cairo'
brew 'cask'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'dos2unix'
brew 'openssl'
brew 'jpeg'
brew 'libtiff'
brew 'wxmac'
brew 'erlang'
brew 'elixir'
brew 'exercism'
brew 'faac'
brew 'lame'
brew 'git'
brew 'x264'
brew 'xvid'
brew 'ffmpeg'
brew 'pcre2'
brew 'fish'
brew 'webp'
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'pkg-config'
brew 'gobject-introspection'
brew 'shared-mime-info'
brew 'gdk-pixbuf'
brew 'giflib'
brew 'gmp'
brew 'gnu-sed'
brew 'libtasn1'
brew 'libunistring'
brew 'nettle'
brew 'p11-kit'
brew 'gnutls'
brew 'go'
brew 'libtool'
brew 'graphviz'
brew 'grc'
brew 'icu4c'
brew 'harfbuzz'
brew 'htop-osx'
brew 'hub'
brew 'perl'
brew 'xz'
brew 'imagemagick'
brew 'imlib2'
brew 'jp2a'
brew 'libcaca', args: ['with-imlib2']
brew 'libcroco'
brew 'libevent'
brew 'libssh2'
brew 'libgit2'
brew 'libgpg-error'
brew 'libksba'
brew 'pango'
brew 'librsvg'
brew 'libvo-aacenc'
brew 'readline'
brew 'sqlite'
brew 'python'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'mysql', restart_service: true
brew 'node'
brew 'ossp-uuid'
brew 'phantomjs'
brew 'postgresql', restart_service: true
brew 'qt5'
brew 'ruby-build'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'roundup'
brew 'ruby'
brew 'spark'
brew 'ssh-copy-id'
brew 'texinfo'
brew 'the_silver_searcher'
brew 'tmux'
brew 'unixodbc'
brew 'unrar'
brew 'utf8proc'
brew 'vim'
brew 'wget'
brew 'wrk'
brew 'yarn'
brew 'youtube-dl'
brew 'homebrew/dupes/apple-gcc42'
cask '1password'
cask 'adium'
cask 'atom'
cask 'emacs'
cask 'firefox'
cask 'garmin-express'
cask 'google-chrome'
cask 'handbrake'
cask 'mapbox-studio'
cask 'ngrok'
cask 'seashore'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
