cask_args appdir: '/Applications'
tap "azure/functions"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "joshuaclayton/formulae"
tap "koekeishiya/formulae"
tap "petere/postgresql"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "weaveworks/tap"
cask "xquartz"
brew "ack"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "libyaml"
brew "readline"
brew "unixodbc"
brew "asdf"
brew "aws-elasticbeanstalk"
brew "bash"
brew "bash-completion"
brew "bat"
brew "xz"
brew "python"
brew "cairo"
brew "gmp"
brew "libevent"
brew "libunistring"
brew "nettle"
brew "emacs", restart_service: true, link: false
brew "cask"
brew "cmake"
brew "ctags"
brew "ditaa"
brew "docker", link: false
brew "dos2unix"
brew "wxmac"
brew "elixir"
brew "exa"
brew "exercism"
brew "faac"
brew "fasd"
brew "fd"
brew "giflib"
brew "harfbuzz"
brew "lame"
brew "webp"
brew "ffmpeg"
brew "pcre2"
brew "fish"
brew "fzf"
brew "gd"
brew "gdb"
brew "git"
brew "git-extras"
brew "libgpg-error"
brew "libksba"
brew "gnupg", link: false
brew "go"
brew "graphviz"
brew "grc"
brew "helm"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "imagemagick@6"
brew "imlib2"
brew "ispell"
brew "jp2a"
brew "jq"
brew "kubernetes-cli"
brew "libcaca"
brew "libssh2"
brew "libgit2"
brew "pango"
brew "libvo-aacenc"
brew "libxml2"
brew "libxslt"
brew "mosh"
brew "multimarkdown"
brew "mysql", restart_service: true, link: false
brew "neovim"
brew "node"
brew "openldap"
brew "ossp-uuid"
brew "tmux"
brew "overmind"
brew "pandoc"
brew "perl"
brew "postgresql@9.6", restart_service: true, link: true
brew "postgresql", restart_service: true, link: false
brew "python@2"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "roundup"
brew "rsync"
brew "ruby"
brew "sk"
brew "spark"
brew "ssh-copy-id"
brew "texinfo"
brew "the_silver_searcher"
brew "unrar"
brew "utf8proc"
brew "vim"
brew "watchman"
brew "wget"
brew "wrk"
brew "xmlstarlet"
brew "yarn"
brew "zlib"
brew "azure/functions/azure-functions-core-tools"
brew "d12frosted/emacs-plus/emacs-plus", args: ["HEAD", "with-pdumper"]
brew "heroku/brew/heroku"
brew "joshuaclayton/formulae/unused"
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"], link: false
brew "weaveworks/tap/eksctl"
cask "alfred"
cask "caffeine"
cask "cyberduck"
cask "firefox"
cask "google-chrome"
cask "gpg-suite"
cask "iterm2"
cask "kitty"
cask "mactex"
cask "ngrok"
cask "slack"
