tap "fluxcd/tap"
tap "weaveworks/tap"

brew "aws-iam-authenticator"
brew "awscli"
brew "cocoapods"
brew "fastlane"
brew "helm"
brew "kubeconform"
brew "kustomize"
brew "ollama"
brew "pgformatter"
brew "pnpm"
brew "pre-commit"
brew "redis"
brew "sops"
brew "watchman"
brew "xcodes"
brew "yarn"
brew "fluxcd/tap/flux"
brew "weaveworks/tap/eksctl"

cask "android-studio"
cask "dbeaver-community"
cask "lens"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "slack"
cask "zoom"
cask "zulu@11"
cask "zulu@17"
cask "google-chrome"
