# JavaScript/TypeScript Development
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
esbenp.prettier-vscode
laegel.react-class-to-functional
nrwl.angular-console

# Python Development
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Java Development
oracle.oracle-java
redhat.java
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven

# Web Development
bradlc.vscode-tailwindcss
cssho.vscode-svgviewer
ginfuru.better-nunjucks
mjmlio.vscode-mjml
mrmlnc.vscode-scss
zignd.html-css-class-completion

# Cloud & DevOps
ahmadalli.vscode-nginx-conf
docker.docker
matthewpi.caddyfile-support
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
raynigon.nginx-formatter
redhat.ansible
zamerick.vscode-caddyfile-syntax

# Database
alexcvzz.vscode-sqlite
prisma.prisma
qwtel.sqlite-viewer

# Git & GitHub
bierner.markdown-preview-github-styles
eamodio.gitlens
formulahendry.github-actions
github.copilot
github.copilot-chat
github.vscode-github-actions

# Markdown & Documentation
bierner.markdown-preview-github-styles
sizodevelops.markdown-to-json
telesoho.vscode-markdown-paste-image
yzhang.markdown-all-in-one

# Utility & Enhancement
1000ch.svgo
aaron-bond.better-comments
adpyke.codesnap
alefragnani.project-manager
apollographql.vscode-apollo
bmalehorn.vscode-fish
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cschlosser.doxdocgen
cvbenur.ducky-script-lang-vscode
dakara.dakara-foldplus
dawhite.mustache
deerawan.vscode-faker
deque-systems.vscode-axe-linter
dotjoshjohnson.xml
dubadub.cook
editorconfig.editorconfig
expo.vscode-expo-tools
firsttris.vscode-jest-runner
formulahendry.auto-rename-tag
grapecity.gc-excelviewer
graphql.vscode-graphql-syntax
heaths.vscode-guid
hookyqr.minify
humy2833.ftp-simple
idleberg.applescript
jakewilson.vscode-placeholder-images
jasonnutter.vscode-codeowners
jeff-hykin.better-cpp-syntax
jsynowiec.vscode-insertdatestring
juanblanco.solidity
kukushi.pasteurl
marus25.cortex-debug
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
mechatroner.rainbow-csv
mikestead.dotenv
ml.nc-gcode
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.makefile-tools
ms-vscode.vscode-serial-monitor
ms-vscode.wordcount
natizyskunk.sftp
orta.vscode-jest
paulober.pico-w-go
platformio.platformio-ide
pnp.polacode
raspberry-pi.raspberry-pi-pico
redhat.vscode-yaml
sainoba.px-to-rem
sanchezpaco.vscode-destroyer
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
tamasfe.even-better-toml
tombonnike.vscode-status-bar-format-toggle
tomoki1207.pdf
twxs.cmake
tyriar.lorem-ipsum
unifiedjs.vscode-mdx
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vivaxy.vscode-conventional-commits
vsls-contrib.codetour
wallabyjs.console-ninja
will-stone.plastic
wix.glean
wix.vscode-import-cost
wmaurer.change-case
yatki.vscode-surround
yoavbls.pretty-ts-errors
zxh404.vscode-proto3

# Theme & UI
builders-club.onlythemes
ms-vscode.cpptools-themes

# Install all extensions with:
# cat extensions.txt | grep -v '^#' | xargs -L 1 code --install-extension
