tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "ack"
brew "autossh"
brew "python@3.9"
brew "cask"
brew "git"
brew "git-lfs"
brew "glances"
brew "gnupg"
brew "htop"
brew "libspatialite"
brew "pyenv"
brew "spatialite-gui"
brew "tmux"
brew "tree"
brew "virtualenv"
brew "zsh"
cask "adobe-acrobat-reader"
cask "calibre"
cask "db-browser-for-sqlite"
cask "dropbox"
cask "duplicati"
cask "electrum"
cask "exodus"
cask "istat-menus5"
cask "iterm2"
cask "libreoffice"
cask "osxfuse"
cask "pgadmin4"
cask "plex-media-player"
cask "private-internet-access"
cask "qgis"
cask "sabnzbd"
cask "send-to-kindle"
cask "signal"
cask "skype"
cask "spectacle"
cask "spotify"
cask "steam"
cask "transmission"
cask "vlc"
cask "whatsapp"
cask "xquartz"
