tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
brew "ack"
brew "aom"
brew "gettext"
brew "gmp"
brew "libffi"
brew "libunistring"
brew "libevent"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "unbound"
brew "gnutls"
brew "gwenhywfar", link: false
brew "libxmlsec1"
brew "python@3.8"
brew "aqbanking"
brew "autossh"
brew "icu4c"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "pcre"
brew "glib"
brew "lzo"
brew "pixman"
brew "cairo"
brew "emacs"
brew "cask"
brew "coreutils"
brew "dbus", restart_service: true
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "giflib"
brew "graphite2"
brew "harfbuzz"
brew "jpeg"
brew "lame"
brew "libtiff"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "libsamplerate"
brew "libsoxr"
brew "libvpx"
brew "opencore-amr"
brew "rtmpdump"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "ffmpeg"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git-lfs"
brew "glances"
brew "libusb"
brew "gnupg"
brew "graphviz"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "proj"
brew "libspatialite"
brew "youtube-dl"
brew "mpv"
brew "parallel"
brew "perl"
brew "pyenv"
brew "spatialindex"
brew "wxmac"
brew "spatialite-gui"
brew "tmux"
brew "tree"
brew "zsh"
brew "kde-mac/kde/kmymoney"
cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "calibre"
cask "db-browser-for-sqlite"
cask "duplicati"
cask "electrum"
cask "gnucash"
cask "istat-menus5"
cask "iterm2"
cask "osxfuse"
cask "pgadmin4"
cask "plex"
cask "plex-media-player"
cask "private-internet-access"
cask "qgis"
cask "sabnzbd"
cask "send-to-kindle"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "steam"
cask "usb-overdrive"
cask "vlc"
cask "whatsapp"
cask "xquartz"
cask "zoom"
